[
    {
        "urduURN": 4065310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6621,
        "hadithSanad": "ہم سے ابوالحسن محمد بن مقاتل مروزی نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ کبھی اپنی قسم نہیں توڑتے تھے ، یہاں تک کہ اللہ تعالیٰ نے قسم کاکفارہ اتارا ۔ اس وقت انہوں نے کہا کہ اب اگر میں کوئی قسم کھاؤں گا اور اس کے سوا کوئی چیز بھلائی کی ہو گی تو میں وہی کام کروں گا جس میں بھلائی ہو اور اپنی قسم کا کفارہ دے دوں گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 157350,
        "last_updated": null
    },
    {
        "urduURN": 4065320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6622,
        "hadithSanad": "ہم سے ابونعمان محمد بن فضل سدوسی نے بیان کیا ، کہا ہم سے جریر بن حازم نے بیان کیا ، کہا ہم سے امام حسن بصری نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، اے عبدالرحمٰن بن سمرہ ! کبھی کسی حکومت کے عہدہ کی درخواست نہ کرنا کیونکہ اگر تمہیں یہ مانگنے کے بعد ملے گا تو اللہ پاک اپنی مدد تجھ سے اٹھالے گا ۔ تو جان ، تیرا کام جانے اور اگر وہ عہدہ تمہیں بغیر مانگے مل گیا تو اس میں اللہ کی طرف سے تمہاری اعانت کی جائے گی اور جب تم کوئی قسم کھا لو اور اس کے سوا کسی اور چیز میں بھلائی دیکھو تو اپنی قسم کا کفارہ دے دو اور وہ کام کرو جو بھلائی کا ہو ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 157360,
        "last_updated": null
    },
    {
        "urduURN": 4065330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6623,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے غیلان بن جریر نے ، ان سے ابوہریرہ رضی اللہ عنہ نے ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "میں اشعری قبیلہ کی ایک جماعت کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے سواری مانگی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ واللہ ، میں تمہارے لئے سواری کا کوئی انتظام نہیں کر سکتا اور نہ میرے پاس کوئی سواری کا جانور ہے ۔ بیان کیا پھر جتنے دنوں اللہ نے چاہا ہم یونہی ٹھہرے رہے ۔ اس کے بعد تین اچھی قسم کی اونٹنیاں لائی گئیں اور آنحضرت صلی اللہ علیہ وسلم نے انہیں ہمیں سواری کے لئے عنایت فرمایا ۔ جب ہم روانہ ہوئے تو ہم نے کہا یا ہم میں سے بعض نے کہا ، واللہ ! ہمیں اس میں برکت نہیں حاصل ہو گی ۔ ہم آنحضرت صلی اللہ علیہ وسلم کی خدمت میں سواری مانگنے آئے تھے تو آپ نے قسم کھا لی تھی کہ آپ ہمارے لئے سواری کا انتظام نہیں کر سکتے ۔ اور اب آپ نے ہمیں سواری عنایت فرمائی ہے ہمیں آنحضرت صلی اللہ علیہ وسلم کے پاس جانا چاہئے اور آپ کو قسم یاد دلانی چاہئے ۔ چنانچہ ہم آپ کی خدمت میں حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے تمہاری سواری کا کوئی انتظام نہیں کیا ہے بلکہ اللہ تعالیٰ نے یہ انتظام کیا ہے اور میں ، واللہ ! کوئی بھی اگر قسم کھا لوں گا اور اس کے سوا کسی اور چیز میں بھلائی دیکھوں گا تو اپنی قسم کا کفارہ دے دوں گا ۔ جس میں بھلائی ہو گی یا آنحضرت صلی اللہ علیہ وسلم نے یوں فرمایا کہ وہی کروں گا جس میں بھلائی ہو گی اور اپنی قسم کا کفارہ ادا کر دوں گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 157370,
        "last_updated": null
    },
    {
        "urduURN": 4065340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6624,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، کہا ہم کو عبدالرزاق نے خبر دی ، کہا ہم کو معمر نے خبر دی ، ان سے ہمام بن منبہ نے بیان کیا کہ",
        "hadithText": "یہ وہ حدیث ہے جو ہم سے ابوہریرہ رضی اللہ عنہ نے بیان کی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ ” ہم آخری امت ہیں اور قیامت کے دن جنت میں سب سے پہلے داخل ہوں گے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 157380,
        "last_updated": null
    },
    {
        "urduURN": 4065350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6625,
        "hadithSanad": "sanad",
        "hadithText": "پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ واللہ ( بسا اوقات ) اپنے گھر والوں کے معاملہ میں تمہارا اپنی قسموں پر اصرار کرتے رہنا اللہ کے نزدیک اس سے زیادہ گناہ کی بات ہوتی ہے کہ ( قسم توڑ کر ) اس کا وہ کفارہ ادا کر دیا جائے جو اللہ تعالیٰ نے اس پر فرض کیا ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 157390,
        "last_updated": null
    },
    {
        "urduURN": 4065360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6626,
        "hadithSanad": "مجھ سے اسحاق یعنی ابن ابراہیم نے بیان کیا ، کہا ہم سے یحییٰ بن صالح نے بیان کیا ، انہوں نے کہا ہم سے معاویہ نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ نے ، ان سے عکرمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، وہ شخص جو اپنے گھر والوں کے معاملہ میں قسم پر اڑا رہتا ہے وہ اس سے بڑا گناہ کرتا ہے کہ اس قسم کا کفارہ ادا کر دے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 157400,
        "last_updated": null
    },
    {
        "urduURN": 4065370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6627,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے ایک فوج بھیجی اور اس کا امیر اسامہ بن زید کو بنایا ۔ بعض لوگوں نے ان کے امیر بنائے جانے پر اعتراض کیا تو آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور فرمایا اگر تم لوگ اس کے امیر بنائے جانے پر اعتراض کرتے ہو تو تم اس سے پہلے اس کے والد زید کے امیربنائے جانے پر بھی اعتراض کر چکے ہو اور خدا کی قسم ( وایم اﷲ ) زید ( رضی اللہ عنہ ) امیر بنائے جانے کے قابل تھے اور مجھے سب لوگوں سے زیادہ عزیز تھے اور یہ ( اسامہ رضی اللہ عنہ ) ان کے بعد مجھے سب سے زیادہ عزیز تھے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 157410,
        "last_updated": null
    },
    {
        "urduURN": 4065380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6628,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، ان سے سفیان نے ، ان سے موسیٰ بن عقبہ نے اور ان سے سالم نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی قسم بس اتنی تھی کہ نہیں ، دلوں کے پھیرنے والے اللہ کی قسم ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 157420,
        "last_updated": null
    },
    {
        "urduURN": 4065390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6629,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے عبدالملک نے ، ان سے جابر بن سمرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب قیصر ہلاک ہو جائے گا تو پھر اس کے بعد کوئی قیصر نہیں پیدا ہو گا اور جب کسریٰ ہلاک ہو جائے گا تو اس کے بعد کوئی کسریٰ نہیں پیدا ہو گا اور اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تم ان کے خزانے اللہ کے راستے میں خرچ کرو گے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 157430,
        "last_updated": null
    },
    {
        "urduURN": 4065400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6630,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہیں سعید بن مسیب نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب کسریٰ ( بادشاہ ایران ) ہلاک ہو جائے گا تو اس کے بعد کوئی کسریٰ نہیں پیدا ہو گا اور جب قیصر ( بادشاہ روم ) ہلاک ہو جائے گا تو اس کے بعد کوئی قیصر نہیں پیدا ہو گا اور اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تم ان کے خزانے اللہ کے راستے میں خرچ کرو گے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 157440,
        "last_updated": null
    },
    {
        "urduURN": 4065410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6631,
        "hadithSanad": "مجھ سے محمد بن سلام نے بیان کیا ، انہوں نے کہا ہم کو عبدہ نے خبر دی ، انہیں ہشام بن عروہ نے ، انہیں ان کے والد عروہ بن زبیر نے اور انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہو سلم نے فرمایا ، اے مت محمد ! واللہ ، اگر تم وہ جانتے جو میں جانتا ہوں تو زیادہ روتے اور کم ہنستے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 157450,
        "last_updated": null
    },
    {
        "urduURN": 4065420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6632,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا کہ مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا کہ مجھے حیوہ نے خبر دی ، کہا کہ مجھ سے ابوعقیل زہرہ بن معبد نے بیان کیا ، انہوں نے اپنے دادا عبداللہ بن ہشام سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ تھے اور آپ عمر بن خطاب رضی اللہ عنہ کا ہاتھ پکڑے ہوئے تھے ۔ عمر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! آپ مجھے ہر چیز سے زیادہ عزیز ہیں ، سوا میری اپنی جان کے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ ( ایمان اس وقت تک مکمل نہیں ہو سکتا ) جب میں تمہیں تمہاری اپنی جان سے بھی زیادہ عزیز نہ ہو جاؤں ۔ عمر رضی اللہ عنہ نے عرض کیا پھر واللہ ! اب آپ مجھے میری اپنی جان سے بھی زیادہ عزیز ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ہاں ، عمر ! اب تیرا ایمان پورا ہوا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 157460,
        "last_updated": null
    },
    {
        "urduURN": 4065430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عتبہ بن مسعود رضی اللہ عنہ نے ، انہیں ابوہریرہ رضی اللہ عنہ اور زید بن خالد رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "دو آدمیوں نے رسول اللہ صلی اللہ علیہ وسلم کی مجلس میں اپنا جھگڑا پیش کیا ۔ ان میں سے ایک نے کہا کہ ہمارے درمیان آپ کتاب اللہ کے مطابق فیصلہ کر دیں ۔ دوسرے نے ، جو زیادہ سمجھ دار تھا کہا کہ ٹھیک ہے ، یا رسول اللہ ! ہمارے درمیان کتاب اللہ کے مطابق فیصلہ کر دیجئیے اور مجھے اجازت دیجئیے کہ اس معاملہ میں کچھ عرض کروں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کہو ۔ ان صاحب نے کہا کہ میرا لڑکا اس شخص کے یہاں ” عسیف “ تھا ۔ عسیف اجیر کو کہتے ہیں ۔ ( اجیر کے معنی مزدور کے ہیں ) اور اس نے اس کی بیوی سے زنا کر لیا ۔ انہوں نے مجھ سے کہا کہ اب میرے لڑکے کو سنگسار کیا جائے گا ۔ اس لئے ( اس سے نجات دلانے کے لئے ) میں نے سو بکریوں اور ایک لونڈی کا انہیں فدیہ دے دیا پھر میں نے دوسرے علم والوں سے اس مسئلہ کو پوچھا تو انہوں نے بتایا کہ میرے لڑکے کی سزا یہ ہے کہ اسے سو کوڑے لگائے جائیں اور ایک سال کے لئے شہر بدر کر دیا جائے ، سنگساری کی سزا صرف اس عورت کو ہو گی ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں تمہارا فیصلہ کتاب اللہ کے مطابق کروں گا ۔ تمہاری بکریاں اور تمہاری لونڈی تمہیں واپس ہو گی اور پھر آپ نے اس کے لڑکے کو سو کوڑے لگوائے اور ایک سال کے لئے جلاوطن کر دیا ۔ پھر آپ نے انیس اسلمی سے فرمایا کہ مدعی کی بیوی کو لائے اور اگر وہ زنا کا اقرار کرے تو اسے سنگسار کر دے ۔ اس عورت نے زنا کا اقرار کر لیا اور سنگسار کر دی گئی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 157470,
        "last_updated": null
    },
    {
        "urduURN": 4065440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6635,
        "hadithSanad": "مجھ سے عبداللہ بن محمد نے بیان کیا ، کہا ہم سے وہب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے محمد بن ابی یعقوب نے ، ان سے عبدالرحمٰن بن ابی بکرہ نے اور ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا بھلا بتلاؤ اسلم ، غفار ، مزینہ اور جہینہ کے قبائل اگر تمیم ، عامر بن صعصعہ ، غطفان اور اسد والوں سے بہتر ہوں تو یہ تمیم اور عامر اور غطفان اور اسد والے گھاٹے میں پڑے اور نقصان میں رہے یا نہیں ۔ صحابہ نے عرض کیا ، جی ہاں بیشک ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر پھر فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ( وہ پہلے جن قبائل کا ذکر ہوا ) ان ( تمیم وغیرہ ) سے بہتر ہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 157480,
        "last_updated": null
    },
    {
        "urduURN": 4065450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6636,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، کہا کہ مجھے عروہ ثقفی نے خبر دی ، نہیں ابو حمید ساعدی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک عامل مقررکیا ۔ عامل اپنے کام پورے کر کے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا ، یا رسول اللہ ! یہ مال آپ کا ہے اور یہ مال مجھے تحفہ دیا گیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم اپنے ماں باپ کے گھر ہی میں کیوں نہیں بیٹھے رہے اور پھر دیکھتے کہ تمہیں کوئی تحفہ دیتا ہے یا نہیں ۔ اس کے بعد آپ خطبہ کے لئے کھڑے ہوئے ، رات کی نماز کے بعد اور کلمہ شہادت اور اللہ تعالیٰ کی اس کی شان کے مطابق ثنا کے بعد فرمایا امابعد ! ایسے عامل کو کیا ہو گیا ہے کہ ہم اسے عامل بناتے ہیں ۔ ( جزیہ اور دوسرے ٹیکس وصول کرنے کے لئے ) اور وہ پھر ہمارے پاس آ کر کہتا ہے کہ یہ تو آپ کا ٹیکس ہے اور مجھے تحفہ دیا گیا ہے ۔ پھر وہ اپنے ماں باپ کے گھر کیوں نہیں بیٹھا اور دیکھتاکہ اسے تحفہ دیا جاتا ہے یا نہیں ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، اگر تم میں سے کوئی بھی اس مال میں سے کچھ بھی خیانت کرے گا تو قیامت کے دن اسے اپنی گردن پر اٹھائے گا ۔ اگر اونٹ کی اس نے خیانت کی ہو گی تو اس حال میں لے کر آئے گا کہ آواز نکل رہی ہو گی ۔ اگر گائے کی خیانت کی ہو گی تو اس حال میں اسے لے کر آئے گا کہ گائے کی آواز آ رہی ہو گی ۔ اگر بکری کی خیانت کی ہو گی تو اس حال میں آئے گا کہ بکری کی آواز آ رہی ہو گی ۔ بس میں نے تم تک پہنچا دیا ۔ حضرت ابوحمید رضی اللہ عنہ نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے اپنا ہاتھ اتنی اوپر اٹھایا کہ ہم آپ کی بغلوں کی سفیدی دیکھنے لگے ۔ ابوحمید رضی اللہ عنہ نے بیان کیا کہ میرے ساتھ یہ حدیث زید بن ثابت رضی اللہ عنہ نے بھی آنحضرت صلی اللہ علیہ وسلم سے سنی تھی ، تم لوگ ان سے بھی پوچھ لو ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 157490,
        "last_updated": null
    },
    {
        "urduURN": 4065460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6637,
        "hadithSanad": "مجھ سے ابراہیم بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم کو ہشام بن یوسف نے خبر دی ، انہیں معمر نے ، انہیں ہمام بن منبہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم ! جس کے ہاتھ میں میری جان ہے اگر تم بھی آخرت کی وہ مشکلات جانتے جو میں جانتا ہوں تو تم زیادہ روتے اور کم ہنستے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 157500,
        "last_updated": null
    },
    {
        "urduURN": 4065470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6638,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے ہمارے والد نے ، کہا ہم سے اعمش نے ، ان سے معرور نے ، ان سے ابوذر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں آنحضرت صلی اللہ علیہ وسلم تک پہنچا تو آپ کعبہ کے سایہ میں بیٹھے ہوئے فرما رہے تھے کعبہ کے رب کی قسم ! وہی سب سے زیادہ خسارے والے ہیں ۔ کعبہ کے رب کی قسم وہی سب سے زیادہ خسارے والے ہیں ۔ میں نے کہا کہ حضور ، میری حالت کیسی ہے ، کیا مجھ میں ( بھی ) کوئی ایسی بات نظر آئی ہے ؟ میری حالت کیسی ہے ؟ پھر میں آنحضرت صلی اللہ علیہ وسلم کے پاس بیٹھ گیا اور آنحضرت صلی اللہ علیہ وسلم فرماتے جا رہے تھے ، میں آپ کو خاموش نہیں کرا سکتا تھا اور اللہ کی مشیت کے مطابق مجھ پر عجیب بےقراری طاری ہو گئی ۔ میں نے پھر عرض کی ، میرے ماں باپ آپ پر فدا ہوں ، یا رسول اللہ ! وہ کون لوگ ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ وہ لوگ ہیں جن کے پاس مال زیادہ ہے ۔ لیکن اس سے وہ مستثنیٰ ہیں ۔ جنہوں نے اس میں سے اس اس طرح ( یعنی دائیں اور بائیں بے دریغ مستحقین پر ) راہ خدا میں خرچ کیا ہو گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 157510,
        "last_updated": null
    },
    {
        "urduURN": 4065480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6639,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا سلیمان علیہ السلام نے ایک دن کہا کہ آج میں رات میں اپنی نوے بیویوں کے پاس جاؤں گا اور ہر ایک کے یہاں ایک گھوڑ سوار بچہ پیدا ہو گا جو اللہ کے راستہ میں جہاد کرے گا ۔ اس پر ان کے ساتھ نے کہا کہ انشاءاللہ ۔ لیکن سلیمان علیہ السلام نے انشاءاللہ نہیں کہا ۔ چنانچہ وہ اپنی تمام بیویوں کے پاس گئے لیکن ایک عورت کے سوا کسی کو حمل نہیں ہوا اور اس سے بھی ناقص بچہ پیدا ہوا اور اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے ! اگر انہوں نے انشاءاللہ کہہ دیا ہوتا تو ( تمام بیویوں کے یہاں بچے پیدا ہوتے ) اور سب گھوڑوں پر سوار ہو کر اللہ کے راستے میں جہاد کرنے والے ہوتے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 157520,
        "last_updated": null
    },
    {
        "urduURN": 4065490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6640,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم سے ابوالاحوص نے بیان کیا ، ان سے ابواسحاق نے ، ان سے براء  بن عازب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی خدمت میں ریشم کا ایک ٹکڑا ہدیہ کے طور پر آیا تو لوگ اسے دست بدست اپنے ہاتھوں میں لینے لگے اور اس کی خوبصورتی اور نرمی پرحیرت کرنے لگے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ تمہیں اس پر حیرت ہے ؟ صحابہ نے عرض کی جی ہاں ، یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، سعد رضی اللہ عنہ کے رومال جنت میں اس سے بھی اچھے ہیں ۔ شعبہ اور اسرائیل نے ابواسحاق سے الفاظ ” اس ذات کی قسم جس کے ہاتھ میں میری جان ہے “ کا ذکر نہیں کیا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 157530,
        "last_updated": null
    },
    {
        "urduURN": 4065500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6641,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، انہوں نے یونس سے ، انہوں نے ابن شہاب سے ، کہا مجھ سے عروہ بن زبیر نے بیان کیا کہ",
        "hadithText": "حضرت عائشہ رضی اللہ عنہا نے کہا کہ ہند بنت عتبہ بن ربیعہ ( معاویہ رضی اللہ عنہ کی ماں ) نے عرض کیا یا رسول اللہ ! ساری زمین پر جتنے ڈیرے والے ہیں ( یعنی عرب لوگ جو اکثر ڈیروں اور خیموں میں رہا کرتے تھے ) میں کسی کا ذلیل و خوار ہونا مجھ کو اتنا پسند نہیں تھا جتنا آپ کا ۔ یحییٰ بن بکیر راوی کو شک ہے ( کہ ڈیرے کا لفظ بہ صیغہ مفرد کہا یا بہ صیغہ جمع ) اب کوئی ڈیرہ والا یا ڈیرے والے ان کو عزت اور آبرو حاصل ہونا مجھ کو آپ کے ڈیرے والوں سے زیادہ پسند نہیں ہے ( یعنی اب میں آپ کی اور مسلمانوں کی سب سے زیادہ خیرخواہ ہوں ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا ابھی کیا ہے تو اور بھی زیادہ خیرخواہ بنے گی ۔ قسم ہے اس کی جس کے ہاتھ میں محمد کی جان ہے ۔ پھر ہند کہنے لگی یا رسول اللہ ! ابوسفیان تو ایک بخیل آدمی ہے مجھ پر گناہ تو نہیں ہو گا اگر میں اس کے مال میں سے ( اپنے بال بچوں کو کھلاؤں ) آپ نے فرمایا نہیں اگر تو دستور کے موافق خرچ کرے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 157540,
        "last_updated": null
    },
    {
        "urduURN": 4065510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6642,
        "hadithSanad": "مجھ سے احمد بن عثمان نے بیان کیا ، انہوں نے کہا ہم سے شریح بن مسلمہ نے بیان کیا ، انہوں نے کہا ہم سے ابراہیم نے بیان کیا ، ان سے ان کے والد نے بیان کیا ، ان سے ابواسحاق نے ، کہا کہ میں نے عمرو بن میمون سے سنا ، کہا کہ مجھ سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک موقع پر رسول اللہ صلی اللہ علیہ وسلم جب یمنی چمڑے کے خیمہ سے پشت لگائے ہوئے بیٹھے تھے تو آپ نے اپنے صحابہ سے فرمایا کیا تم اس پر خوش ہو کہ تم اہل جنت کے ایک چوتھائی رہو ؟ انہوں نے عرض کیا ، کیوں نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ کیا تم اس پر خوش نہیں ہو کہ تم اہل جنت کے ایک تہائی حصہ پاؤ ۔ صحابہ نے عرض کیا کیوں نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ، پس اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ! مجھے امید ہے کہ جنت میں آدھے تم ہی ہو گے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 157550,
        "last_updated": null
    },
    {
        "urduURN": 4065520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6643,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن عبداللہ بن عبدالرحمٰن نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صحابی نے سنا کہ ایک دوسرے صحابی سورۃ قل ھو اللہ باربار پڑھتے ہیں جب صبح ہوئی تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا ، وہ صحابی اس سورت کو کم سمجھتے تھے لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے یہ قرآن مجید کے ایک تہائی حصہ کے برابرہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 157560,
        "last_updated": null
    },
    {
        "urduURN": 4065530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6644,
        "hadithSanad": "مجھ سے اسحاق نے بیان کیا ، کہا ہم کو حبان نے خبر دی ، کہا ہم سے ہمام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "انہوں نے نبی کریم کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ فرما رہے تھے کہ رکوع اور سجدہ پورے طور پر ادا کیا کرو ۔ اللہ کی قسم جس کے ہاتھ میں میری جان ہے میں اپنی کمر کے پیچھے سے تم کو دیکھ لیتا ہوں جب رکوع اور سجدہ کرتے ہو ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 157570,
        "last_updated": null
    },
    {
        "urduURN": 4065540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6645,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، کہا ہم کو شعبہ نے خبر دی ہشام بن زید سے اور انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "انصاری خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں ، ان کے ساتھ ان کے بچے بھی تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے تم لوگ بھی مجھے تمام لوگوں میں سب سے زیادہ عزیز ہو ۔ یہ الفاظ آنحضرت صلی اللہ علیہ وسلم نے تین مرتبہ فرمائے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 157580,
        "last_updated": null
    },
    {
        "urduURN": 4065550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6646,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے مالک نے ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم عمر بن خطاب کے پاس آئے تو وہ سواروں کی ایک جماعت کے ساتھ چل رہے تھے اور اپنے باپ کی قسم کھا رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا خبردار تحقیق اللہ تعالیٰ نے تمہیں باپ دادوں کی قسم کھانے سے منع کیا ہے ، جسے قسم کھانی ہے اسے ( بشرط صدق ) چاہئے کہ اللہ ہی کی قسم کھائے ورنہ چپ رہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 157590,
        "last_updated": null
    },
    {
        "urduURN": 4065560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6647,
        "hadithSanad": "ہم سے سعید بن عفیرنے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے سالم نے کہ ابن عمر رضی اللہ عنہما نے کہا کہ میں نے عمر رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ اللہ تعالیٰ تمہیں باپ دادوں کی قسم کھانے سے منع کیا ہے ۔ حضرت عمر رضی اللہ عنہ نے بیان کیا واللہ ! پھر میں نے ان کی آنحضرت صلی اللہ علیہ وسلم سے ممانعت سننے کے بعد کبھی قسم نہیں کھائی نہ اپنی طرف سے غیر اللہ کی قسم کھائی نہ کسی دوسرے کی زبان سے نقل کی ۔ مجاہد نے کہا سورۃ الاحقاف میں جو اثارۃ من علم ہے اس کا معنی یہ ہے کہ علم کی کوئی بات نقل کرتا ہو ۔ یونس کے ساتھ اس حدیث کو عقیل اور محمد بن ولید زبیدی اور اسحاق بن یحییٰ کلبی نے بھی زہری سے روایت کیا اور سفیان بن عیینہ اور معمر نے اس کو زہری سے روایت کیا ، انہوں نے سالم سے ، انہوں نے ابن عمر رضی اللہ عنہما سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے کہ آپ نے حضرت عمر رضی اللہ عنہ کو غیر اللہ کی قسم کھاتے سنا ۔ روایت میں لفظ اثارۃ کی تفسیر آثراً کی مناسبت سے بیان کر دی کیونکہ دونوں کا مادہ ایک ہی ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 157600,
        "last_updated": null
    },
    {
        "urduURN": 4065570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6648,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عبدالعزیز بن مسلم نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن دینار نے بیان کیا ، انہوں نے کہا کہ میں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اپنے باپ دادوں کی قسم نہ کھاؤ ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 157610,
        "last_updated": null
    },
    {
        "urduURN": 4065580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6649,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے عبدالوہاب نے ، ان سے ایوب نے ، ان سے ابوقلابہ اور قاسم تیمی نے اور ان سے زہدم نے بیان کیا کہ",
        "hadithText": "ان قبائل جرم اور اشعر کے درمیان بھائی چارہ تھا ۔ ہم ابوموسیٰ اشعری رضی اللہ عنہ کی خدمت میں موجود تھے تو ان کے لئے کھانا لایا گیا ۔ اس میں مرغی بھی تھی ۔ ان کے پاس بنی تیم اللہ کا ایک سرخ رنگ کا آدمی بھی موجود تھا ۔ غالباً وہ غلاموں میں سے تھا ۔ ابوموسیٰ اشعری رضی اللہ عنہ نے اسے کھانے پر بلایا تو اس نے کہا کہ میں نے مرغی کو گندگی کھاتے دیکھا تو مجھے گھن آئی اور پھر میں نے قسم کھا لی کہ اب میں اس کا گوشت نہیں کھاؤں گا ۔ ابوموسیٰ اشعری رضی اللہ عنہ نے کہا کہ کھڑے ہو جاؤ تو میں تمہیں اس کے بارے میں ایک حدیث سناؤں ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس قبیلہ اشعر کے چند لوگوں کے ساتھ آیا اور ہم نے آنحضرت صلی اللہ علیہ وسلم سے سواری کا جانور مانگا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں تمہیں سواری نہیں دے سکتا اور نہ میرے پاس ایسا کوئی جانور ہے جو تمہیں سواری کے لئے دے سکوں ، پھر آنحضرت صلی اللہ علیہ وسلم کے پاس کچھ مال غنیمت کے اونٹ آئے تو آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ اشعری لوگ کہاں ہیں پھر آپ نے ہم کو پانچ عمدہ قسم کے اونٹ دئیے جانے کا حکم فرمایا ۔ جب ہم ان کو لے کر چلے تو ہم نے کہا یہ ہم نے کیا کیا رسول اللہ صلی اللہ علیہ وسلم تو قسم کھا چکے تھے کہ ہم کو سواری نہیں دیں گے اور درحقیقت آپ صلی اللہ علیہ وسلم کے پاس اس وقت سواری موجود بھی نہ تھی پھر آپ نے ہم کو سوار کرا دیا ۔ ہم نے رسول اللہ صلی اللہ علیہ وسلم کو آپ کی قسم سے غافل کر دیا ۔ قسم اللہ کی ہم اس حرکت کے بعد کبھی فلاح نہیں پاسکیں گے ۔ پس ہم آپ کی طرف لوٹ کر آئے اور آپ سے ہم نے تفصیل بالا کو عرض کیا کہ ہم آپ کے پاس آئے تھے تاکہ آپ ہم کو سواری پر سوار کرا دیں پس آپ نے قسم کھا لی تھی کہ آپ ہم کو سوار نہیں کرائیں گے اور درحقیقت اس وقت آپ کے پاس سواری موجود بھی نہ تھی ۔ آپ نے یہ سب سن کر فرمایا کہ میں نے تم کو سوارنہیں کرایا بلکہ اللہ نے تم کو سوار کرا دیا ۔ اللہ کی قسم جب میں کوئی قسم کھا لیتا ہوں بعد میں اس سے بہتر اور معاملہ دیکھتا ہوں تو میں وہی کرتا ہوں جو بہتر ہوتا ہے اور اس قسم کا کفارہ ادا کر دیتا ہوں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 157620,
        "last_updated": null
    },
    {
        "urduURN": 4065590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6650,
        "hadithSanad": "مجھ سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہوں نے کہا ہم سے زہری نے بیان کیا ، انہیں حمید بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے قسم کھائی اور کہا کہ ” لات و عزیٰ کی قسم “ تو اسے پھر کلمہ لا الہ الااﷲ کہہ لینا چاہئے اور جو شخص اپنے ساتھی سے کہے کہ آؤ جوا کھیلیں تو اسے چاہئے کہ ( اس کے کفارہ میں ) صدقہ کرے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 157630,
        "last_updated": null
    },
    {
        "urduURN": 4065600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6651,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے نافع نے ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنوائی اور آنحضرت صلی اللہ علیہ وسلم اسے پہنتے تھے ، اس کا نگینہ ہتھیلی کے حصے کی طرف رکھتے تھے ۔ پھر لوگوں نے بھی ایسی انگوٹھیاں بنوالیں اس کے بعد ایک دن آنحضرت صلی اللہ علیہ وسلم منبر پر بیٹھے اوراپنی انگوٹھی اتاردی اور فرمایا کہ میں اسے پہنتا تھا اور اس کا نگینہ اندر کی جانب رکھتا تھا ، پھر آپ صلی اللہ علیہ وسلم نے اسے اتار کر پھینک دیا اور فرمایا کہ اللہ کی قسم میں اب اسے کبھی نہیں پہنوں گا ۔ پس لوگوں نے بھی اپنی انگوٹھیاں اتار کر پھینک دیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 157640,
        "last_updated": null
    },
    {
        "urduURN": 4065610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6652,
        "hadithSanad": "ہم سے معلی بن اسعد نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، انہوں نے ایوب سے روایت کیا ، انہوں نے ابوقلابہ سے ، انہوں نے ثابت بن ضحاک سے ، انہوں نے کہا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا جو اسلام کے سوا کسی اور مذہب پر قسم کھائے پس وہ ایسا ہی ہے جیسی کہ اس نے قسم کھائی ہے اور جو شخص اپنے نفس کو کسی چیز سے ہلاک کرے وہ دوزخ میں اسی چیز سے عذاب دیا جاتا رہے گا اور مومن پر لعنت بھیجنا اس کو قتل کرنے کے برابر ہے اور جس نے کسی مومن پر کفر کا الزام لگایا پس وہ بھی اس کے قتل کرنے کے برابر ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 157650,
        "last_updated": null
    },
    {
        "urduURN": 4065620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6653,
        "hadithSanad": "اور عمرو بن عاصم نے کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے اسحاق بن عبداللہ نے ، کہا ہم سے عبدالرحمٰن بن ابی عمرہ نے ، ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ،",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے بنی اسرائیل میں تین شخص تھے اللہ نے ان کو آزمانا چاہا ( پھر سارا قصہ بیان کیا ) فرشتے کو کوڑھی کے پاس بھیجا وہ اس سے کہنے لگا میری روزی کے سارے ذریعے کٹ گئے ہیں اب اللہ ہی کا آسرا ہے پھر تیرا ( یا اب اللہ ہی کی مدد درکار ہے پھر تیری ) پھر پوری حدیث کو ذکر کیا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 157660,
        "last_updated": null
    },
    {
        "urduURN": 4065630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6654,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان ثوری نے ، انہوں نے اشعث بن ابی الشعثاء سے ، انہوں نے معاویہ بن سویدبن مقرن سے ، انہوں نے براء  بن عازب سے ، انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ( دوسری سند ) امام بخاری نے کہا اور مجھ سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے ، کہا ہم سے شعبہ نے ، انہوں نے اشعث سے ، انہوں نے معاویہ بن سوید بن مقرن سے ، انہوں نے براء رضی اللہ عنہ سے ، انہوں نے کہا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے قسم کھانے والے کو سچا کرنے کا حکم فرمایا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 157670,
        "last_updated": null
    },
    {
        "urduURN": 4065640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6655,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم کو عاصم الاحول نے خبر دی ، کہا میں نے ابوعثمان سے سنا ، وہ اسامہ سے نقل کرتے تھے کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم کی ایک صاحبزادی ( حضرت زینب ) نے آپ کو بلابھیجا اس وقت آپ کے پاس اسامہ بن زید اور سعد بن عبادہ اور ابی بن کعب رضی اللہ عنہم بھی بیٹھے تھے ۔ صاحبزادی صاحبہ نے کہلا بھیجا کہ ان کا بچہ مرنے کے قریب ہے آپ تشریف لائیے ۔ آپ نے ان کے جوابمیں یوں کہلا بھیجا میرا سلام کہو اور کہو سب اللہ کا مال ہے جو اس نے لے لیا اور جو اس نے عنایت فرمایا اور ہر چیز کا اس کے پاس وقت مقرر ہے ، صبر کرو اور اللہ سے ثواب کی امید رکھو ۔ صاحبزادی صاحبہ نے قسم دے کر پھر کہلابھیجا کہ نہیں آپ ضرور تشریف لائیے ۔ اس وقت آپ اٹھے ، ہم لوگ بھی ساتھ اٹھے جب آپ صاحبزادی صاحبہ کے گھر پر پہنچے اور وہاںجا کر بیٹھے تو بچے کو اٹھا کر آپ کے پاس لائے ۔ آپ نے اسے گودمیں بٹھالیا وہ دم توڑ رہا تھا ۔ یہ حال پر ملال دیکھ کر آپ کی آنکھوں سے آنسو بہہ نکلے ۔ سعد بن عبادہ رضی اللہ عنہ نے عرض کیا یا رسول اللہ ! یہ رونا کیسا ہے ؟ آپ نے فرمایا یہ رونا رحم کی وجہ سے ہے اور اللہ اپنے جس بندے کے دل میں چاہتا ہے رحم رکھتا ہے یا یہ ہے کہ اللہ اپنے ان ہی بندوں پر رحم کرے گا جو دوسروں پر رحم کرتے ہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 157680,
        "last_updated": null
    },
    {
        "urduURN": 4065650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6656,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا مجھ سے امام مالک نے ، انہوں نے ابن شہاب سے روایت کیا ، انہوں نے سعید بن مسیب سے روایت کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کیا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا جس مسلمان کے تین بچے مر جائیں تو اس کو دوزخ کی آگ نہیں چھوئے گی مگر صرف قسم اتارنے کے لئے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 157690,
        "last_updated": null
    },
    {
        "urduURN": 4065660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6657,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، کہا مجھ سے غندر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے معبد بن خالد نے ، کہا میں نے حارثہ بن وہب سے سنا ، کہا",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے کہ میں تم کو بتلاؤں بہشتی کون لوگ ہیں ۔ ہر ایک غریب ناتواں جو اگر اللہ کے بھروسے پر قسم کھا بیٹھے تو اللہ اس کو سچا کرے ( اس کی قسم پوری کر دے ) اور دوزخی کون لوگ ہیں ہر ایک موٹا ، لڑاکا ، مغرور ، فسادی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 157700,
        "last_updated": null
    },
    {
        "urduURN": 4065670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6658,
        "hadithSanad": "ہم سے سعد بن حفص نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے عبیدہ نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے پوچھا گیا کہ کون لوگ اچھے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرا زمانہ ، پھر وہ لوگ جو اس سے قریب ہوں گے پھر وہ لوگ جو اس سے قریب ہوں گے ۔ اس کے بعد ایک ایسی قوم پیدا ہو گی جس کی گواہی قسم سے پہلے زبان پر آجایا کرے گی اور قسم گواہی سے پہلے ۔ ابراہیم نے کہا کہ ہمارے اساتذہ جب ہم کم عمر تھے تو ہمیں قسم کھانے سے منع کیا کرتے تھے کہ ہم گواہی یا عہد میں قسم کھائیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 157710,
        "last_updated": null
    },
    {
        "urduURN": 4065680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6659,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن ابی عدی نے بیان کیا ، ان سے شعبہ نے ، ان سے سلیمان و منصور نے بیان کیا ، ان سے ابووائل نے بیان کیا ، اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے جھوٹی قسم اس مقصدسے کھائی کہ کسی مسلمان کا مال اس کے ذریعہ ناجائز طریقے پر حاصل کرے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ وہ اس پر غضب ناک ہو گا ۔ پھر اللہ تعالیٰ نے اس کی تصدیق نازل کی ( قرآن مجید میں کہ ) بلاشبہ وہ لوگ جو اللہ کے عہد کے ذریعہ خریدتے ہیں ۔ \n<span class=urdu_sanad>سلیمان نے بیان کیا کہ</span> پھر اشعث بن قیس رضی اللہ عنہ وہاں سے گزرے اور پوچھا کہ عبداللہ تم سے کیا بیان کر رہے تھے ۔ ہم نے ان سے بیان کیا تو اشعث رضی اللہ عنہ نے کہا کہ یہ آیت میرے اور میرے ایک ساتھی کے بارے میں نازل ہوئی تھی ۔ ایک کنویں کے سلسلے میں ہم دونوں کا جھگڑا تھا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 157720,
        "last_updated": null
    },
    {
        "urduURN": 4065700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شیبان نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جہنم برابر یہی کہتی رہے گی کہ کیا کچھ اور ہے کیا کچھ اور ہے ؟ آخر اللہ تبارک و تعالیٰ اپنا قدم اس میں رکھ دے گا تو وہ کہہ اٹھے گی بس بس میں بھر گئی ، تیری عزت کی قسم ! اور اس کا بعض حصہ بعض کو کھانے لگے گا ۔ اس روایت کو شعبہ نے قتادہ سے نقل کیا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 157740,
        "last_updated": null
    },
    {
        "urduURN": 4065710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6662,
        "hadithSanad": "ہم سے اویسی نے بیان کیا ، کہا ہم سے ابراہیم نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے ( دوسری سند ) اور ہم سے حجاج نے بیان کیا ، کہا ہم سے عبداللہ بن عمر نمیری نے بیان کیا ، کہا ہم سے یونس نے بیان کیا ، کہا کہ میں نے زہری سے سنا ، کہا کہ",
        "hadithText": "میں نے عروہ بن زبیر ، سعید بن مسیب ، علقمہ بن وقاص اور عبیداللہ بن عبداللہ رضی اللہ عنہما سے نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت صدیقہ رضی اللہ عنہا کی بات کے متعلق سنا کہ جب تہمت لگانے والے نے ان پر تہمت لگائی تھی اور اللہ تعالیٰ نے ان کو اس سے بری قرار دیا تھا ۔ اور ہر شخص نے مجھ سے پوری بات کا کوئی ایک حصہ ہی بیان کا ۔ پھر آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور عبداللہ بن ابی کے بارے میں مدد چاہی ۔ پھر اسید بن حضیر رضی اللہ عنہ کھڑے ہوئے اور سعد بن عبادہ رضی اللہ عنہ سے کہا کہ خدا کی قسم ( لعمراللہ ) ہم ضرور اسے قتل کر دیں گے ۔ مفصل حدیث پیچھے گزر چکی ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 157750,
        "last_updated": null
    },
    {
        "urduURN": 4065720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6663,
        "hadithSanad": "مجھ سے محمد بن مثنیٰ نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، ان سے ہشام بن عروہ نے ، کہا کہ مجھے میرے والد نے خبر دی ، انہیں حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "آیت ” اللہ تعالیٰ تم سے لغوقسموں کے بارے میں پکڑ نہیں کرے گا “ ۔ راوی نے بیان کیا کہ حضرت ام المؤمنین نے کہا کہ یہ آیت لاواﷲ بلی واﷲ ( بے ساختہ جو قسمیں عادت بنا لی جاتی ہیں ) کے بارے میں نازل ہوئی تھی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 157760,
        "last_updated": null
    },
    {
        "urduURN": 4065730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6664,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، کہا ہم سے مسعر بن کدام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، کہا ہم سے زرارہ بن اوفی نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سے کہ اللہ تعالیٰ نے میری امت کی ان غلطیوں کو معاف کیا ہے جن کا صرف دل میں وسوسہ گذرے یا دل میں اس کے کرنے کی خواہش پیدا ہو ، مگر اس کے مطابق عمل نہ ہو اور نہ بات کی ہو ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 157770,
        "last_updated": null
    },
    {
        "urduURN": 4065740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6665,
        "hadithSanad": "ہم سے عثمان بن الہیثم نے بیان کیا یا ہم سے محمد بن یحییٰ ذہلی نے عثمان بن الہیثم سے بیان کیا ، ان سے ابن جریج نے کہا کہ میں نے ابن شہاب سے سنا ، کہا کہ مجھ سے عیسیٰ بن طلحہ نے بیان کیا ، ان سے عبداللہ بن عمرو بن العاص نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( حجۃ الوداع میں ) قربانی کے دن خطبہ دے رہے تھے کہ ایک صحابی کھڑے ہوئے اور عرض کیا ، یا رسول اللہ ! میں فلاں فلاں ارکان کو فلاںفلاں ارکان سے پہلے خیال کرتا تھا ( اس غلطی سے ان کو آگے پیچھے ادا کیا ) اس کے بعد دوسرے صاحب کھڑے ہوئے اور عرض کیا یا رسول اللہ ! میں فلاں فلاں ارکان حج کے متعلق یونہی خیال کرتا تھا ان کا اشارہ ( حلق ، رمی اور نحر ) کی طرف تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یونہی کر لو ( تقدیم و تاخیر کرنے میں ) آج ان میں سے کسی کام میں کوئی حرج نہیں ہے ۔ چنانچہ اس دن آنحضرت صلی اللہ علیہ وسلم سے جس مسئلہ میں بھی پوچھا گیا تو آپ نے یہی فرمایا کہ کر لو کوئی حرج نہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 157780,
        "last_updated": null
    },
    {
        "urduURN": 4065750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6666,
        "hadithSanad": "ہم سے احمد یونس نے بیان کیا ، انہوں نے کہا ہم سے ابوبکر بن عیاش نے بیان کیا ، ان سے عبدالعزیز بن رفیع نے بیان کیا ، ان سے عطاء بن ابی رباح نے بیان کیا اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک صحابی نے نبی کریم صلیاللہ علیہ وسلم سے کہا ، میں نے رمی کرنے سے پہلے طواف زیارت کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کوئی حرج نہیں ۔ تیسرے نے کہا کہ میں نے رمی کرنے سے پہلے ہی ذبح کر لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کوئی حرج نہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 157790,
        "last_updated": null
    },
    {
        "urduURN": 4065760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6667,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، کہا ہم سے عبیداللہ بن عمر نے بیان کیا ، ان سے سعید بن ابی سعید نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صحابی مسجدنبوی میں نماز پڑھنے کے لئے آئے ۔ آنحضرت صلی اللہ علیہ وسلم مسجد کے ایک کنارے تشریف رکھتے تھے ۔ پھر وہ صحابی آئے اور سلام کیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جا پھر نماز پڑھ ، اس لئے کہ تو نے نماز نہیں پڑھی ۔ وہ واپس گئے اور پھر نماز پڑھ کر آئے اور سلام کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس مرتبہ بھی ان سے یہی فرمایا کہ واپس جا اور نماز پڑھ کیونکہ تو نے نماز نہیں پڑھی ۔ آخر تیسری مرتبہ میں وہ صحابی بولے کہ پھر مجھے نماز کا طریقہ سکھا دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب تم نماز کے لئے کھڑے ہوا کرو تو پہلے پوری طرح وضو کر لیا کرو ، پھر قبلہ رو ہو کر تکبیر کہو اور جو کچھ قرآن مجید میں تمہیں یاد ہے اور تم آسانی کے ساتھ پڑھ سکتے ہو اسے پڑھا کرو ، پھر رکوع کرو اور سکون کے ساتھ رکوع کرچکو تو اپنا سر اٹھاؤ اور جب سیدھے کھڑے ہو جاؤ تو سجدہ کرو ، جب سجدے کی حالت میں اچھی طرح ہو جاؤ تو سجدہ سے سراٹھاؤ ، یہاں تک کہ سیدھے ہو جاؤ اور اطمینان سے بیٹھ جاؤ ، پھر سجدہ کرو اور جب اطمینان سے سجدہ کر لو تو سر اٹھاؤ یہاں تک کہ سیدھے کھڑے ہو جاؤ ، یہ عمل تم اپنی پوری نماز میں کرو ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 157800,
        "last_updated": null
    },
    {
        "urduURN": 4065770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6668,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "جب احد کی لڑائی میں مشرک شکست کھا گئے اور اپنی شکست ان میں مشہور ہو گئی تو ابلیس نے چیخ کر کہا ( مسلمانوں سے ) کہ اے للہ کے بندو ! پیچھے دشمن ہے چنانچہ آگے کے لوگ پیچھے کی طرف پل پڑے اور پیچھے والے ( مسلمانوں ہی سے ) لڑ پڑے ۔ اس حالت میں حذیفہ بن الیمان رضی اللہ عنہ نے دیکھا کہ لوگ ان کے مسلمان والد کو بےخبری میں مار رہے ہیں تو انہوں نے مسلمانوں سے کہا کہ یہ تو میرے والد ہیں جو مسلمان ہیں ، میرے والد ! عائشہ رضی اللہ عنہا نے بیان کیا کہ اللہ کی قسم لوگ پھر بھی باز نہیں آئے اور آخر انہیں قتل کر ہی ڈالا ۔ حذیفہ نے کہا ، اللہ تمہاری مغفرت کرے ۔ عروہ نے بیان کیا کہ حذیفہ رضی اللہ عنہ کو اپنے والد کی اس طرح شہادت کا آخر وقت تک رنج اور افسوس ہی رہا یہاں تک کہ وہ اللہ سے جا ملے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 157810,
        "last_updated": null
    },
    {
        "urduURN": 4065780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6669,
        "hadithSanad": "مجھ سے یوسف بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے عوف اعرابی نے بیان کیا ، ان سے خلاص بن عمرو اور محمد بن سیرین نے کہا کہ حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے روزہ رکھا ہو اور بھول کر کھا لیا ہو تو اسے اپنا روزہ پورا کر لینا چاہئے کیونکہ اسے اللہ نے کھلایا پلایا ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 157820,
        "last_updated": null
    },
    {
        "urduURN": 4065790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6670,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، انہوں نے کہا ہم سے محمد بن عبدالرحمٰن بن ابی ذئب نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے اعرج نے اور ان سے حضرت عبداللہ بن بجینہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز پڑھائی اور پہلی دو رکعات کے بعد بیٹھنے سے پہلے ہی اٹھ گئے اور نماز پوری کر لی ۔ جب نماز پڑھ چکے تو لوگوں نے آنحضرت صلی اللہ علیہ وسلم کے سلام کا انتظار کیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے تکبیر کہی اورسلام پھیرنے سے پہلے سجدہ کیا ، پھر سجدہ سے سر اٹھایا اور دوبارہ تکبیر کہہ کر سجدہ کیا ۔ پھر سجدہ سے سر اٹھایا اورسلام پھیرا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 157830,
        "last_updated": null
    },
    {
        "urduURN": 4065800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6671,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے عبدالعزیز بن عبدالصمد سے سنا ، کہا ہم سے منصور بن معتمر نے بیان کیا ، ان سے ابراہیم نخعی نے ، ان سے علقمہ نے اور ان سے ابن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انہیں ظہر کی نماز پڑھائی اور نماز میں کوئی چیز زیادہ یا کم کر دی ۔ منصور نے بیان کیا کہ مجھے معلوم نہیں ابراہیم کو شبہ ہوا تھا یا علقمہ کو ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم سے کہا گیا کہ یا رسول اللہ ! نماز میں کچھ کمی کر دی گئی ہے یا آپ بھول گئے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا بات ہے ؟ لوگوں نے کہا کہ آپ نے اس اس طرح نماز پڑھائی ہے ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کے ساتھ دو سجدے ( سہو کے ) کئے اور فرمایا یہ دو سجدے اس شخص کے لئے ہیں جسے یقین نہ ہو کہ اس نے اپنی نماز میں کمی یا زیادہ کر دی ہے اسے چاہئے کہ صحیح بات تک پہنچنے کے لئے ذہن پر زور ڈالے اور جو باقی رہ گیا ہو اسے پورا کرے پھر دو سجدے ( سہوکے ) کر لے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 157840,
        "last_updated": null
    },
    {
        "urduURN": 4065810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6672,
        "hadithSanad": "ہم سے حضرت امام حمیدی نے بیان کیا ، کہا ہم سے حضرت سفیان بن عیینہ نے بیان کیا ، کہا ہم سے عمرو بن دینار نے بیان کیا ، کہا مجھ کو سعید بن جبیر نے خبر دی ، کہا کہ میں نے حضرت ابن عباس رضی اللہ عنہما سے پوچھا تو انہوں نے بیان کیا کہ ہم سے ابی بن کعب رضی اللہ عنہ نے بیان کیا ،",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آیت ” لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏ “ کے متعلق کہ پہلی مرتبہ اعتراض موسیٰ علیہ السلام سے بھول کر ہوا تھا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 157850,
        "last_updated": null
    },
    {
        "urduURN": 4065820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6673,
        "hadithSanad": "ابوعبداللہ ( حضرت امام بخاری ) نے کہا کہ محمد بن بشار نے مجھے لکھا کہ ہم سے معاذ بن معاذ نے بیان کیا ، کہا ہم سے ابن عون نے بیان کیا ، ان سے شعبی نے بیان کیا ، کہ حضرت براء  بن عازب رضی اللہ عنہ نے بیان کیا ،",
        "hadithText": "ان کے یہاں کچھ ان کے مہمان ٹھہرے ہوئے تھے تو انہوں نے اپنے گھر والوں سے کہا کہ ان کے واپس آنے سے پہلے جانور ذبح کر لیں تاکہ ان کے مہمان کھائیں ، چنانچہ انہوں نے نماز عیدالاضحی سے پہلے جانور ذبح کر لیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے حکم دیا کہ نماز کے بعد دوبارہ ذبح کریں ۔ براء رضی اللہ عنہ نے عرض کیا کہ یا رسول اللہ ! میرے پاس ایک سال سے زیادہ دودھ والی بکری ہے جو دو بکریوں کے گوشت سے بڑھ کر ہے ۔ ابن عوف شعبی کی حدیث کے اس مقام پر ٹھہر جاتے تھے اور محمد بن سیرین سے اسی حدیث کی طرح حدیث بیان کرتے تھے اور اس مقام پر رک کر کہتے تھے کہ مجھے معلوم نہیں ، یہ رخصت دوسرے لوگوں کے لئے بھی ہے یا صرف براء رضی اللہ عنہ کے لئے ہی تھی ۔ اس کی روایت ایوب نے ابن سیرین سے کی ہے ، ان سے انس رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 157860,
        "last_updated": null
    },
    {
        "urduURN": 4065830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6674,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے ، ان سے اسود بن قیس نے کہا کہ میں نے جندب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں اس وقت تک موجود تھا جب رسول اللہ صلی اللہ علیہ وسلم نے عید کی نماز پڑھائی پھر خطبہ دیا اور فرمایا کہ جس نے نماز سے پہلے ذبح کر لیا ہو اسے چاہئے کہ اس کی جگہ دوسرا جانور ذبح کرے اور جس نے ابھی ذبح نہ کیا ہو اسے چاہئے کہ اللہ کا نام لے کر جانور ذبح کرے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 157870,
        "last_updated": null
    },
    {
        "urduURN": 4065840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6675,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو نضر نے خبر دی ، کہا ہم کو شعبہ نے خبر دی ، کہا ہم سے فراس نے بیان کیا ، کہا کہ میں نے شعبی سے سنا ، انہوں نے عبداللہ بن عمرو سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کبیرہ گناہ اللہ کے ساتھ شرک کرنا ، والدین کی نافرمانی کرنا ، کسی کی ناحق جان لینا اور یمین غموس ۔ قصداً جھوٹی قسم کھانے کو کہتے ہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 157880,
        "last_updated": null
    },
    {
        "urduURN": 4065850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6676,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے جھوٹی قسم اس طور سے کھائی کہ اس کے ذریعہ کسی مسلمان کا مال ناجائز طریقہ سے حاصل کرے تو وہ اللہ تعالیٰ سے اس حال میں ملے گا کہ اللہ اس پر نہایت ہی غصہ ہو گا ۔ پھر اللہ تعالیٰ نے اس کی تصدیق وحی کے ذریعہ نازل کی کہ ” بلاشبہ وہ لوگ جو اللہ کے عہد اور اپنی قسموں کے بدلے معمولی دنیا کی پونجی خریدتے ہیں “ آخر آیت تک ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 157891,
        "last_updated": null
    },
    {
        "urduURN": 4065860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6678,
        "hadithSanad": "مجھ سے محمد بن علاء نے بیان کیا ، کہا ہم سے ابواسامہ نے بیان کیا ، ان سے برید نے ، ان سے ابوبردہ نے اور ان سے حضرت ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میرے ساتھیوں نے مجھے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں سواری کے جانور مانگنے کے لئے بھیجا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں تمہارے لئے کوئی سواری کا جانور نہیں دے سکتا ( کیونکہ موجود نہیں ہیں ) جب میں آپ کے سامنے آیا تو آپ کچھ خفگی میں تھے ۔ پھر جب دوبارہ آیا تو آپ نے فرمایا کہ اپنے ساتھیوں کے پاس جا اور کہہ کہ اللہ تعالیٰ نے یا ( یہ کہا کہ ) رسول اللہ صلی اللہ علیہ وسلم نے تمہارے لئے سواری کا انتظام کر دیا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 157910,
        "last_updated": null
    },
    {
        "urduURN": 4065870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6679,
        "hadithSanad": "ہم سے عبدالعزیز نے بیان کیا ، کہا ہم سے ابراہیم نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے ( دوسری سند ) اور ہم سے حجاج نے بیان کیا ، کہا ہم سے عبداللہ بن عمر نمیری نے بیان کیا ، کہا ہم سے یونس بن یزید ایلی نے بیان کیا ، کہا کہ میں نے زہری سے سنا ، کہا کہ",
        "hadithText": "میں نے عروہ بن زبیر ، سعید بن المسیب ، علقمہ بن وقاص اور عبیداللہ بن عبداللہ بن عتبہ رضی اللہ عنہم سے سنا ۔ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا پر بہتان کی بات کے متعلق ، جب ان پر اتہام لگانے والوں نے اتہام لگایا تھا اور اللہ تعالیٰ نے ان کو اس اتہام سے بری قرار دیا تھا ، ان سب لوگوں نے مجھ سے اس قصہ کا کوئی ایک ٹکڑا بیان کیا ( اس حدیث میں یہ بھی ہے کہ ) پھر اللہ تعالیٰ نے یہ آیت نازل کی کہ ” بلاشبہ جن لوگوں نے جھوٹی تہمت لگائی ہے “ دس آیتوں تک ۔ جو سب کی سب میری پاکی بیان کرنے کے لئے نازل ہوئی تھیں ۔ حضرت ابوبکر صدیق رضی اللہ عنہ مسطح رضی اللہ عنہ کے ساتھ قرابت کی وجہ سے ان کا خرچ اپنے ذمہ لئے ہوئے تھے ، کہا کہ اللہ کی قسم اب کبھی مسطح پر کوئی چیز ایک پیسہ خرچ نہیں کروں گا ۔ اس کے بعد کہ اس نے عائشہ رضی اللہ عنہا پر اس طرح کی جھوٹی تہمت لگائی ہے ۔ اس پر اللہ تعالیٰ نے یہ آیت نازل کی ۔ ولا يأتل أولو الفضل منكم والسعۃ أن يؤتوا أولي القربى‏ الخ ابوبکر رضی اللہ عنہ نے اس پر کہا ، کیوں نہیں ، اللہ کی قسم میں تو یہی پسند کرتا ہوں کہ اللہ میری مغفرت کر دے ۔ چنانچہ انہوں نے پھر مسطح کو وہ خرچ دینا شروع کر دیا جو اس سے پہلے انہیں دیا کرتے تھے اور کہا کہ اللہ کی قسم میں اب خرچ دینے کو کبھی نہیں روکوں گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 157920,
        "last_updated": null
    },
    {
        "urduURN": 4065880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6680,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، کہا ہم سے عبدالوارث نے ، کہا ہم سے ایوب نے بیان کیا ، ان سے قاسم نے ، ان سے زہدم نے بیان کیا کہ ہم ابوموسیٰ رضی اللہ عنہ کے پاس تھے تو انہوں نے بیان کیا کہ",
        "hadithText": "میں قبیلہ اشعر کے چند ساتھیوں کے ساتھ آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا جب میں آپ کے پاس آیا تو آپ غصہ تھے پھر ہم نے آپ سے سواری کا جانور مانگا تو آپ نے قسم کھا لی کہ آپ ہمارے لئے اس کا انتظام نہیں کر سکتے ۔ اس کے بعد فرمایا واللہ ، اللہ نے چاہا تو میں کبھی بھی اگر کوئی قسم کھا لوں گا اور اس کے سوا دوسری چیز میں بھلائی دیکھوں گا تو وہی کروں گا جس میں بھلائی ہو گی اور قسم توڑ دوں گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 157930,
        "last_updated": null
    },
    {
        "urduURN": 4065890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6681,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے بیان کیا ، انہیں سعید بن مسیب نے خبر دی ، ان کے والد ( حضرت مسیب رضی اللہ عنہ ) نے بیان کیا کہ",
        "hadithText": "جب جناب ابوطالب کی موت کی وقت قریب ہوا تو رسول اللہ صلی اللہ علیہ وسلم ان کے پاس آئے اور کہا کہ آپ کہہ دیجئیے کہ ” لا الہٰ الا اللہ “ تو میں آپ کے لیے اللہ سے جھگڑ سکوں گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 157940,
        "last_updated": null
    },
    {
        "urduURN": 4065900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6682,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے محمد بن فضیل نے بیان کیا ، انہوں نے کہا ہم سے عمارہ بن قعقاع نے بیان کیا ، انہوں نے کہا ہم سے ابوزرعہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا دو کلمے جو زبان پر ہلکے ہیں لیکن ترازو پر ( آخرت میں ) بھاری ہیں اور اللہ رحمن کے یہاں پسندیدہ ہیں وہ یہ ہیں ۔ سبحان اللہ و بحمدہ سبحان اللہ العظیم ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 157950,
        "last_updated": null
    },
    {
        "urduURN": 4065910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6683,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے شقیق نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اور میں نے ( اسی پر قیاس کرتے ہوئے ) دوسرا کلمہ کہا ( کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) جو شخص اس حال میں مر جائے گا کہ اللہ کے ساتھ کسی کو شریک ٹھہراتا ہو گا تو وہ جہنم میں جائے گا اور میں نے دوسری بات کہی کہ ” جو شخص اس حال میں مر جائے گا کہ اللہ کے ساتھ کسی کو شریک نہ ٹھہراتا ہو گا وہ جنت میں جائے گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 157960,
        "last_updated": null
    },
    {
        "urduURN": 4065920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6684,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے سلیمان بن بلال نے بیان کیا ، ان سے حمید نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کے ساتھ ایلاء کیا ( یعنی قسم کھائی کہ",
        "hadithText": "آپ ان کے یہاں ایک مہینہ تک نہیں جائیں گے ) اور آنحضرت صلی اللہ علیہ وسلم کے پاؤں میں موچ آ گئی تھی ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم اپنے بالا خانہ میں انتیس دن تک قیام پذیر رہے ۔ پھر وہاں سے اترے ۔ لوگوں نے کہا یا رسول اللہ ! آپ نے ایلاء ایک مہینے کے لئے کیا تھا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ مہینہ انتیس دن کا ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 157970,
        "last_updated": null
    },
    {
        "urduURN": 4065930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6685,
        "hadithSanad": "مجھ سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے عبدالعزیز بن ابی حازم سے سنا ، کہا مجھ کو میرے والد نے خبر دی ، انہیں حضرت سہل بن سعد رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے صحابی ابواسید رضی اللہ عنہ نے نکاح کیا اور آنحضرت صلی اللہ علیہ وسلم کو اپنی شادی کے موقع پر بلایا ۔ دلہن ہی ان کی میزبانی کا کام کر رہی تھیں ۔ پھر حضرت سہل رضی اللہ عنہ نے لوگوں سے پوچھا ، تمہیں معلوم ہے ، میں نے آنحضرت صلی اللہ علیہ وسلم کو کیا پلایا تھا ۔ کہا کہ رات میں آنحضرت صلی اللہ علیہ وسلم کے لئے میں نے کھجور ایک بڑے پیالہ میں بھگو دی تھی اور صبح کے وقت اس کا پانی آنحضرت صلی اللہ علیہ وسلم کو پلایا تھا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 157980,
        "last_updated": null
    },
    {
        "urduURN": 4065940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6686,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو اسماعیل بن ابی خالد نے خبر دی ، انہیں شعبی نے ، انہیں عکرمہ نے اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی بیوی صاحبہ حضرت سودہ رضی اللہ عنہا نے بیان کیا کہ ان کی ایک بکری مرگئی تو اس کے چمڑے کو ہم نے دباغت دے دیا ۔ پھر ہم اس کی مشک میں نبیذ بناتے رہے یہاں تک کہ وہ پرانی ہو گئی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 157990,
        "last_updated": null
    },
    {
        "urduURN": 4065950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6687,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے عبدالرحمٰن بن عابس نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "آل محمد صلی اللہ علیہ وسلم کبھی پے درپے تین دن تک سالن کے ساتھ گیہوں کی روٹی نہیں کھا سکے یہاں تک کہ آنحضرت صلی اللہ علیہ وسلم سے جا ملے اور ابن کثیر نے بیان کیا کہ ہم کو سفیان نے خبر دی کہ ہم سے عبدالرحمٰن نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے یہی حدیث بیان کی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 158000,
        "last_updated": null
    },
    {
        "urduURN": 4065960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6688,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "حضرت ابوطلحہ رضی اللہ عنہ نے ( اپنی بیوی ) ام سلیم رضی اللہ عنہا سے کہا کہ میں سن کر آ رہا ہوں آنحضرت صلی اللہ علیہ وسلم کی آواز ( فاقوں کی وجہ سے ) کمزور پڑ گئی ہے اور میں نے آواز سے آپ کے فاقہ کا اندازہ لگایا ہے ، کیا تمہارے پاس کھانے کی کوئی چیز ہے ؟ انہوں نے کہا ہاں ۔ چنانچہ انہوں نے جو کی چند روٹیاں نکالیں اور ایک اوڑھنی لے کر روٹی کو اس کے ایک کونے سے لپیٹ دیا اور اسے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں بھجوایا ۔ میں لے کر گیا تو میں نے دیکھا کہ آنحضرت صلی اللہ علیہ وسلم مسجد میں تشریف رکھتے ہیں اور آپ کے ساتھ کچھ لوگ ہیں ، میں ان کے پاس جاکے کھڑا ہو گیا تو آنحضرت صلی اللہ علیہ وسلم نے پوچھا ، کیا تمہیں ابوطلحہ نے بھیجا ہے ، میں نے عرض کیا جی ہاں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان لوگوں سے کہا جو ساتھ تھے کہ اٹھو اور چلو ، میں ان کے آگے آگے چل رہا تھا ۔ آخر میں حضرت ابوطلحہ رضی اللہ عنہ کے یہاں پہنچا اور ان کو اطلاع دی ۔ ابوطلحہ نے کہا ام سلیم ! جناب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ہیں اور ہمارے پاس تو کوئی ایسا کھانا نہیں ہے جو سب کو پیش کیا جا سکے ؟ انہوں نے کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے ۔ پھر حضرت ابوطلحہ رضی اللہ عنہ باہر نکلے اور آنحضرت صلی اللہ علیہ وسلم سے ملے ، اس کے بعد آنحضرت صلی اللہ علیہ وسلم اور ابوطلحہ گھر کی طرف بڑھے اور اندر گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ام سلیم ! جو کچھ تمہارے پاس ہے میرے پاس لاؤ ۔ وہ یہی روٹیاں لائیں ۔ راوی نے بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان روٹیوں کو چورا کر دیا گیا اور ام سلیم رضی اللہ عنہا نے اپنی ایک ( گھی کی ) کپی کو نچوڑا گیا یہی سالن تھا ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے جیسا کہ اللہ نے چاہا دعا پڑھی اور فرمایا کہ دس دس آدمیوں کو اندر بلاؤ انہیں بلایا گیا اور اس طرح سب لوگوں نے کھایا اور خوب سیر ہو گئے ۔ حاضرین کی تعداد ستر یا اسی آدمیوں کی تھی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 158020,
        "last_updated": null
    },
    {
        "urduURN": 4065970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6689,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے عبدالوہاب نے بیان کیا ، انہوں نے کہا میں نے یحییٰ بن سعید سے سنا ، انہوں نے کہا کہ مجھ سے محمد بن ابراہیم نے بیان کیا ، انہوں نے علقمہ بن وقاص لیثی سے سنا ، انہوں نے بیان کیا کہ میں نے حضرت عمر بن خطاب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا کہ بلاشبہ عمل کا دارومدار نیت پر ہے اور انسان کو وہی ملے گا جس کی وجہ نیت کرے گا پس جس کی ہجرت اللہ اور اس کے رسول کے لئے ہو گی تو واقعی وہ انہیں کے لئے ہو گی اور جس کی ہجرت دنیا حاصل کرنے کے لئے یا کسی عورت سے شادی کرنے کے لیے ہو گی تو اس کی ہجرت اسی کے لیے ہو گی جس کے لیے اس نے ہجرت کی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 158030,
        "last_updated": null
    },
    {
        "urduURN": 4065980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6690,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا مجھ کو یونس نے خبر دی ، انہیں ابن شہاب نے ، کہا مجھے عبدالرحمٰن بن عبداللہ بن کعب بن مالک نے خبر دی ،",
        "hadithText": "جب حضرت کعب رضی اللہ عنہ نابینا ہو گئے تھے تو ان کی اولاد میں ایک یہی کہیں آنے جانے میں ان کے ساتھ رہتے تھے ۔ انہوں نے بیان کیا کہ میں نے حضرت کعب بن مالک رضی اللہ عنہ سے ان کے واقعہ اور آیت ” وعلی الثلاثۃ الذین خلقوا “ کے سلسلہ میں سنا ، انہوں نے اپنی حدیث کے آخر میں کہا کہ ( میں نے آنحضرت صلی اللہ علیہ وسلم کے سامنے یہ پیش کش کی کہ ) اپنی توبہ کی خوشی میں میں اپنا مال اللہ اور اس کے رسول کے دین کی خدمت میں صدقہ کر دوں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اپنا کچھ مال اپنے پاس ہی رکھو ، یہ تمہارے لیے بہترہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 158040,
        "last_updated": null
    },
    {
        "urduURN": 4065990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6691,
        "hadithSanad": "ہم سے حسن بن محمد نے بیان کیا ، کہا ہم سے ابن جریج نے بیان کیا کہ عطاء کہتے تھے کہ انہوں نے عبید بن عمیر سے سنا ، کہا میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ، وہ کہتی تھیں کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم ( ام المؤمنین ) حضرت زینت بنت جحش رضی اللہ عنہا کے یہاں رکتے تھے اور شہد پیتے تھے ۔ پھر میں نے اور ( ام المؤمنین ) حفصہ ( رضی اللہ عنہا ) نے عہد کیا کہ ہم میں سے جس کے پاس بھی آنحضرت صلی اللہ علیہ وسلم آئیں تو وہ کہے کہ آنحضرت صلی اللہ علیہ وسلم کے منہ سے مغافیر کی بو آتی ہے ، آپ نے مغافیر تو نہیں کھائی ہے ؟ چنانچہ آنحضرت صلی اللہ علیہ وسلم جب ایک کے یہاں تشریف لائے تو انہوں نے یہی بات آپ سے پوچھی ۔ آپ نے فرمایا کہ نہیں بلکہ میں نے شہد پیا ہے زینت بنت جحش کے یہاں اور اب کبھی نہیں پیوں گا ۔ ( کیونکہ آنحضرت صلی اللہ علیہ وسلم کو یقین ہو گیا کہ واقعی اس میں مغافیر کی بو آتی ہے ) اس پر یہ آیت نازل ہوئی ۔ ” اے نبی ! آپ ایسی چیز کیوں حرام کرتے ہیں جو اللہ نے آپ کے لیے حلال کی ہے “ ۔ ” ان تتوباالی اللّٰہ “ میں عائشہ اور حفصہ رضی اللہ عنہا کی طرف اشارہ ہے اور ” اذا سرالنبی الی بعض ازواجہ “ سے اشارہ آنحضرت صلی اللہ علیہ وسلم کے اس ارشاد کی طرف ہے کہ ” نہیں “ میں نے شہد پیا ہے “ اور مجھ سے ابراہیم بن موسیٰ نے ہشام سے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ اب کبھی میں شہد نہیں پیوں گا میں نے قسم کھا لی ہے تم اس کی کسی کو خبر نہ کرنا ( پھر آپ نے اس قسم کو توڑ دیا ) ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 158050,
        "last_updated": null
    },
    {
        "urduURN": 4066000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6692,
        "hadithSanad": "ہم سے یحییٰ بن صالح نے بیان کیا ، انہوں نے کہا ہم سے فلیح بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے سعید بن الحارث نے بیان کیا ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے سنا ،",
        "hadithText": "انہوں نے کہا ، کیا لوگوں کو نذر سے منع نہیں کیا گیا ہے ؟ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ نذر کسی چیز کو نہ آگے کر سکتی ہے نہ پیچھے ، البتہ اس کے ذریعہ بخیل کا مال نکالا جا سکتا ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 158070,
        "last_updated": null
    },
    {
        "urduURN": 4066010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6693,
        "hadithSanad": "ہم سے خلاد بن یحییٰ نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے منصور نے ، انہوں نے کہا ہم کو عبداللہ بن مرہ نے خبر دی ، اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے نذر سے منع فرمایا تھا اور فرمایا تھا کہ وہ کسی چیز کو واپس نہیں کر سکتی ۔ البتہ اس کے ذریعہ بخیل کا مال نکالا جا سکتا ہے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 158080,
        "last_updated": null
    },
    {
        "urduURN": 4066020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6694,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا نذر انسان کو کوئی ایسی چیز نہیں دیتی جو اس کے مقدر میں نہ ہو ، البتہ اللہ تعالیٰ اس کے ذریعہ بخیل سے اس کا مال نکلواتا ہے اور اس طرح وہ چیزیں صدقہ کر دیتا ہے جس کی اس سے پہلے اس کی امید نہیں کی جا سکتی تھی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 158090,
        "last_updated": null
    },
    {
        "urduURN": 4066030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6695,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے یحییٰ نے ، ان سے شعبہ نے بیان کیا ، کہا مجھ سے ابوحمزہ نے بیان کیا ، کہا ہم سے زہدم بن مضرب نے بیان کیا ، کہا کہ",
        "hadithText": "میں نے عمران بن حصین سے سنا ، وہ نبی کریم صلی اللہ علیہ وسلم سے بیان کرتے تھے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم میں سب سے بہتر میرا زمانہ ہے ، اس کے بعد ان کا جو اس کے قریب ہوں گے ۔ اس کے بعد وہ جو اس سے قریب ہوں گے ۔ عمران نے بیان کیا کہ مجھے یاد نہیں آنحضرت صلی اللہ علیہ وسلم نے اپنے زمانہ کے بعد دو کا ذکر کیا تھا یا تین کا ( فرمایا کہ ) پھر ایک ایسی قوم آئے گی جو نذر مانے گی اور اسے پورا نہیں کرے گی ، خیانت کرے گی اور ان پر اعتماد نہیں رہے گا ۔ وہ گواہی دینے کے لیے تیار رہیں گے جب کہ ان سے گواہی کے لیے کہا بھی نہیں جائے گا اور ان میں مٹاپا عام ہو جائے گا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 158100,
        "last_updated": null
    },
    {
        "urduURN": 4066040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6696,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے طلحہ بن عبدالملک نے ، ان سے قاسم نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، جس نے اس کی نذر مانی ہو کہ اللہ کی اطاعت کرے گا تو اسے اطاعت کرنی چاہئے لیکن جس نے اللہ کی معصیت کی نذر مانی ہو اسے نہ کرنی چاہئے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 158110,
        "last_updated": null
    },
    {
        "urduURN": 4066050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6697,
        "hadithSanad": "ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو عبیداللہ بن عمرو نے خبر دی ، انہیں نافع نے ، انہیں حضرت ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے عرض کیا ، یا رسول اللہ ! میں نے جاہلیت میں نذر مانی تھی کہ مسجدالحرام میں ایک رات کا اعتکاف کروں گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنی نذر پوری کر ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 158120,
        "last_updated": null
    },
    {
        "urduURN": 4066060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6698,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، ان سے زہری نے ، انہیں عبیداللہ بن عبداللہ نے خبر دی ، انہیں ابن عباس رضی اللہ عنہما نے خبر دی ، انہیں سعد بن عبادہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے ایک نذر کے بارے میں پوچھا جو ان کی والدہ کے ذمہ باقی تھی اور ان کی موت نذر پوری کرنے سے پہلے ہو گئی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے انہیں فتویٰ اس کا دیا کہ نذر وہ اپنی ماں کی طرف سے پوری کر دیں ۔ چنانچہ بعد میں یہی طریقہ مسنونہ قرار پایا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 158130,
        "last_updated": null
    },
    {
        "urduURN": 4066070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6699,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوبشر نے ، کہا کہ میں نے سعید بن جبیر سے سنا ، ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور عرض کیا کہ میری بہن نے نذر مانی تھی کہ حج کریں گی لیکن اب ان کا انتقال ہو چکا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر ان پر کوئی قرض ہوتا تو کیا تم اسے ادا کرتے ؟ انہوں نے عرض کی ضرور ادا کرتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر اللہ کا قرض بھی ادا کرو کیونکہ وہ اس کا زیادہ مستحق ہے کہ اس کا قرض پورا ادا کیا جائے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 158140,
        "last_updated": null
    },
    {
        "urduURN": 4066080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6700,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، ان سے امام مالک نے ، ان سے طلحہ بن عبدالملک نے ، ان سے قاسم نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے اللہ کی اطاعت کی نذر مانی ہو اسے چاہئے کہ اطاعت کرے اور جس نے گناہ کرنے کی نذر مانی ہو پس وہ گناہ نہ کرے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 158150,
        "last_updated": null
    },
    {
        "urduURN": 4066090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6701,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے حمید نے ، ان سے ثابت نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ اس سے بےپروا ہے کہ یہ شخص اپنی جان کو عذاب میں ڈالے ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے دیکھا کہ وہ اپنے دو بیٹوں کے درمیان چل رہا تھا اور فزاری نے بیان کیا ، ان سے حمید نے ، ان سے ثابت نے بیان کیا اور ان سے حضرت انس رضی اللہ عنہ نے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 158160,
        "last_updated": null
    },
    {
        "urduURN": 4066100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6702,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے ، ان سے سلیمان احول نے ، ان سے طاؤس نے ، ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو دیکھا کہ وہ کعبہ کا طواف لگام یا اس کے سوا کسی اور چیز کے ذریعہ کر رہا تھا تو آنحضرت صلی اللہ علیہ وسلم نے اسے کاٹ دیا ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 158170,
        "last_updated": null
    },
    {
        "urduURN": 4066110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6703,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ، کہا ہم کو ہشام نے خبر دی ، انہیں ابن جریج نے خبر دی ، کہا کہ مجھے سلیمان احول نے خبر دی ، انہیں طاؤس نے خبر دی اور انہیں حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم گزرے تو کعبہ کا ایک شخص اس طرح طواف کر رہا تھا کہ دوسرا شخص اس کی ناک میں رسی باندھ کر اس کے آگے سے اس کی رہنمائی کر رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے وہ رسی اپنے ہاتھ سے کاٹ دی ، پھر حکم دیا کہ ہاتھ سے اس کی رہنمائی کرے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 158180,
        "last_updated": null
    },
    {
        "urduURN": 4066120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6704,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے ، کہا ہم سے ایوب نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ ایک شخص کو کھڑے دیکھا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس کے متعلق پوچھا تو لوگوں نے بتایا کہ یہ ابواسرائیل نامی ہیں ۔ انہوں نے نذر مانی ہے کہ کھڑے ہی رہیں گے ، بیٹھیں گے نہیں ، نہ کسی چیز کے سایہ میں بیٹھیں گے اور نہ کسی سے بات کریں گے اور روزہ رکھیں گے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ان سے کہو کہ بات کریں ، سایہ کے نیچے بیٹھیں اٹھیں اور اپنا روزہ پورا کر لیں ۔ عبدالوہاب نے بیان کیا کہ ہم سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 158190,
        "last_updated": null
    },
    {
        "urduURN": 4066130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6705,
        "hadithSanad": "ہم سے محمد بن ابوبکر مقدمی نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، کہا ہم سے حکیم بن ابی حرہ اسلمی نے بیان کیا ، انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے سنا ،",
        "hadithText": "ان سے ایسے شحص کے متعلق پوچھا گیا جس نے نذر مانی ہو کہ کچھ مخصوص دنوں میں روزے رکھے گا ۔ پھر اتفاق سے انہیں دنوںمیں بقرعید یا عید کے دن پڑ گئے ہوں ؟ حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہا کہ تمارے لیے رسول اللہ صلی اللہ علیہ وسلم کی زندگی بہترین نمونہ ہے ۔ آنحضرت بقرعید اور عید کے دن روزے نہیں رکھتے تھے اور نہ ان دنوں میں روزے کو جائز سمجھتے تھے ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 158210,
        "last_updated": null
    },
    {
        "urduURN": 4066140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6706,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے یزید بن ذریع نے بیان کیا ، ان سے یونس نے ، ان سے زیادہ بن جبیر نے بیان کیا کہ",
        "hadithText": "میں حضرت ابن عمر رضی اللہ عنہما کے ساتھ تھا ایک شخص نے ان سے پوچھا کہ میں نے نذر مانی ہے کہ ہر منگل یا بدھ کے دن روزہ رکھوں گا ۔ اتفاق سے اسی دن کی بقرعید پڑگئی ہے ؟ حضرت ابن عمر رضی اللہ عنہما نے کہا کہ اللہ تعالیٰ نذر پوری کرنے کا حکم دیا ہے اور ہمیں بقرعید کے دن روزہ رکھنے کی ممانعت کی گئی ہے ۔ اس شخص نے دوبارہ اپنا سوال دہرایا تو آپ نے پھر اس سے صرف اتنی ہی بات کہی اس پر کوئی زیادتی نہیں کی ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 158220,
        "last_updated": null
    },
    {
        "urduURN": 4066150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 83,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6707,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ثور بن زید دیلی نے بیان کیا ، ان سے ابن مطیع کے غلام ابوالغیث نے بیان کیا ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ خیبر کی لڑائی کے لیے نکلے ۔ اس لڑائی میں ہمیں سونا ، چاندی غنیمت میں نہیں ملا تھا بلکہ دوسرے اموال ، کپڑے اور سامان ملا تھا ۔ پھر بنی خبیب کے ایک شخص رفاعہ بن زید نامی نے آنحضرت صلی اللہ علیہ وسلم کو ایک غلام ہدیہ میں دیا غلام کا نام مدعم تھا ۔ پھر آنحضرت وادی قریٰ کی طرف متوجہ ہوئے اور جب آپ وادی القریٰ میں پہنچ گئے تو مدعم کو جب کہ وہ آنحضرت صلی اللہ علیہ وسلم کا کجاہ درست کر رہا تھا ۔ ایک انجان تیر آ کر لگا اور اس کی موت ہو گئی ۔ لوگوں نے کہا کہ جنت اسے مبارک ہو ، لیکن آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہرگز نہیں ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے وہ کمبل جو اس نے تقسیم سے پہلے خیبر کے مال غنیمت میں سے چرالیا تھا ، وہ اس پر آگ کا انگارہ بن کر بھڑ رہا ہے ۔ جب لوگوں نے یہ بات سنی تو ایک شخص چپل کا تسمہ یا دو تسمے لے کر آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ آگ کا تسمہ ہے یا دو تسمے آگ کے ہیں ۔</b>",
        "bookID": "83.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 158230,
        "last_updated": null
    }
]