[
    {
        "urduURN": 4066160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6708,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے ابوشہاب عبداللہ بن نافع نے بیان کیا ، ان سے ابن عون نے ، ان سے مجاہد نے ، ان سے عبدالرحمٰن بن ابی لیلیٰ نے ، ان سے کعب بن عجزہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قریب ہو جا ، میں قریب ہوا تو آپ نے پوچھا کیا تمہارے سر کے کپڑے تکلیف دے رہے ہیں ؟ میں نے عرض کیا ، جی ہاں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، پھر روزے صدقہ یا قربانی کا فدیہ دیدے ۔ اور مجھے ابن عون نے خبر دی ، ان سے ایوب نے بیان کیا کہ روزے تین دن کے ہوں گے اور قربانی ایک بکری کی اور ( کھانے کے لئے ) چھ مسکین ہوں گے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 158240,
        "last_updated": null
    },
    {
        "urduURN": 4066170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6709,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے حضرت سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے بیان کیا ، کہا کہ میں نے ان کی زبان سے سنا وہ حمید بن عبدالرحمٰن سے بیان کرتے تھے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک شخص نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا ، میں تو تباہ ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا بات ہے ؟ عرض کیا کہ میں نے رمضان میں اپنی بیوی سے ہمبستری کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، کیا تم ایک غلام آزاد کر سکتے ہو ؟ انہوں نے کہا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا دو مہینے متواتر روزے رکھ سکتا ہے ۔ انہوں نے عرض کیا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا ساٹھ مسکینوں کو کھانا کھلا سکتا ہے ؟ انہوں نے کہا کہ نہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بیٹھ جاؤ وہ صاحب بیٹھ گئے ۔ پھر آنحضرت صلی اللہ علیہ وسلم کے پاس ایک ٹوکرا لایا گیا جس میں کھجوریں تھیں ( عرق ایک بڑا پیمانہ ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ لے جا اور اسے پورا صدقہ کر دے ۔ انہوں نے پوچھا ، کیا اپنے سے زیادہ محتاج پر ( صدقہ کر دوں ) ؟ اس پر آنحضرت صلی اللہ علیہ وسلم ہنس دئیے اور آپ کے سامنے کے دانت دکھائی دینے لگے اور پھر آپ نے فرمایا کہ اپنے بچوں ہی کو کھلا دینا ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 158250,
        "last_updated": null
    },
    {
        "urduURN": 4066180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6710,
        "hadithSanad": "ہم سے محمد بن محبوب بصریٰ نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا ہم سے معمر بن راشد نے ، ان سے زہری نے ، ان سے حمید بن عبدالرحمٰن بن عوف نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صاحب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کی ، میں تو تباہ ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا بات ہے ؟ انہوں نے کہا کہ رمضان میں اپنی بیوی سے صحبت کر لی ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا کوئی غلام ہے ؟ انہوں نے کہا کہ نہیں ۔ دریافت فرمایا متواتر دو مہینے روزے رکھ سکتے ہو ، انہوں نے کہا کہ نہیں ۔ دریافت فرمایا ساٹھ مسکینوں کو کھانا کھلا سکتے ہو ؟ انہوں نے کہا کہ نہیں ۔ راوی نے بیان کیا کہ پھر ایک انصاری صحابی ” عرق “ لے کر حاضر ہوئے ، عرق ایک پیمانہ ہے ، اس میں کھجوریں تھیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے جا اور صدقہ کر دے ۔ انہوں نے پوچھا یا رسول اللہ ! کیا میں اپنے سے زیادہ ضرورت مند پر صدقہ کروں ؟ اس ذات کی قسم جس نے آپ کو حق کے ساتھ بھیجا ہے ۔ ان دونوں میدانوں کے درمیان کوئی گھرانہ ہم سے زیادہ محتاج نہیں ہے پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جا اور اپنے گھر والوں ہی کو کھلا دے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 158260,
        "last_updated": null
    },
    {
        "urduURN": 4066190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6711,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے حضرت سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا کہ میں تو تباہ ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا بات ہے ؟ کہا کہ میں نے رمضان میں اپنی بیوی سے صحبت کر لی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے پاس کوئی غلام ہے جسے آزاد کر سکو ؟ انہوں نے کہا نہیں ۔ دریافت فرمایا ، کیا متواتر دو مہینے تم روزے رکھ سکتے ہو ؟ کہا کہ نہیں ، دریافت فرمایا کیا ساٹھ مسکینوں کو کھانا کھلا سکتے ہو ؟ عرض کیا کہ اس کے لیے بھی میرے پاس کچھ نہیں ہے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم کے پاس ایک ٹوکرا لایا گیا جس میں کھجوریں تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اسے لے جا اور صدقہ کر ۔ انہوں نے پوچھا کہ اپنے سے زیادہ محتاج پر ؟ ان دونوں میدان کے درمیان ہم سے زیادہ محتاج کوئی نہیں ہے ۔ آخر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اچھا اسے لے جا اور اپنے گھر والوں کو کھلا دے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 158270,
        "last_updated": null
    },
    {
        "urduURN": 4066200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6712,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے قاسم بن مالک مزنی نے بیان کیا ، کہا ہم سے جعید بن عبدالرحمٰن نے بیان کیا ، ان سے حضرت سائب بن یزید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ایک صاع تمہارے زمانہ کے مد سے ایک مد اور تہائی کے برابر ہوتا تھا ۔ بعد میں حضرت عمر بن عبدالعزیز کے زمانہ میں اس میں زیادتی کی گئی ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 158280,
        "last_updated": null
    },
    {
        "urduURN": 4066210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6713,
        "hadithSanad": "ہم سے منذر بن الولید الجارودی نے بیان کیا ، کہا ہم سے ابوقتیبہ سلم شعیری نے بیان کیا ، کہا ہم سے امام مالک نے ، ان سے نافع نے بیان کیا کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما رمضان کا فطرانہ نبی کریم صلی اللہ علیہ وسلم ہی کے پہلے مد کے وزن سے دیتے تھے اور قسم کا کفارہ بھی آنحضرت صلی اللہ علیہ وسلم کے مد سے ہی دیتے تھے ۔ ابوقتیبہ نے اسی سند سے بیان کیا کہ ہم سے امام مالک نے بیان کیا کہ ہمارا مد تمہارے مد سے بڑا ہے اور ہمارے نزدیک ترجیح صرف آنحضرت صلی اللہ علیہ وسلم ہی کے مد کو ہے ۔ اور مجھ سے امام مالک نے بیان کیا کہ اگر ایسا کوئی حاکم آیا جو آنحضرت صلی اللہ علیہ وسلم کے مد سے چھوٹا مد مقرر کر دے تو تم کس حساب سے ( صدقہ فطر وغیرہ ) نکالو گے ؟ میں نے عرض کیا کہ ایسی صورت میں ہم آنحضرت صلی اللہ علیہ وسلم ہی کے مد کے حساب سے فطرہ نکالا کریں گے ؟ انہوں نے کہا کہ کیا تم دیکھتے نہیں کہ معاملہ ہمیشہ آنحضرت صلی اللہ علیہ وسلم ہی کے مد کی طرف لوٹتا ہے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 158290,
        "last_updated": null
    },
    {
        "urduURN": 4066220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6714,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، انہوں نے کہا ہمیں امام مالک نے خبر دی ، انہیں اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! ان کے کیل ( پیمانے ) میں ان کے صاع اور ان کے مد میں برکت عطا فرما ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 158300,
        "last_updated": null
    },
    {
        "urduURN": 4066230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6715,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، کہا ہم سے داؤد بن رشید نے بیان کیا ، کہا ہم سے ولید بن مسلم نے بیان کیا ، ان سے ابوغسان محمد بن مطرف نے ، ان سے زید بن اسلم نے ، ان سے حضرت زین العابدین علی بن حسین نے ، ان سے سعید ابن مرجانہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے کسی مسلمان غلام کو آزاد کیا تو اللہ تعالیٰ اس کے ایک ایک ٹکڑے کے بدلے آزاد کرنے والے کا ایک ایک ٹکڑا جہنم سے آزاد کرے گا ۔ یہاں تک کہ غلام کی شرمگاہ کے بدلے آزاد کرنے والے کی شرمگاہ بھی دوزخ سے آزاد ہو جائے گی ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 158310,
        "last_updated": null
    },
    {
        "urduURN": 4066240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6716,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم کو حماد بنزید نے خبر دی ، انہیں عمرو بن دینار نے اور ان سے حضرت جابر رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ انصار کے ایک صاحب نے اپنے غلام کو مدبر بنا لیا اور ان کے پاس اس غلام کے سوا اور کوئی مال نہیں تھا ۔ جب اس کی اطلاع نبی کریم صلی اللہ علیہ وسلم کو ملی تو آپ نے دریافت فرمایا کہ مجھ سے اس غلام کو کون خریدتا ہے ۔ نعیم بن نحام رضی اللہ عنہ نے آٹھ سو درہم میں آنحضرت صلی اللہ علیہ وسلم سے اسے خرید لیا ۔ میں نے حضرت جابر رضی اللہ عنہ کو یہ کہتے سنا کہ وہ ایک قبطی غلام تھا اور پہلے سال مرگیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے نیلام فرما کر اس رقم سے اسے مکمل آزاد کرا دیا ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 158320,
        "last_updated": null
    },
    {
        "urduURN": 4066250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6717,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کے ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم بن عتبہ نے ، ان سے ابراہیم نخعی نے ، ان سے اسود بن یزید نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "انہوں نے بریرہ رضی اللہ عنہا کو ( آزاد کرنے کے لئے ) خریدنا چاہا ، تو ان کے پہلے مالکوں نے اپنے لئے ولاء کی شرط لگائی ۔ میں نے اس کا ذکر نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ نے فرمایا خریدلو ، ولاء تو اسی سے ہوتی ہے جو آزاد کرتا ہے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 158330,
        "last_updated": null
    },
    {
        "urduURN": 4066260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6718,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے غیلان بن جریر نے ، ان سے ابوبردہ بن ابی موسیٰ نے اور ان سے حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں قبیلہ اشعر کے چند لوگوں کے ساتھ حاضر ہوا اور آپ سے سواری کے لئے جانور مانگے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں تمہیں سواری کے جانور نہیں دے سکتا ۔ پھر جب تک اللہ تعالیٰ نے چاہا ہم ٹھہرے رہے اور جب کچھ اونٹ آئے تو تین اونٹ ہمیں دئیے جانے کاحکم فرمایا ۔ جب ہم انہیں لے کر چلے تو ہم میں سے بعض نے اپنے ساتھیوں سے کہا کہ ہمیں اللہ اس میں برکت نہیں دے گا ۔ ہم آنحضرت صلی اللہ علیہ وسلم کے پاس سواری کے جانور مانگنے آئے تھے تو آپ نے قسم کھا لی تھی کہ ہمیں سواری کے جانور نہیں دے سکتے اور آپ نے عنایت فرمائے ہیں ۔ حضرت ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ پھر ہم آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور آپ سے اس کا ذکر کیا تو آپ نے فرمایا کہ میں نے تمہارے لئے جانور کا انتظام نہیں کیا ہے بلکہ اللہ تعالیٰ نے کیا ہے ، اللہ کی قسم اگر اللہ نے چاہا تو جب بھی میں کوئی قسم کھالوں گا اور پھر اس کے سوا اور چیز میں اچھائی ہو گی تو میں اپنی قسم کا کفارہ دے دوں گا اور وہی کام کروں گا جس میں اچھائی ہو گی ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 158340,
        "last_updated": null
    },
    {
        "urduURN": 4066270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6719,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، انہوں نے ( اس روایت میں یہ ترتیب اسی طرح ) بیان کی کہ",
        "hadithText": "میں قسم کا کفارہ ادا کر دوں گا اور وہ کام کروں گا جس میں اچھائی ہو گی یا ( اس طرح آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ) میں کام وہ کروں گا جس میں اچھائی ہو گی اور کفارہ ادا کر دوں گا ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 158350,
        "last_updated": null
    },
    {
        "urduURN": 4066280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6720,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے ہشام بن حجیر نے ، ان سے طاؤس نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "سلیمان علیہ السلام نے کہا تھا کہ آج رات میں اپنی نوے بیویوں کے پاس جاؤں گا اور ہر بیوی ایک بچہ جنے گی جو اللہ کے راستے میں جہاد کریں گے ۔ ان کے ساتھی سفیان یعنی فرشتے نے ان سے کہا ۔ اجی انشاءاللہ تو کہو لیکن آپ بھول گئے اور پھر تمام بیویوں کے پاس گئے لیکن ایک بیوی کے سوا جس کے یہاں ناتمام بچہ ہوا تھا کسی بیوی کے یہاں بھی بچہ نہیں ہوا ۔ حضرت ابوہریرہ رضی اللہ عنہ روایت کرتے ہوئے کہتے تھے کہ اگر انہوں نے انشاءاللہ کہہ دیا ہوتا تو ان کی قسم بے کار نہ جاتی اور اپنی ضرورت کو پالیتے اور ایک مرتبہ انہوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کہا کہ اگر انہوں نے استثناء کر دیا ہوتا ۔ اور ہم سے ابوالزناد نے اعرج سے حضرت ابوہریرہ رضی اللہ عنہ کی حدیث کی طرح بیان کیا ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 158360,
        "last_updated": null
    },
    {
        "urduURN": 4066290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6721,
        "hadithSanad": "ہم سے علی بن حجر نے بیان کیا ، کہا ہم سے اسماعیل بن ابراہیم نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے قاسم تمیمی نے ، ان سے زہدم جرمی نے بیان کیا کہ",
        "hadithText": "ہم حضرت ابوموسیٰ اشعری رضی اللہ عنہ کے پاس تھے اور ہمارے قبیلہ اور اس قبیلہ جرم میں بھائی چارگی اور باہمی حسن معاملہ کی روش تھی ۔ راوی نے بیان کیا کہ پھر کھانا لایا گیا اور کھانے میں مرغی کا گوشت بھی تھا ۔ راوی نے بیان کیا کہ حاضرین میں بنی تیم اللہ کا ایک شخص سرخ رنگ کا بھی تھا جیسے مولیٰ ہو ۔ بیان کیا کہ وہ شخص کھانے پر نہیں آیا تو حضرت موسیٰ رضی اللہ عنہ نے اس سے کہا کہ شریک ہو جاؤ ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کا گوشت کھاتے دیکھا ہے ۔ اس شخص نے کہا کہ میں نے اسے گندگی کھاتے دیکھا تھا جب سے اس سے گھن آنے لگی اور اسی وقت میں نے قسم کھا لی کہ کبھی اس کا گوشت نہیں کھاؤں گا ۔ حضرت ابوموسیٰ نے کہا قریب آؤ میں تمہیں اس کے متعلق بتاؤں گا ۔ ہم رسول اللہ صلی اللہ علیہ وسلم کے یہاں اشعریوں کی ایک جماعت کے ساتھ آئے اور میں نے آنحضرت صلی اللہ علیہ وسلم سے سواری کا جانور مانگا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت صدقہ کے اونٹوں میں سے تقسیم کر رہے تھے ۔ ایوب نے بیان کیا کہ میرا خیال ہے کہ ابوموسیٰ رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم اس وقت غصہ تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم ! میں تمہیں سواری کے جانور نہیں دے سکتا اور نہ میرے پاس کوئی ایسی چیز ہے جو سواری کے لئے تمہیں دے سکوں ۔ بیان کیا کہ پھر ہم واپس آ گئے ۔ پھر آنحضرت صلی اللہ علیہ وسلم کے پاس غنیمت کے اونٹ آئے ، تو پوچھا گیا کہ اشعریوں کی جماعت کہاں ہے ۔ ہم حاضر ہوئے تو آنحضرت صلی اللہ علیہ وسلم نے ہمیں پانچ عمدہ اونٹ دئیے جانے کا حکم دیا ۔ بیان کیا کہ ہم وہاں سے روانہ ہوئے تو میں نے اپنے ساتھیوں سے کہا کہ ہم پہلے آنحضرت صلی اللہ علیہ وسلم کے پاس سواری کے لئے آئے تھے تو آپ نے قسم کھا لی تھی کہ سواری کا انتظام نہیں کر سکتے ۔ پھر ہمیں بلا بھیجا اور سواری کا جانور عنایت فرمائے ۔ آنحضرت صلی اللہ علیہ وسلم اپنی قسم بھول گئے ہوں گے ۔ واللہ ! اگر ہم نے آنحضرت صلی اللہ علیہ وسلم کو آپ کی قسم کے بارے میں غفلت میں رکھا تو ہم کبھی کامیاب نہیں ہوں گے ۔ چلو ہم سب آپ کے پاس واپس چلیں اور آپ کو آپ کی قسم یاد دلائیں ۔ چنانچہ ہم واپس آئے اور عرض کیا کہ یا رسول اللہ ! ہم پہلے آئے تھے اور آپ سے سواری کا جانور مانگا تھا تو آپ نے قسم کھا لی تھی کہ آپ اس کا انتظام نہیں کر سکتے ، ہم نے سمجھا کہ آپ اپنی قسم بھول گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جاؤ ، تمہیں اللہ نے سواری دی ہے ، واللہ اگر اللہ نے چاہا تو میں جب بھی کوئی قسم کھالوں اور پھر دوسری چیز کو اس کے مقابل بہتر سمجھوں تو وہی کروں گا جو بہتر ہو گا اور اپنی قسم توڑ دوں گا ۔ اس روایت کی متابعت حماد بن زیدنے ایوب سے کی ، ان سے ابولابہ اور قاسم بن عاصم کلیبی نے ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 158370,
        "last_updated": null
    },
    {
        "urduURN": 4066300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 84,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6722,
        "hadithSanad": "مجھ سے محمد بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے عثمان بن عمر بن فارس نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ ابن عون نے خبر دی ، انہیں امام حسن بصری نے ، ان سے حضرت عبدالرحمٰن بن سمرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کبھی تم حکومت کا عہدہ طلب نہ کرنا کیونکہ اگر بلا مانگے تمہیں یہ مل جائے گا تو اس میں تمہاری منجانب اللہ مدد کی جائے گی ، لیکن اگرمانگنے پر ملاتو سارا بوجھ تمہیں پر ڈال دیا جائے گا اور اگر تم کوئی قسم کھا لو اور اس کے سوا کوئی اور بات بہتر نظر آئے تو وہی کرو جو بہتر ہو اور قسم کا کفارہ ادا کر دو ۔ عثمان بن عمر کے ساتھ اس حدیث کو اشہل بن حاتم نے بھی عبداللہ بن عون سے روایت کیا ، اس کو ابوعوانہ اور حاکم نے وصل کیا اور عبداللہ بن عون کے ساتھ اس حدیث کو یونس اور سماک بن عطیہ اور سماک بن حرب اور حمید اور قتادہ اور منصور اور ہشام اور ربیع نے بھی روایت کیا ۔</b>",
        "bookID": "84.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 158390,
        "last_updated": null
    }
]