[
    {
        "urduURN": 4066310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6723,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے محمد بن منکدر نے ، انہوں نے جابر بن عبداللہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں بیمار پڑا تو حضرت رسول کریم صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ میری عیادت کے لئے تشریف لائے ، دونوں حضرات پیدل چل کر آئے تھے ۔ دونوں حضرات جب آئے تو مجھ پر غشی طاری تھی ، آنحضرت صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی میرے اوپر چھڑکا مجھے ہوش ہوا تو میں نے عرض کیا یا رسول اللہ ! اپنے مال کی ( تقسیم ) کس طرح کروں ؟ یا اپنے مال کا کس طرح فیصلہ کروں ؟ آنحضرت صلی اللہ علیہ وسلم نے مجھے کوئی جواب نہیں دیا ، یہاں تک کہ میراث کی آیتیں نازل ہوئیں ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 158400,
        "last_updated": null
    },
    {
        "urduURN": 4066320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6724,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا بدگمانی سے بچتے رہو ، کیونکہ گمان ( بدظنی ) سب سے جھوٹی بات ہے ۔ آپس میں ایک دوسرے کی برائی کی تلاش میں نہ لگے رہو نہ ایک دوسرے سے بغض رکھو اور نہ پیٹھ پیچھے کسی کی برائی کرو ، بلکہ اللہ کے بندے بھائی بھائی بن کر رہو ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 158410,
        "last_updated": null
    },
    {
        "urduURN": 4066330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6725,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن عروہ نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں عروہ بن زبیر نے اور ان سے ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "حضرت فاطمہ اور عباس علیہما السلام حضرت ابوبکر رضی اللہ عنہ کے پاس آنحضرت صلی اللہ علیہ وسلم کی طرف سے اپنی میراث کا مطالبہ کرنے آئے ، یہ فدک کی زمین کا مطالبہ کر رہے تھے اور خیبرمیں بھی اپنے حصہ کا ۔ \n<span class=urdu_sanad>حضرت ابوبکر رضی اللہ عنہ نے ان سے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ہے آپ نے فرمایا تھا کہ</span> ہمارا کوئی وارث نہیں ہوتا جو کچھ ہم چھوڑیں وہ سب صدقہ ہے ، بلاشبہ آل محمد اسی مال میں سے اپنا خرچ پورا کرے گی ۔ حضرت ابوبکر رضی اللہ عنہ نے کہا ، واللہ ، میں کوئی ایسی بات نہیں ہونے دوں گا ، بلکہ جسے میں نے آنحضرت صلی اللہ علیہ وسلم کو کرتے دیکھا ہو گا وہ میں بھی کروں گا ۔ بیان کیا کہ اس پر حضرت فاطمہ رضی اللہ عنہا نے ان سے تعلق کاٹ لیا اور موت تک ان سے کلام نہیں کیا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 158421,
        "last_updated": null
    },
    {
        "urduURN": 4066350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6727,
        "hadithSanad": "ہم سے اسماعیل بن ابان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے ، انہیں زہری نے ، انہیں عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ہماری وراثت نہیں ہوتی ہم جو کچھ بھی چھوڑیں وہ صدقہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 158440,
        "last_updated": null
    },
    {
        "urduURN": 4066360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6728,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے بیان کیا کہ مجھے مالک بن اوس بن حدثان نے خبر دی کہ",
        "hadithText": "محمد بن جبیر بن مطعم نے مجھ سے مالک بن اوس کی اس حدیث کا ایک حصہ ذکر کیا تھا ۔ پھر میں خود مالک بن اوس کے پاس گیا اور ان سے یہ حدیث پوچھی تو انہوں نے بیان کیا کہ میں عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا پھر ان کے حاجب یرفاء نے جا کر ان سے کہا کہ عثمان ، عبدالرحمٰن بن زبیر اور سعد آپ کے پاس آنا چاہتے ہیں ؟ انہوں نے کہا کہ اچھا آنے دو ۔ چنانچہ انہیں اندر آنے کی اجازت دے دی ۔ پھر کہا ، کیا آپ علی و عباس رضی اللہ عنہما کو بھی آنے کی اجازت دیں گے ؟ کہا کہ ہاں آنے دو ۔ چنانچہ عباس رضی اللہ عنہ نے کہا کہ امیرالمؤمنین میرے اور علی رضی اللہ عنہ کے درمیان فیصلہ کردیجے ۔ عمر رضی اللہ عنہ نے کہا میں تمہیں اللہ کی قسم دیتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں کیا تمہیں معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی جو کچھ ہم چھوڑیں وہ سب راہ اللہ صدقہ ہے ؟ اس سے مراد آنحضرت صلی اللہ علیہ وسلم نے کی خود اپنی ہی ذات تھی ۔ جملہ حاضرین بولے کہ ہاں ، آنحضرت صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا ۔ پھر حضرت عمر ، حضرت علی اور حضرت عباس رضی اللہ عنہما کی طرف متوجہ ہوئے اور پوچھا ، کیا تمہیں معلوم ہے کہ آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا تھا ؟ انہوں نے بھی تصدیق کی کہ آنحضرت صلی اللہ علیہ وسلم نے یہ ارشاد فرمایا تھا ۔ عمر رضی اللہ عنہ نے فرمایا پھر میں اب آپ لوگوں سے اس معاملہ میں گفتگو کروں گا ۔ اللہ تعالیٰ نے اس فے کے معاملہ میں آنحضرت صلی اللہ علیہ وسلم کے لئے کچھ حصے مخصوص کردےئے جو آپ کے سوا کسی اور کو نہیں ملتا تھا ۔ چنانچہ اللہ تعالیٰ نے فرمایا تھا کہ ” ما افاء اﷲ علی رسولہ “ ارشاد قدیر ، تک ۔ یہ تو خاص آنحضرت صلی اللہ علیہ وسلم کا حصہ تھا ۔ اللہ کی قسم آنحضرت صلی اللہ علیہ وسلم نے اسے تمہارے لئے ہی مخصوص کیا تھا اور تمہارے سوا کسی کو اس پر ترجیح نہیں دی تھی ، تمہیں کو اس میں سے دیتے تھے اور تقسیم کرتے تھے ۔ آخر اس میں سے یہ مال باقی رہ گیا اور آنحضرت صلی اللہ علیہ وسلم اس میں سے اپنے گھر والوں کے لئے سال بھر کا خرچہ لیتے تھے ، اس کے بعد جو کچھ باقی بچتا اسے ان مصارف میں خرچ کرتے جو اللہ کے مقرر کردہ ہیں ۔ آنحضرت صلی اللہ علیہ وسلم کا یہ طرز عمل آپ کی زندگی بھر رہا ۔ میں آپ کو اللہ کی قسم دے کر کہتا ہوں ، کیا آپ لوگوں کو معلوم ہے ؟ لوگوں نے کہا کہ ہاں ۔ پھر آپ نے علی اور عباس رضی اللہ عنہما سے پوچھا ، میں اللہ کی قسم دے کر پوچھتا ہوں کیا آپ لوگوں کو یہ معلوم ہے ؟ انہوں نے بھی کہا کہ ہاں ۔ پھر آنحضرت صلی اللہ علیہ وسلم کی وفات ہو گئی اور ابوبکر رضی اللہ عنہ نے کہا کہ اب میں آنحضرت صلی اللہ علیہ وسلم کا نائب ہوں چنانچہ انہوں نے اس پر قبضہ میں رکھ کر اس طرز عمل کو جاری رکھا جو آنحضرت صلی اللہ علیہ وسلم کا اس میں تھا ۔ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو بھی وفات دی تو میں نے کہا کہ میں آنحضرت صلی اللہ علیہ وسلم کے نائب کا نائب ہوں ۔ میں بھی دو سال سے اس پر قابض ہوں اور اس مال میں وہی کرتا ہوں جو رسول کریم صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے کیا ۔ پھر آپ دونوں میرے پاس آئے ہو ۔ آپ دونوں کی بات ایک ہے اور معاملہ بھی ایک ہی ہے ۔ آپ ( عباس رضی اللہ عنہ ) میرے پاس اپنے بھتیجے کی میراث سے اپنا حصہ لینے آئے ہو اور آپ ( علی رضی اللہ عنہ ) اپنی بیوی کا حصہ لینے آئے ہو جو ان کے والد کی طرف سے انہیں ملتا ۔ میں کہتا ہوں کہ اگر آپ دونوں چاہتے ہیں تو میں اسے آپ کو دے سکتا ہوں لیکن آپ لوگ اس کے سوا کوئی اور فیصلہ چاہتے ہیں تو اس ذات کی قسم جس کے حکم سے آسمان و زمین قائم ہیں ، میں اس مال میں اس کے سوا اور کوئی فیصلہ نہیں کر سکتا ، قیامت تک ، اگر آپ اس کے مطابق عمل نہیں کر سکتے تو وہ جائیداد مجھے واپس کر دیجئیے میں اس کا بھی بندوبست کر لوں گا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 158450,
        "last_updated": null
    },
    {
        "urduURN": 4066370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6729,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا کہ مجھ سے امام مالک نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میرا ورثہ دینار کی شکل میں تقسیم نہیں ہو گا ۔ میں نے اپنی بیویوں کے خرچہ اور اپنے عاملوں کی اجرت کے بعد جو کچھ چھوڑا ہے وہ سب صدقہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 158460,
        "last_updated": null
    },
    {
        "urduURN": 4066380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6730,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعبنی نے بیان کیا ، ان سے امام مالک نے ، ان سے ابن شہاب نے ، ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "جب رسول کریم صلی اللہ علیہ وسلم کی وفات ہوئی تو آپ کی بیویوں نے چاہا کہ حضرت عثمان رضی اللہ عنہ کو حضرت ابوبکرص کے پاس بھیجیں ، اپنی میراث طلب کرنے کے لئے ۔ پھر حضرت عائشہ رضی اللہ عنہا نے یاد دلایا ۔ کیا آنحضرت صلی اللہ علیہ وسلم نے نہیں فرمایا تھا کہ ہماری وراثت تقسیم نہیں ہوتی ، ہم جو کچھ چھوڑ جائیں وہ سب صدقہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 158470,
        "last_updated": null
    },
    {
        "urduURN": 4066390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6731,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس بن یزید ایلی نے خبر دی ، انہیں ابن شہاب نے ، کہا مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میں مومنوں کا خود ان سے زیادہ حقدار ہوں ۔ پس ان میں سے جو کوئی قرض دار مرے گا اور ادائےگی کے لئے کچھ نہ چھوڑے گا تو ہم پراس کی ادائےگی کی ذمہ داری ہے اور جس نے کوئی مال چھوڑا ہو گا وہ اس کے وارثوں کا حصہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 158480,
        "last_updated": null
    },
    {
        "urduURN": 4066400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6732,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میراث اس کے حق داروں تک پہنچا دو اور جو کچھ باقی بچے وہ سب سے زیادہ قریبی مرد عزیز کا حصہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 158490,
        "last_updated": null
    },
    {
        "urduURN": 4066410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6733,
        "hadithSanad": "ہم سے امام حمیدی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا ہم سے زہری نے بیان کیا ، کہا مجھے عامر بن سعد بن ابی وقاص نے خبر دی اور ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "میں مکہ مکرمہ میں ( حجۃ الوداع میں ) بیمار پڑ گیا اور موت کے قریب پہنچ گیا ۔ پھر آنحضرت صلی اللہ علیہ وسلم میری عیادت کے لئے تشریف لائے تو میں نے عرض کیا یا رسول اللہ ! میرے پاس بہت زیادہ مال ہے اور ایک لڑکی کے سوا اس کا کوئی وارث نہیں تو کیا مجھے اپنے مال کے دو تہائی حصہ کا صدقہ کر دینا چاہئے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ بیان کیا کہ میں نے عرض کیا پھر آدھے کا کر دوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ۔ میں نے عرض کیا ایک تہائی کا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ گو تہائی بھی بہت ہے ، اگر تم اپنے بچوں کو مالدار چھوڑو تو یہ اس سے بہتر ہے کہ انہیں تنگدست چھوڑو اور وہ لوگوں کے سامنے ہاتھ پھیلا پھریں اور تم جو بھی خرچ کرو گے اس پر تمہیں ثواب ملے گا یہاں تک کہ اس لقمہ پر بھی ثواب ملے گا جو تم اپنی بیوی کے منہ میں رکھو گے ۔ پھر میں نے عرض کیا یا رسول اللہ ! کیا میں اپنی ہجرت میں پیچھے رہ جاؤں گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر میرے بعد تم پیچھے رہ بھی گئے تب بھی جو عمل تم کرو گے اور اس سے اللہ کی خوشنودی مقصود ہو گی تو اس کے ذریعہ درجہ و مرتبہ بلند ہو گا اور غالباً تم میرے بعد زندہ رہو گے اور تم سے بہت سے لوگوں کو فائدہ ہو گا اور بہتوں کو نقصان پہنچے گا ۔ قابل افسوس تو سعد ابن خولہ ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کے بارے میں اس لئے افسوس کا اظہار کیا کہ ( ہجرت کے بعد اتفاق سے ) ان کی وفات مکہ مکرمہ میں ہی ہو گئی ۔ سفیان نے بیان کیا کہ سعد ابن خولہ رضی اللہ عنہ بنی عامر بن لوی کے ایک آدمی تھے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 158500,
        "last_updated": null
    },
    {
        "urduURN": 4066420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6734,
        "hadithSanad": "مجھ سے محمود بن غیلان نے بیان کیا ، کہا ہم سے ابوالنضر نے بیان کیا ، کہا ہم سے ابومعاویہ شیبان نے بیان کیا ، ان سے اشعث بن ابی الشعثاء نے ، ان سے اسود بن یزید نے بیان کیا کہ",
        "hadithText": "حضرت معاذ بن جبل رضی اللہ عنہ ہمارے یہاں یمن میں معلم و امیر بن کر تشریف لائے ۔ ہم نے ان سے ایک ایسے شخص کے ترکہ کے بارے میں پوچھا جس کی وفات ہوئی ہو اور اس نے ایک بیٹی اور ایک بہن چھوڑی ہو اور اس نے اپنی بیٹی کو آدھا اور بہن کو بھی آدھا دیا ہو ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 158510,
        "last_updated": null
    },
    {
        "urduURN": 4066430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6735,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے عبداللہ ابن طاؤس نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت ابن عباس نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا پہلے میراث ان کے وارثوں تک پہنچا دو اور جو باقی رہ جائے وہ اس کو ملے گا جو مرد میت کا بہت نزدیکی رشتہ دار ہو ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 158520,
        "last_updated": null
    },
    {
        "urduURN": 4066440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6736,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے ، کہا ہم سے ابوقیس عبدالرحمٰن بن ثروان نے ، انہوں نے ہزیل بن شرحبیل سے سنا ، بیان کیا کہ",
        "hadithText": "ابوموسیٰ رضی اللہ عنہ سے بیٹی ، پوتی اور بہن کی میراث کے بارے میں پوچھا گیا تو انہوں نے کہا کہ بیٹی کو آدھا ملے گا اور بہن کو آدھا ملے گا اور تو ابن مسعود رضی اللہ عنہما کے یہاں جا ، شاید وہ بھی یہی بتائیں گے ۔ پھر ابن مسعود رضی اللہ عنہما سے پوچھا گیا اور ابوموسیٰ رضی اللہ عنہ کی بات بھی پہنچائی گئی تو انہوں نے کہا کہ میں اگر ایسا فتویٰ دوں تو گمراہ ہو چکا اور ٹھیک راستے سے بھٹک گیا ۔ میں تو اس میں وہی فیصلہ کروں گا جو رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا کہ بیٹی کو آدھا ملے گا ، پوتھی کو چھٹا حصہ ملے گا ، اس طرح دو تہائی پوری ہو جائے گی اور پھر جو باقی بچے گا وہ بہن کو ملے گا ۔ پھر ابوموسیٰ رضی اللہ عنہ کے پاس آئے اور ابن مسعود رضی اللہ عنہما کی بات ان تک پہنچائی تو انہوں نے کہا کہ جب تک یہ عالم تم میں موجود ہیں مجھ سے مسائل نہ پوچھا کرو ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 158530,
        "last_updated": null
    },
    {
        "urduURN": 4066450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6737,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، ان سے ابن طاؤس نے ، ان سے ان کے والد نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میراث اس کے حقدار تک پہنچا دو اور جو باقی رہ جائے وہ سب سے قریب والے مرد کو دے دو ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 158540,
        "last_updated": null
    },
    {
        "urduURN": 4066460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6738,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا ہم سے ایوب نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے جو یہ فرمایا ہے کہ اگر میں اس امت کے کسی آدمی کو ” خلیل “ بناتا تو ان کو ( ابوبکر رضی اللہ عنہ کو ) کو خلیل بناتا ، لیکن اسلام کا تعلق ہی سب سے بہتر ہے تو اس میں آنحضرت صلی اللہ علیہ وسلم نے دادا کو باپ کے درجہ میں رکھا ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 158550,
        "last_updated": null
    },
    {
        "urduURN": 4066470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6739,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، ان سے ورقاء نے بیان کیا ، ان سے ابن ابی نجیح نے بیان کیا ، ان سے عطاء نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "پہلے مال کی اولاد مستحق تھی اور والدین کو وصیت کا حق تھا ۔ پھر اللہ تعالیٰ نے اس میں سے جو چاہا منسوخ کر دیا اور لڑکوں کو لڑکیوں کے دگناحق دیا اوروالدین کو اور ان میں سے ہر ایک کو چھٹے حصہ کا مستحق قرار دیا اور بیوی کو آٹھویں اور چوتھے حصہ کا حق دارقرار دیا اور شوہر کو آدھے یا چوتھائی کا حقدار قرار دیا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 158560,
        "last_updated": null
    },
    {
        "urduURN": 4066480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6740,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے ، ان سے ابن شہاب نے ، ان سے ابن المسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بنی لحیان کی ایک عورت ملیا بنت عویمر کے بچے کے بارے میں جو ایک عورت کی مار سے مردہ پیدا ہوا تھا کہ مارنے والی عورت کو خون بہا کے طور پر ایک غلام یا لونڈی ادا کرنے کا حکم فرمایا تھا ۔ پھر وہ عورت بچہ گرانے والی جس کے متعلق آنحضرت صلی اللہ علیہ وسلم نے فیصلہ دیا تھا مرگئی تو آنحضرت صلی اللہ علیہ وسلم نے فیصلہ کیا کہ اس کی میراث اس کے لڑکوں اور شوہر کو دے دی جائے اور یہ دیت ادا کرنے کا حکم اس کے کنبہ والوں کو دیا تھا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 158570,
        "last_updated": null
    },
    {
        "urduURN": 4066490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6741,
        "hadithSanad": "ہم سے بشر بن خالد نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ بن حجاج نے ، ان سے سلیمان اعمش نے ، ان سے ابراہیم نخعی نے اور ان سے اسود بن یزید نے بیان کیا کہ",
        "hadithText": "حضرت معاذ بن جبل رضی اللہ عنہ نے رسول کریم صلی اللہ علیہ وسلم کے زمانہ میں ہمارے درمیان یہ فیصلہ کیا تھا کہ آدھا بیٹی کو ملے گا اور آدھا بہن کو ۔ پھر سلیمان نے جو اس حدیث کو روایت کیا تو اتنا ہی کہا کہ معاذ نے ہم کنبہ والوں کو یہ حکم دیا تھا یہ نہیں کہا کہ آنحضرت صلی اللہ علیہ وسلم کے زمانہ میں ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 158580,
        "last_updated": null
    },
    {
        "urduURN": 4066500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6742,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے ابوقیس ( عبدالرحمٰن بن عزوان ) نے ، ان سے ہزیل بن شرحبیل نے بیان کیا اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے فیصلہ کے مطابق اس کا فیصلہ کروں گا ۔ لڑکی کو آدھا ، پوتی کو چھٹا اور جو باقی بچے بہن کا حصہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 158590,
        "last_updated": null
    },
    {
        "urduURN": 4066510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6743,
        "hadithSanad": "ہم سے عبداللہ بن عثمان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو شعبہ بن حجاج نے خبر دی ، ان سے محمد بن منکدر نے بیان کیا ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم میرے گھر تشریف لائے اور میں بیمار تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے پانی منگوایا اور وضوکیا ۔ پھر اپنے وضوکے پانی سے مجھ پر چھینٹا ڈالا تو مجھے ہوش آ گیا ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے عرض کیا یا رسول اللہ ! میری بہنیں ہیں ؟ اس پر میراث کی آیت نازل ہوئی ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 158600,
        "last_updated": null
    },
    {
        "urduURN": 4066520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6744,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے اسرائیل نے ، ان سے ابواسحاق نے ، ان سے براء رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "آخری آیت ( میراث کی ) سورۃ نساء کے آخر کی آیتیں نازل ہوئیں کہ ” آپ سے فتویٰ پوچھتے ہیں ، کہہ دیجئیے کہ اللہ تعالیٰ تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے “ ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 158610,
        "last_updated": null
    },
    {
        "urduURN": 4066530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6745,
        "hadithSanad": "ہم سے محمود نے بیان کیا ، انہوں نے کہا ہم کو اسرائیل نے خبر دی ، انہیں ابوحصین نے ، انہیں ابوصالح نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں مسلمانوں کا خود ان کی ذات سے بھی زیادہ ولی ہوں ۔ پس جو شخص مر جائے اور مال چھوڑ جائے تو وہ اس کے وارثوں کا حق ہے اور جس نے بیوی بچے چھوڑے ہوں یا قرض ہو ، تو میں ان کا ولی ہوں ، ان کے لیے مجھ سے مانگا جائے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 158620,
        "last_updated": null
    },
    {
        "urduURN": 4066540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6746,
        "hadithSanad": "ہم سے امیہ بن بسطام نے بیان کیا ، انہوں نے کہا ہم سے یزید بن زریع نے بیان کیا ، ان سے روح نے بیان کیا ، ان سے عبداللہ بن طاؤس نے ، ان سے ان کے والد نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میراث اس کے وارثوں تک پہنچا دو اور جو کچھ اس میں سے بچ رہے وہ قریبی عزیز مرد کا حق ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 158630,
        "last_updated": null
    },
    {
        "urduURN": 4066550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6747,
        "hadithSanad": "مجھ سے اسحاق بن ابراہیم نے بیان کیا ، انہوں نے کہا کہ میں نے ابواسامہ سے پوچھا کیا آپ سے ادریس نے بیان کیا تھا ، ان سے طلحہ نے بیان کیا ، ان سے سعید بن جبیر نے بیان کیا",
        "hadithText": "اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے ” ولکل جعلنا موالی “ اور ” والذین عقدت ایمانکم “ کے متعلق بتلایا کہ مہاجرین جب مدینہ آئے تو ذوی الارحام کے علاوہ انصار و مہاجرین بھی ایک دوسرے کی وراثت پاتے تھے ۔ اس بھائی چارگی کی وجہ سے جو نبی کریم صلی اللہ علیہ وسلم نے ان کے درمیان کرائی تھی ، پھر جب آیت ” جعلنا موالی “ نازل ہوئی تو فرمایا کہ اس نے ” والذین عقدت ایمانکم “ کو منسوخ کر دیا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 158640,
        "last_updated": null
    },
    {
        "urduURN": 4066560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6748,
        "hadithSanad": "مجھ سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے مالک نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ایک شخص نے اپنی بیوی سے نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں لعان کیا اور اس کے بچہ کو اپنا بچہ ماننے سے انکار کر دیا تو آنحضرت صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی اور بچہ عورت کو دے دیا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 158650,
        "last_updated": null
    },
    {
        "urduURN": 4066570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6749,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "عتبہ اپنے بھائی سعد رضی اللہ عنہ کو وصیت کرگیا تھا کہ زمعہ کی کنیز کا لڑکا میرا ہے اور اسے اپنی پروریش میں لے لینا ۔ فتح مکہ کے سال سعد رضی اللہ عنہ نے اسے لینا چاہا اور کہا کہ میرے بھائی کا لڑکا ہے اور اس نے مجھے اس کے بارے میں وصیت کی تھی ۔ اس پر عبد بن زمعہ رضی اللہ عنہ کھڑے ہوئے اور کہا کہ یہ میرا بھائی ہے اور میرے باپ کی لونڈی کا لڑکا ہے ، اس کے بستر پر پیدا ہوا ہے ۔ آخر یہ دونوں یہ معاملہ رسول کریم صلی اللہ علیہ وسلم کے پاس لے گئے تو سعد رضی اللہ عنہ نے کہا ، یا رسول اللہ ! ، یہ میرے بھائی کا لڑکا ہے اس نے اس کے بارے میں مجھے وصیت کی تھی ۔ عبد بن زمعہ نے کہا کہ یہ میرا بھائی ہے ، میرے باپ کی باندی کا لڑکا اور باپ کے بستر پر پیدا ہوا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا عبد بن زمعہ ! یہ تمہارے پاس رہے گا ، لڑکا بستر کا حق ہے اور زانی کے حصہ میں پتھر ہیں ۔ پھر سودہ بنت زمعہ رضی اللہ عنہا سے کہا کہ اس لڑکے سے پردہ کیا کر کیونکہ عتبہ کے ساتھ اس کی شباہت آپ صلی اللہ علیہ وسلم نے دیکھ لی تھی ۔ چنانچہ پھر اس لڑکے نے ام المؤمنین کو اپنی وفات تک نہیں دیکھا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 158660,
        "last_updated": null
    },
    {
        "urduURN": 4066580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6750,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے ، ان سے شعبہ نے بیان کیا ، ان سے محمد بن زیاد نے بیان کیا ، انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا لڑکا بستر والے کا حق ہوتا ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 158670,
        "last_updated": null
    },
    {
        "urduURN": 4066590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6751,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے حکم نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے بریرہ رضی اللہ عنہ کو خریدنا چاہا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں خرید لے ، ولاء تو اس کے ساتھ قائم ہوتی ہے جو آزاد کر دے اور بریرہ رضی اللہ عنہ کو ایک بکری ملی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ ان کے لیے صدقہ تھی لیکن ہمارے لیے ہدیہ ہے ۔ حکم نے بیان کیا کہ ان کے شوہر آزاد تھے ۔ حکم کا قول مرسل منقول ہے ۔ ابن عباس رضی اللہ عنہما نے کہا کہ میں نے انہیں غلام دیکھا تھا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 158680,
        "last_updated": null
    },
    {
        "urduURN": 4066600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6752,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، انہوں نے کہا کہ مجھ سے مالک نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ولاء اسی کے ساتھ قائم ہوتی ہے جو آزاد کر دے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 158690,
        "last_updated": null
    },
    {
        "urduURN": 4066610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6753,
        "hadithSanad": "ہم سے قبیصہ بن عقبہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابوقیس نے ، ان سے ہزیل نے انہوں نے عبداللہ سے نقل کیا ، انہوں نے فرمایا",
        "hadithText": "حضرت عبداللہ رضی اللہ عنہ نے فرمایا مسلمان سائبہ نہیں بناتے اور دور جاہلیت میں مشرکین سائبہ بناتے تھے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 158700,
        "last_updated": null
    },
    {
        "urduURN": 4066620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6754,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، کہا ہم سے ابوعوانہ نے بیان کیا ، ان سے منصور نے ، ان سے ابراہیم نے ، ان سے اسود نے اور ان سے عائشہ رضی اللہ عنہا نے کہ بریرہ کو انہوں نے آزاد کرنے کے لیے خریدنا چاہا لیکن ان کے نائکوں نے اپنے ولاء کی شرط لگا دی عائشہ رضی اللہ عنہا نے کہا",
        "hadithText": "یا رسول اللہ ! میں نے آزاد کرنے کے لیے بریرہ کو خریدنا چاہا لیکن ان کے مالکوں نے اپنے لیے ان کی ولاء کی شرط لگا دی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دے ، ولاء تو آزاد کرنے والے کے ساتھ قائم ہوتی ہے ۔ بیان کیا کہ پھر میں نے انہیں خریدا اور آزاد کر دیا اور میں نے بریرہ کو اختیار دیا ( کہ چاہیں تو شوہر کے ساتھ رہ سکتی ہیں ورنہ علیحدہ بھی ہو سکتی ہیں ) تو انہوں نے شوہر سے علیحدگی کو پسند کیا اور کہا کہ مجھے اتنا اتنا مال بھی دیا جائے تو میں پہلے شوہر کے ساتھ نہیں رہوں گی ۔ اسود نے بیان کیا کہ ان کے شوہر آزاد تھے ۔ اسود کا قول منقطع ہے اور ابن عباس رضی اللہ عنہما کا قول صحیح ہے کہ میں نے انہیں غلام دیکھا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 158710,
        "last_updated": null
    },
    {
        "urduURN": 4066630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6755,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر نے بیان کیا ، ان سے اعمش نے ، ان سے ابراہیم تیمی نے ، ان سے ان کے والد نے بیان کیا کہ",
        "hadithText": "حضرت علی رضی اللہ عنہ نے بتلایا کہ ہمارے پاس کوئی کتاب نہیں ہے جسے ہم پڑھیں ، سوا اللہ کی کتاب قرآن کے اور اس کے علاوہ یہ صحیفہ بھی ہے ۔ بیان کیا کہ پھر وہ صحیفہ نکالا تو اس میں زخموں ( کے قصاص ) اور اونٹوں کی زکوٰۃ کے مسائل تھے ۔ راوی نے بیان کیا کہ اس میں یہ بھی تھا کے عیر سے ثور تک مدینہ حرم ہے جس نے اس دین میں کوئی نئی بات پیدا کی یا نئی بات کرنے والے کو پناہ دی تو اس پر اللہ اور فرشتوں اور انسانوں سب کی لعنت ہے اورقیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور جس نے اپنے مالکوں کی اجازت کے بغیر دوسرے لوگوں سے مولات قائم کر لی تو اس پر فرشتوں اور انسانوں سب کی لعنت ہے ، قیامت کے دن اس کا کوئی نیک عمل مقبول نہ ہو گا اور مسلمانوں کا ذمہ ( قول و قرار ، کسی کو پناہ دینا وغیرہ ) ایک ہے ۔ ایک ادنی مسلمان کے پناہ دینے کو بھی قائم رکھنے کی کوشش کی جائے گی ۔ پس جس نے کسی مسلمان کی دی ہوئی پناہ کو توڑا ، اس پر اللہ کی ، فرشتوں اور انسانوں سب کی لعنت ہے قیامت کے دن اس کا کوئی نیک عمل قبول نہیں کیا جائے گا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 158720,
        "last_updated": null
    },
    {
        "urduURN": 4066640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6756,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ولاء کے تعلق کو بیچنے ، اس کو ہبہ کرنے سے منع فرمایا ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 158730,
        "last_updated": null
    },
    {
        "urduURN": 4066650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6757,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے امام مالک رحمہ اللہ نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے ایک کنیز کو آزاد کرنے کے لیے خریدنا چاہا تو کنیز کے مالکوں نے کہا کہ ہم بیچ سکتے ہیں لیکن ولاء ہمارے ساتھ ہو گی ۔ ام المؤمنین نے اس کا ذکر رسول اللہ صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا اس شرط کو مانع نہ بننے دو ، ولاء ہمیشہ اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 158740,
        "last_updated": null
    },
    {
        "urduURN": 4066660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6758,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا ہم کو جریر نے خبر دی ، انہیں منصور نے ، انہیں ابراہیم نے ، انہیں اسود نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے بریرہ کو خریدنا چاہا تو ان کے مالکوں نے شرط لگائی کہ ولاء ان کے ساتھ قائم ہو گی ۔ میں نے اس کا تذکرہ نبی کریم صلی اللہ علیہ وسلم سے کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں آزاد کر دو ، ولاء قیمت ادا کرنے والے ہی کے ساتھ قائم ہوتی ہے ۔ بیان کیا کہ پھر میں نے آزاد کر دیا ۔ پھر انہیں آنحضرت صلی اللہ علیہ وسلم نے بلایا اور ان کے شوہر کے معاملہ میں اختیار دیا ۔ انہوں نے کہا کہ اگر مجھے یہ یہ چیزیں بھی وہ دیدے تو میں اس کے ساتھ رات گزارنے کے لیے تیار نہیں ۔ چنانچہ اس نے شوہر سے علیحدگی کو پسند کیا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 158750,
        "last_updated": null
    },
    {
        "urduURN": 4066670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6759,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا ہم سے ہمام نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے بریرہ رضی اللہ عنہا کو خریدنا چاہا اور رسول اللہ صلی اللہ علیہ وسلم سے کہا کہ یہ لوگ ولاء کی شرط لگاتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ خرید لو ، ولاء تو اسی کے ساتھ قائم ہوتی ہے جو آزاد کرے ۔ ( آزاد کرائے ) ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 158760,
        "last_updated": null
    },
    {
        "urduURN": 4066680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6760,
        "hadithSanad": "ہم سے ابن سلام نے بیان کیا ، کہا ہم کو وکیع نے خبر دی ، انہیں سفیان نے ، انہیں منصور نے ، انہیں ابراہیم نے ، انہیں اسود نے ، اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ولاء اس کے ساتھ قائم ہو گی جو قیمت دے اور احسان کرے ۔ ( آزاد کر کے ) ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 158770,
        "last_updated": null
    },
    {
        "urduURN": 4066690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6761,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے معاویہ بن قرہ اور قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی گھرانے کا غلام اسی کا ایک فرد ہوتا ہے ، ” اوکما قال “ ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 158780,
        "last_updated": null
    },
    {
        "urduURN": 4066700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6762,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کسی گھرانے کا بھانجا اس کا ایک فرد ہے ۔ ( منہم یا من انفسہم کے الفاظ فرمائے ) ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 158790,
        "last_updated": null
    },
    {
        "urduURN": 4066710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6763,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے عدی نے ، ان سے ابوحازم نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے مال چھوڑا ( اپنی موت کے بعد ) وہ اس کے وارثوں کا ہے اور جس نے قرض چھوڑا ہے وہ ہمارے ذمہ ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 158800,
        "last_updated": null
    },
    {
        "urduURN": 4066720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6764,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے علی بن حسین نے بیان کیا ، ان سے عمر بن عثمان نے بیان کیا اور ان سے اسامہ بن زید رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مسلمان باپ کافر بیٹے کا وارث نہیں ہوتا اور نہ کافر بیٹا مسلمان باپ کا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 158810,
        "last_updated": null
    },
    {
        "urduURN": 4066730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6765,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہا کا ایک لڑکے کے بارے میں جھگڑا ہوا ۔ سعد رضی اللہ عنہ نے کہا کہ یا رسول اللہ ! یہ میرے بھائی عتبہ بن ابی وقاص کا لڑکا ہے ، اس نے مجھے وصیت کی تھی کہ یہ اس کا لڑکا ہے آپ اس کی مشابہت اس میں دیکھئیے اور عبد بن زمعہ نے کہا کہ میرا بھائی ہے یا رسول اللہ ! میرے والد کے بستر پر ان کی لونڈی سے پیدا ہوا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے لڑکے کی صورت دیکھی تو اس کی عتبہ کے ساتھ صاف مشابہت واضح تھی ، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا عبد ! لڑکا بستر والے کا ہوتا ہے اور زانی کے حصہ میں پتھر ہیں اور اے سودہ بنت زمعہ ! ( ام المؤمنین رضی اللہ عنہا ) اس لڑکے سے پردہ کیا کر چنانچہ پھر اس لڑکے نے ام المؤمنین کو نہیں دیکھا ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 158820,
        "last_updated": null
    },
    {
        "urduURN": 4066740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6766,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے خالد نے بیان کیا یہ ابن عبداللہ ہیں ، کہا ہم سے خالد نے بیان کیا ، ان سے ابوعثمان نے اور ان سے سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جس نے اپنے باپ کے سوا کسی اور کے بیٹے ہونے کا دعویٰ کیا یہ جانتے ہوئے کہ وہ اس کا باپ نہیں ہے تو جنت اس پر حرام ہے ۔ \n<span class=urdu_sanad>پھر میں نے اس کا تذکرہ ابوبکر رضی اللہ عنہ سے کیا تو انہوں نے کہا</span> اس حدیث کو آنحضرت صلی اللہ علیہ وسلم سے میرے دونوں کانوں نے بھی سنا ہے اور میرے دل نے اس کو محفوظ رکھا ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 158831,
        "last_updated": null
    },
    {
        "urduURN": 4066760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6768,
        "hadithSanad": "ہم سے اصبغ بن الفرج نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا کہ مجھ کو عمرو نے خبر دی ، انہیں جعفر بن ربیعہ نے ، انہیں عراک نے اور انہیں ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا اپنے باپ کا کوئی انکار نہ کرے کیونکہ جو اپنے باپ سے منہ موڑتا ہے ( اور اپنے کو دوسرے کا بیٹا ظاہر کرتا ہے تو ) یہ کفر ہے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 158850,
        "last_updated": null
    },
    {
        "urduURN": 4066770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6769,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا کہ ہم سے ابوالزناد نے بیان کیا ، ان سے عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، دو عورتیں تھیں اور ان کے ساتھ ان کے دو بچے بھی تھے ، پھر بھیڑیا آیا اور ایک بچے کو اٹھا کر لے گیا اس نے اپنی ساتھی عورت سے کہا کہ بھیڑیا تیرے بچے کو لے گیا ہے ، دوسری عورت نے کہا کہ وہ تو تیرا بچہ لے گیا ہے ۔ وہ دونوں عورتیں اپنا مقدمہ داؤد علیہ السلام کے پاس لائیں تو آپ نے فیصلہ بڑی کے حق میں کر دیا ۔ وہ دونوں نکل کر سلیمان بن داؤد علیہما السلام کے پاس گئیں اور انہیں واقعہ کی اطلاع دی ۔ سلیمان علیہ السلام نے کہا کہ چھری لاؤ میں لڑکے کے دو ٹکڑے کر کے دونوں کو ایک ایک دوں گا ۔ اس پر چھوٹی عورت بول اٹھی کہ ایسا نہ کیجئے آپ پر اللہ رحم کرے ، یہ بڑی ہی کا لڑکا ہے لیکن آپ علیہ السلام نے فیصلہ چھوٹی عورت کے حق میں کیا ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ واللہ ! میں نے ” سکین “ ( چھری ) کا لفظ سب سے پہلی مرتبہ ( آنحضرت صلی اللہ علیہ وسلم کی زبان سے ) اس دن سنا تھا اور ہم اس کے لیے ( اپنے قبیلہ میں ) ” مدیہ “ کا لفظ بولتے تھے ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 158860,
        "last_updated": null
    },
    {
        "urduURN": 4066780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6770,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم میرے یہاں ایک مرتبہ بہت خوش خوش تشریف لائے ۔ آپ صلی اللہ علیہ وسلم کا چہرہ چمک رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا تم نے نہیں دیکھا ، مجزز ( ایک قیافہ شناس ) نے ابھی ابھی زید بن حارثہ اور اسامہ بن زید رضی اللہ عنہما کے ( صرف پاؤں دیکھے ) اور کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 158870,
        "last_updated": null
    },
    {
        "urduURN": 4066790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 85,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6771,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عروہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک دن رسول اللہ صلی اللہ علیہ وسلم میرے یہاں تشریف لائے ، آپ صلی اللہ علیہ وسلم بہت خوش تھے اور فرمایا عائشہ ! تم نے دیکھا نہیں ، مجزز المدلجی آیا اور اس نے اسامہ اور زید ( رضی اللہ عنہما ) کو دیکھا ، دونوں کے جسم پر ایک چادر تھی ، جس نے دونوں کے سروں کو ڈھک لیا تھا اور ان کے صرف پاؤں کھلے ہوئے تھے تو اس نے کہا کہ یہ پاؤں ایک دوسرے سے تعلق رکھتے ہیں ۔</b>",
        "bookID": "85.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 158880,
        "last_updated": null
    }
]