[
    {
        "urduURN": 4066810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6772,
        "hadithSanad": "مجھ سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے ابوبکر بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب بھی زنا کرنے والا زنا کرتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی شراب پینے والا شراب پیتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی چوری کرنے والا چوری کرتا ہے تو وہ مؤمن نہیں رہتا ، جب بھی کوئی لوٹنے والا لوٹتا ہے کہ لوگ نظریں اٹھا اٹھا کر اسے دیکھنے لگتے ہیں تو وہ مؤمن نہیں رہتا ۔ اور ابن شہاب سے روایت ہے ، ان سے سعید بن مسیب اور ابوسلمہ نے بیان کیا ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح سوا لفظ ” نہبہ “ کے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 158891,
        "last_updated": null
    },
    {
        "urduURN": 4066820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6773,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انہوں نے کہا ہم سے ہشام نے بیان کیا ، ان سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، نبی کریم کریم صلی اللہ علیہ ولم ( دوسری سند ) ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے شراب پینے پر چھڑی اور جوتے سے مارا تھا اور ابوبکر رضی اللہ عنہ نے چالیس کوڑے مارے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 158910,
        "last_updated": null
    },
    {
        "urduURN": 4066830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6774,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا ہم سے عبدالوہاب نے بیان کیا ، ان سے ایوب نے ، ان سے ابن ابی ملیکہ نے ، ان سے عقبہ بن حارث رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نعیمان یا ابن النعیمان کوشراب کے نشہ میں لایا گیا تو رسول اللہ صلی اللہ علیہ وسلم نے گھر میں موجود لوگوں کو حکم دیا کہ انہیں ماریں ۔ انہوں نے مارا ۔ عقبہ کہتے ہیں میں بھی ان لوگوں میں تھا جنہوں نے اس کو جوتوں سے مارا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 158920,
        "last_updated": null
    },
    {
        "urduURN": 4066840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6775,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے ایوب نے ، ان سے عبداللہ بن ابی ملکہ نے اور ان سے عقبہ بن حارث رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس نعیمان یا ابن نعیمان کو لایا گیا ، وہ نشہ میں تھا ۔ آنحضرت صلی اللہ علیہ وسلم پر یہ ناگوار گزرا اور آپ نے گھر میں موجود لوگوں کو حکم دیا کہ انہیں ماریں ۔ چنانچہ لوگوں نے انہیں لکڑی اور جوتوں سے مارا اور میں بھی ان لوگوں میں تھا جنہوں نے اسے مارا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 158930,
        "last_updated": null
    },
    {
        "urduURN": 4066850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6776,
        "hadithSanad": "ہم سے مسلم نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا ، ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے شراب پینے پر چھڑی اور جوتوں سے مارا تھا اور ابوبکر رضی اللہ عنہ نے چالیس ( 40 ) کوڑے لگوائے تھے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 158940,
        "last_updated": null
    },
    {
        "urduURN": 4066860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6777,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، ان سے ابوضمرہ نے بیان کیا ، ان سے انس نے بیان کیا ، ان سے یزید بن الہاد نے بیان کیا ، ان سے محمد بن ابراہیم نے بیان کیا ، ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص کو لایا گیا جو شراب پیے ہوئے تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا اسے مارو ، ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ہم میں بعض وہ تھے جنہوں نے اسے ہاتھ سے مارا بعض نے جوتے سے مارا اور بعض نے اپنے کپڑے سے مارا ۔ جب مارچکے تو کسی نے کہا کہ اللہ تجھے رسوا کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس طرح کے جملے نہ کہو ، اس کے معاملہ میں شیطان کی مدد نہ کر ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 158950,
        "last_updated": null
    },
    {
        "urduURN": 4066870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6778,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ، انہوں نے کہا ہم سے خالد بن الحارث نے بیان کیا ، انہوں نے کہا ہم سے سفیان نے بیان کیا ، ان سے ابوحصین نے ، انہوں نے کہا کہ میں نے عمیر بن سعید نخعی سے سنا ، کہا کہ میں نے علی بن ابی طالب رضی اللہ عنہ سے سنا ، انہوں نے کہا کہ",
        "hadithText": "میں نہیں پسندکروں گا کہ حد میں کسی کو ایسی سزا دوں کہ وہ مر جائے اور پھر مجھے اس کا رنج ہو ، سوا شرابی کے کہ اگر وہ مر جائے تو میں اس کی دیت ادا کر دوں گا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی کوئی حد مقرر نہیں کی تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 158960,
        "last_updated": null
    },
    {
        "urduURN": 4066880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6779,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، ان سے جعید نے ، ان سے یزید بن خصیفہ نے ، ان سے سائب بن یزید نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ اور پھر عمر رضی اللہ عنہ کے ابتدائی دور خلافت میں شراب پینے والا ہمارے پاس لایا جاتا تو ہم اپنے ہاتھ ، جوتے اور چادریں لے کر کھڑے ہو جاتے ( اور اسے مارتے ) آخر عمر رضی اللہ عنہ نے اپنے آخری دور خلافت میں شراب پینے والوں کو چالیس کوڑے مارے اور جب ان لوگوں نے مزید سرکشی کی اور فسق و فجور کیا تو ( 80 ) اسی کوڑے مارے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 158970,
        "last_updated": null
    },
    {
        "urduURN": 4066890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6780,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا کہ مجھ سے لیث نے بیان کیا ، کہا کہ مجھ سے خالد بن یزید نے بیان کیا ، ان سے سعید بن ابی ہلال نے ، ان سے زید بن اسلم نے ، ان سے ان کے والد نے اور ان سے عمر بن خطاب رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں ایک شخص ، جس کا نام عبداللہ تھا اور ” حمار “ ( گدھا ) کے لقب سے پکارے جاتے تھے ، وہ آنحضرت صلی اللہ علیہ وسلم کو ہنساتے تھے اور آنحضرت صلی اللہ علیہ وسلم نے انہیں شراب پینے پر مارا تھا تو انہیں ایک دن لایا گیا اور آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے حکم دیا اور انہیں ماراگیا ۔ حاضرین میں ایک صاحب نے کہا اللہ اس پر لعنت کرے ! کتنی مرتبہ کہا جا چکا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس پر لعنت نہ کرو واللہ میں نے اس کے متعلق یہی جانا ہے کہ یہ اللہ اور اس کے رسول سے محبت کرتا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 158980,
        "last_updated": null
    },
    {
        "urduURN": 4066900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6781,
        "hadithSanad": "ہم سے علی بن عبداللہ بن جعفر نے بیان کیا ، انہوں نے ہم سے انس بن عیاض نے بیان کیا ، ان سے ابن الہاد نے بیان کیا ، ان سے محمد بن ابراہیم نے ، ان سے ابوسلمہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس ایک شخص نشہ میں لایا گیا تو آنحضرت صلی اللہ علیہ وسلم نے انہیں مارنے کا حکم دیا ۔ ہم میں بعض نے انہیں ہاتھ سے مارا ، بعض نے جوتے سے مارا اور بعض نے کپڑے سے مارا ۔ جب مارچکے تو ایک شخص نے کہا ، کیا ہو گیا اسے ، اللہ اسے رسوا کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اپنے بھائی کے خلاف شیطان کی مدد نہ کرو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 158990,
        "last_updated": null
    },
    {
        "urduURN": 4066910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6782,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، انہوں نے کہا ہم سے عبداللہ بن داؤد نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن غزوان نے بیان کیا ، ان سے عکرمہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب زنا کرنے والا زنا کرتا ہے تو وہ مومن نہیں رہتا اور اسی طرح جب چور چوری کرتا ہے تو وہ مومن نہیں رہتا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 159000,
        "last_updated": null
    },
    {
        "urduURN": 4066920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6783,
        "hadithSanad": "ہم سے عمرو بن حفص بن غیاث نے بیان کیا ، انہوں نے کہا مجھ سے میرے والد نے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ابوصالح سے سنا ، ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ نے چور پر لعنت بھیجی کہ ایک انڈا چراتا ہے اور اس کا ہاتھ کاٹ لیا جاتا ہے ۔ ایک رسی چراتا ہے اس کا ہاتھ کاٹ لیا جاتا ہے ۔ اعمش نے کہا کہ لوگ خیال کرتے تھے کہ انڈے سے مراد لوہے کا انڈا ہے اور رسی سے مراد ایسی رسی سمجھتے تھے جو کئی درہم کی ہو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 159010,
        "last_updated": null
    },
    {
        "urduURN": 4066930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6784,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے ابن عیینہ نے بیان کیا ، ان سے زہری نے ، ان سے ابوادریس خولانی نے اور ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے یہاں ایک مجلس میں بیٹھے تھے تو آنحضرت صلی اللہ علیہ و سلم نے فرمایا کہ مجھ سے عہد کرو اللہ کے ساتھ کوئی شریک نہیں ٹھہراؤ گے ، چوری نہیں کرو گے اور زنا نہیں کرو گے اور آپ نے یہ آیت پوری پڑھی ” پس تم میں سے جو شخص اس عہد کو پورا کرے گا اس کا ثواب اللہ کے یہاں ہے اور جو شخص ان میں سے غلطی کرگزرا اور اس پر اسے سزا ہوئی تو وہ اس کا کفارہ ہے اور جو شخص ان میں سے کوئی غلطی کرگزرا اور اللہ تعالیٰ نے اس کی پردہ پوشی کر دی تو اگر اللہ چاہے گا تو اسے معاف کر دے گا اور اگر چاہےگا تو اس پر عذاب دے گا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 159020,
        "last_updated": null
    },
    {
        "urduURN": 4066940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6785,
        "hadithSanad": "مجھ سے محمد بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے عاصم بن علی نے بیان کیا ، انہوں نے کہا ہم عاصم بن محمد نے بیان کیا ، ان سے واقد بن محمد نے بیان کیا ، انہوں نے اپنے والد سے سنا کہ",
        "hadithText": "عبداللہ رضی اللہ صنہ نے کہا رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر فرمایا ، ہاں تم لوگ کس چیز کو سب سے زیادہ حرمت والی سمجھتے ہو ؟ لوگوں نے کہا کہ اپنے اسی مہینہ کو ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، ہاں ، کس شہر کو تم سب سے زیادہ حرمت والا سمجھتے ہو ؟ لوگوں نے جواب دیا کہ اپنے اسی شہر کو ۔ آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا ، ہاں ، کس دن کو تم سب سے زیادہ حرمت والا خیال کرتے ہو ؟ لوگوں نے کہا کہ اپنے اسی دن کو ۔ آنحضرت صلی اللہ علیہ وسلم نے اب فرمایا کہ پھر بلاشبہ اللہ نے تمہارے خون ، تمہارے مال اور تمہاری عزتوں کو حرمت والا قرار دیا ہے ، سوا اس کے حق کے ، جیسا کہ اس دن کی حرمت اس شہر اور اس مہینہ میں ہے ۔ ہاں ! کیا میں نے تمہیں پہنچا دیا ۔ تین مرتبہ آپ نے فرمایا اور ہر مرتبہ صحابہ نے جواب دیا کہ ہاں ، پہنچا دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا افسوس میرے بعد تم کافر نہ بن جانا کہ ایک دوسرے کی گردن مارنے لگو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 159030,
        "last_updated": null
    },
    {
        "urduURN": 4066950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6786,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے ، ان سے عقیل نے ، ان سے شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو جب بھی دو چیزوں میں سے ایک کے اختیار کرنے کا حکم دیا گیا تو آپ نے ان میں سے آسان ہی کو پسند کیا ، بشرطیکہ اس میں گناہ کا کوئی پہلو نہ ہو ، اگر اس میں گناہ کا کوئی پہلو ہوتا تو آپ اس سے سب سے زیادہ دور ہوتے ۔ اللہ کی قسم ! آنحضرت صلی اللہ علیہ وسلم نے کبھی اپنے ذاتی معاملہ میں کسی سے بدلہ نہیں لیا ، البتہ جب اللہ کی حرمتوں کو توڑا جاتا تو آپ اللہ کے لیے بدلہ لیتے تھے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 159040,
        "last_updated": null
    },
    {
        "urduURN": 4066960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6787,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "اسامہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ایک عورت کی ( جس پر حدی مقدمہ ہونے والا تھا ) سفارش کی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم سے پہلے کے لوگ اس لیے ہلاک ہو گئے کہ وہ کمزوروں پر تو حد قائم کرتے اور بلند مرتبہ لوگوں کو چھوڑ دیتے تھے ۔ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ اگر فاطمہ رضی اللہ عنہا نے بھی ( چوری ) کی ہوتی تو میں اس کا بھی ہاتھ کاٹ لیتا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 159050,
        "last_updated": null
    },
    {
        "urduURN": 4066970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6788,
        "hadithSanad": "ہم سے سعید بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عروہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ایک مخزومی عورت کا معاملہ جس نے چوری کی تھی ، قریش کے لوگوں کے لیے اہمیت اختیار کرگیا اور انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم سے اس معاملہ میں کون بات کر سکتا ہے اسامہ رضی اللہ عنہ کے سوا ، جو آنحضرت صلی اللہ علیہ وسلم کو بہت پیارے ہیں اور کوئی آپ سے سفارش کی ہمت نہیں کر سکتا ؟ چنانچہ اسامہ رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم سے بات کی تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، کیا تم اللہ کی حدوں میں سفارش کرنے آئے ہو ۔ ” پھر آپ کھڑے ہوئے اور خطبہ دیا اور فرمایا اے لوگو ! تم سے پہلے کے لوگ اس لیے گمراہ ہو گئے کہ جب ان میں کوئی بڑا آدمی چوری کرتا تو اسے چھوڑ دیتے لیکن اگر کمزور چوری کرتا تو اس پر حد قائم کرتے تھے اور اللہ کی قسم ! اگر فاطمہ بنت محمد ( صلی اللہ علیہ وسلم ) نے بھی چوری کی ہوتی تو محمد ( صلی اللہ علیہ وسلم ) اس کا ہاتھ ضرور کاٹ ڈالتے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 159060,
        "last_updated": null
    },
    {
        "urduURN": 4066980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6789,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے عمرہ نے بیان کیا اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چوتھائی دینار یا اس سے زیادہ پر ہاتھ کاٹ لیا جائے گا ۔ اس روایت کی متابعت عبدالرحمٰن بن خالد زہری کے بھتیجے اور معمر نے زہری کے واسطہ سے کی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 159070,
        "last_updated": null
    },
    {
        "urduURN": 4066990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6790,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، ان سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے ، ان سے عمرہ نے اور ان سے ام المؤمنین عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، چور کا ہاتھ ایک چوتھائی دینار پر کاٹ لیا جائے گا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 159080,
        "last_updated": null
    },
    {
        "urduURN": 4067000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6791,
        "hadithSanad": "ہم سے عمران بن میسرہ نے بیان کیا ، انہوں نے کہا ہم سے عبدالوارث نے بیان کیا ، انہوں نے کہا ہم سے حسین نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے محمد بن عبدالرحمٰن انصاری نے بیان کیا ، ان سے عمرہ بنت عبدالرحمٰن نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا چوتھائی دینار پر ہاتھ کاٹا جائے گا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 159090,
        "last_updated": null
    },
    {
        "urduURN": 4067010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6792,
        "hadithSanad": "ہم سے عثمان بن ابی شیبہ نے بیان کیا ، کہا ہم سے عبدہ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے بیان کیا اور انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں چور کا ہاتھ بغیر لکڑی کے چمڑے کی ڈھال یا عام ڈھال کی چوری پر ہی کاٹا جاتاتھا ۔ ہم سے عثمان نے بیان کیا ، کہا ہم سے حمید بن عبدالرحمٰن نے بیان کیا ، ان سے ہشام نے بیان کیا ، ان سے ان کے والد نے ، ان سے عائشہ رضی اللہ عنہا نے اسی طرح ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4067020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6793,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ نے خبر دی ، انہوں نے کہا ہم کو ہشام بن عروہ نے خبر دی ، انہیں ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "چور کا ہاتھ لکڑی کے چمڑے کی ڈھال یا عام ڈھال کی قیمت سے کم پر نہیں کاٹا جاتا تھا ۔ یہ دونوں ڈھال قیمت سے ملتی تھیں ۔ اس کی روایت وکیع اور ابن ادریس نے ہشام کے واسطے سے کی ، ان سے ان کے والد نے مرسلاً ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 159120,
        "last_updated": null
    },
    {
        "urduURN": 4067030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6794,
        "hadithSanad": "مجھ سے یوسف بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے ابواسامہ نے بیان کیا ، انہوں نے کہا ہشام بن عروہ نے ، ہم کو ان کے والد ( عروہ بن زبیر ) نے خبر دی ، انہوں نے عائشہ رضی اللہ عنہا سے ، انہوں نے بیان کیا",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں چور کا ہاتھ ڈھال کی قیمت سے کم پر نہیں کاٹا جاتا تھا ۔ لکڑی کے چمڑے کی ڈھال ہو یا عام ڈھال ، یہ دونوں چیزیں قیمت والی تھیں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 159130,
        "last_updated": null
    },
    {
        "urduURN": 4067040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6795,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا کہ مجھ سے مالک بن انس نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما کے آزاد کردہ غلام نافع نے بیان کیا ، ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک ڈھال پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 159140,
        "last_updated": null
    },
    {
        "urduURN": 4067050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6796,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے ، ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک ڈھال کی چوری پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 159150,
        "last_updated": null
    },
    {
        "urduURN": 4067060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6797,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے عبیداللہ نے بیان کیا ، کہا مجھ سے نافع نے بیان کیا ، ان سے عبداللہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک ڈھال پر ہاتھ کاٹا تھا جس کی قیمت تین درہم تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 159160,
        "last_updated": null
    },
    {
        "urduURN": 4067070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6798,
        "hadithSanad": "مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے ابوضمرہ نے بیان کیا ، کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک چور کا ہاتھ ایک ڈھال پر کاٹا تھا جس کی قیمت تین درہم تھی ، اس روایت کی متابعت محمد بن اسحاق نے کی اور لیث نے بیان کیا کہ مجھ سے نافع نے ( ثمنہ کے بجائے ) لفظ قیمۃ کہا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 159170,
        "last_updated": null
    },
    {
        "urduURN": 4067080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6799,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عبدالواحدنے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، کہا کہ میں نے ابوصالح سے سنا ، کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ نے چور پر لعنت کی ہے کہ ایک انڈا چراتا ہے اور اس کا ہاتھ کاٹا جاتا ہے ۔ ایک رسی چراتا ہے اور اس کا ہاتھ کاٹا جاتا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 159180,
        "last_updated": null
    },
    {
        "urduURN": 4067090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6800,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا کہ مجھ سے ابن وہب نے بیان کیا ، ان سے یونس نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک عورت کا ہاتھ کٹوایا ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ وہ عورت بعد میں بھی آتی تھی اور میں اس کی ضرورتیں حضور اکرم صلی اللہ علیہ وسلم کے سامنے رکھتی تھی ۔ اس عورت نے توبہ کر لی تھی اور حسن توبہ کا ثبوت دیا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 159190,
        "last_updated": null
    },
    {
        "urduURN": 4067100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6801,
        "hadithSanad": "ہم سے عبداللہ بن محمد الجعفی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوادریس نے اور ان سے عبادہ بن الصامت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک جماعت کے ساتھ بیعت کی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ میں تم سے عہد لیتا ہوں کہ تم اللہ کا کسی کو شریک نہیں ٹھہراؤ گے ، تم چوری نہیں کرو گے ، اپنی اولاد کی جان نہیں لو گے ، اپنے دل سے گھڑکر کسی پر تہمت نہیں لگاؤ گے اور نیک کاموں میں میری نافرمانی نہ کرو گے ۔ پس تم میں سے جو کوئی وعدے پورا کرے گا اس کا ثواب اللہ کے اوپر لازم ہے اور جو کوئی ان میں سے کچھ غلطی کرگزرے گا اور دنیا میں ہی اسے اس کی سزا مل جائے گی تو یہ اس کا کفارہ ہو گی اور اسے پاک کرنے والی ہو گی اور جس کی غلطی کو اللہ چھپالے گا تو اس کا معاملہ اللہ کے ساتھ ہے ، چاہے تو اسے عذاب دے اور چاہے تو اس کی مغفرت کر دے ۔ ابوعبداللہ امام بخاری رحمہ اللہ نے کہا کہ ہاتھ کٹنے کے بعد اگر چور نے توبہ کر لی تو اس کی گواہی قبول ہو گی ۔ یہی حال ہر اس شخص کا ہے جس پر حد جاری کی گئی ہو کہ اگر وہ توبہ کر لے گا تو اس کی گواہی قبول کی جائے گی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 159200,
        "last_updated": null
    },
    {
        "urduURN": 4067110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6802,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے ولید بن مسلم نے بیان کیا ، کہا کہ مجھ سے ابوقلابہ جرمی نے بیان کیا ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس قبیلہ عکل کے چند لوگ آئے اور اسلام قبول کیا لیکن مدینہ کی آب و ہوا انہیں موافق نہیں آئی ( ان کے پیٹ پھول گئے ) تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ صدقہ کے اونٹوں کے ریوڑ میں جائیں اور ان کا پیشاب اور دودھ ملاکرپئیں ۔ انہوں نے اس کے مطابق عمل کیا اور تندرست ہو گئے لیکن اس کے بعد وہ مرتد ہو گئے اور ان اونٹوں کے چراہوں کو قتل کر کے اونٹ ہنکالے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کی تلاش میں سوار بھیجے اور انہیں پکڑ کے لایا گیا پھر ان کے ہاتھ پاؤں کاٹ دئیے گئے اور ان کی آنکھیں پھوڑ دی گئیں ( کیونکہ انہوں نے اسلامی چرواہے کے ساتھ ایسا ہی برتاؤ کیا تھا ) اور ان کے زخموں پر داغ نہیں لگوایا گیا یہاں تک کہ وہ مرگئے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 159210,
        "last_updated": null
    },
    {
        "urduURN": 4067120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6803,
        "hadithSanad": "ہم سے ابویعلیٰ محمد بن صلت نے بیان کیا ، کہا ہم سے ولید نے بیان کیا ، کہا مجھ سے اوزاعی نے بیان کیا ، ان سے یحییٰ نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عرینیوں کے ( ہاتھ پاؤں ) کٹوا دئیے لیکن ان پر داغ نہیں لگوایا ۔ یہاں تک کہ وہ مرگئے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 159220,
        "last_updated": null
    },
    {
        "urduURN": 4067130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6804,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے وہیب بن خالد نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابوقلابہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "قبیلہ عکل کے کچھ لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس سنہ۶ھ میں آئے اور یہ لوگ مسجد کے سائبان میں ٹھہرے ۔ مدینہ منورہ کی آب و ہوا انہیں موافق نہیں آئی ۔ انہوں نے کہا یا رسول اللہ ! ہمارے لیے دودھ کہیں سے مہیا کرا دیں ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو میرے پاس نہیں ہے ۔ البتہ تم لوگ ہمارے اونٹوں میں چلے جاؤ ۔ چنانچہ وہ آئے اور ان کا دودھ اور پیشاب پیا اور صحت مند ہو کر موٹے تازے ہو گئے ۔ پھر انہوں نے چرواہے کو قتل کر دیا اور اونٹوں کو ہنکالے گئے ۔ اتنے میں آنحضرت صلی اللہ علیہ وسلم کے پاس فریادی پہنچا اور آنحضرت صلی اللہ علیہ وسلم نے ان کی تلاش میں سوار بھیجے ۔ ابھی دھوپ زیادہ پھیلی بھی نہیں تھی کہ انہیں پکڑ کر لایا گیا پھر آنحضرت صلی اللہ علیہ وسلم کے حکم سے سلائیاں گرم کی گئیں اور ان کی آنکھوں میں پھیر دی گئیں اور ان کے ہاتھ پاؤں کاٹ دئیے گئے اور ان کے ( زخم سے خون کو روکنے کے لیے ) انہیں داغا بھی نہیں گیا ۔ اس کے بعد وہ ” حرہ “ ( مدینہ کی پتھریلی زمین ) میں ڈال دئیے گئے ، وہ پانی مانگتے تھے لیکن انہیں پانی نہیں دیا گیا ۔ یہاں تک کہ وہ مر گئے ۔ ابوقلابہ نے کہا کہ یہ اس وجہ سے کیا گیا تھا کہ انہوں نے چوری کی تھی ، قتل کیا تھا اور اللہ اور اس کے رسول سے غدارانہ لڑائی لڑی تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 159230,
        "last_updated": null
    },
    {
        "urduURN": 4067140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6805,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب سختیانی نے ، ان سے ابوقلابہ نے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ عکل یا عرینہ کے چند لوگ میں سمجھتا ہوں عکل کا لفظ کہا ، مدینہ آئے اور آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے دودھ دینے والی اونٹنیوں کا انتظام کر دیا اور فرمایا کہ وہ اونٹوں کے گلہ میں جائیں اور ان کا پیشاب اور دودھ پئیں ۔ چنانچہ انہوں نے پیا اور جب وہ تندرست ہو گئے تو چرواہے کو قتل کر دیا اور اونٹوں کو ہنکالے گئے ۔ آنحضرت صلی اللہ علیہ وسلم کے پاس یہ خبر صبح کے وقت پہنچی تو آپ نے ان کے پیچھے سوار دوڑائے ۔ ابھی دھوپ زیادہ پھیلی بھی نہیں تھی کہ وہ پکڑ کر لائے گئے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم کے حکم سے ان کے بھی ہاتھ پاؤں کاٹ دئیے گئے اور ان کی بھی آنکھوں میں سلائی پھیر دی گئی اور انہیں ” حرہ “ میں ڈال دیا گیا ۔ وہ پانی مانگتے تھے لیکن انہیں پانی نہیں دیا جاتا تھا ۔ ابوقلابہ نے کہا کہ یہ وہ لوگ تھے جنہوں نے چوری کی تھی ، قتل کیا تھا ، ایمان کے بعد کفر اختیار کیا تھا اور اللہ اور اس کے رسول سے غدارانہ لڑائی لڑی تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 159240,
        "last_updated": null
    },
    {
        "urduURN": 4067150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6806,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں عبیداللہ بن عمر عمری نے ، انہیں خبیب بن عبدالرحمٰن نے ، انہیں حفص بن عاصم نے اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سات آدمی ایسے ہیں جنہیں اللہ تعالیٰ قیامت کے دن اپنے عرش کے نیچے سایہ دے گا جبکہ اس کے عرش کے سایہ کے سوا اور کوئی سایہ نہیں ہو گا ۔ عادل حاکم ، نوجوان جس نے اللہ کی عبادت میں جوانی پائی ، ایسا شخص جس نے اللہ کو تنہائی میں یاد کیا اور اس کی آنکھوں سے آنسو نکل پڑے ، وہ شخص جس کا دل مسجد میں لگارہتا ہے ۔ وہ آدمی جو اللہ کے لیے محبت کرتے ہیں ۔ وہ شخص جسے کسی بلند مرتبہ اور خوبصورت عورت نے اپنی طرف بلایا اور اس نے جواب دیا کہ میں اللہ سے ڈرتا ہوں اور وہ شخص جس نے اتنا پوشیدہ صدقہ کیا کہ اس کے بائیں ہاتھ کو بھی پتہ نہ چل سکا کہ دائیں نے کتنا اور کیا صدقہ کیا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 159250,
        "last_updated": null
    },
    {
        "urduURN": 4067160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6807,
        "hadithSanad": "ہم سے محمد بن ابی بکر نے بیان کیا ، کہا ہم سے عمر بن علی نے بیان کیا ۔ ( دوسری سند امام بخاری نے کہا ) اور مجھ سے خلیفہ بن حیاط نے بیان کیا ، ان سے عمر بن علی نے ، ان سے ابوحازم سلمہ بن دینار نے بیان کیا ، ان سے سہل بن سعد ساعدی نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے مجھے اپنے دونوں پاؤں کے درمیان یعنی ( شرمگاہ ) کی اور اپنے دونوں جبڑوں کے درمیان ( یعنی زبان ) کی ضمانت دے دی تو میں اسے جنت میں جانے کا بھروسہ دلاتا ہوں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 159260,
        "last_updated": null
    },
    {
        "urduURN": 4067170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6808,
        "hadithSanad": "ہمیں داؤد بن شبیب نے خبر دی ، کہا ہم سے ہمام نے بیان کیا ، ان سے قتادہ نے ، کہا ہم کو حضرت انس رضی اللہ عنہ نے خبر دی ہے کہ",
        "hadithText": "میں تم سے ایک ایسی حدیث بیان کروں گا کہ میرے بعد کوئی اسے نہیں بیان کرے گا ۔ میں نے یہ حدیث نبی کریم صلی اللہ علیہ وسلم سے سنی ہے ۔ میں نے آنحضرت صلی اللہ علیہ وسلم کو یہ کہتے سنا کہ قیامت اس وقت تک قائم نہیں ہو گی یا یوں فرمایا کہ قیامت کی نشانیوںمیں سے یہ ہے کہ علم دین دنیا سے اٹھ جائے گا اور جہالت پھیل جائے گی ، شراب بکثرت پی جانے لگے گی اور زنا پھیل جائے گا ۔ مرد کم ہو جائیں گے اور عورتوں کی کثرت ہو گی ۔ حالت یہاں تک پہنچ جائے گی کہ پچاس عورتوں پر ایک ہی خبر لینے والا مرد رہ جائے گا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 159270,
        "last_updated": null
    },
    {
        "urduURN": 4067180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6809,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انہوں نے کہا ہم کو اسحاق بن یوسف نے خبر دی ، کہا ہم کو فضیل بن غزوان نے خبر دی ، انہیں عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بندہ جب زنا کرنا ہے تو وہ مومن نہیں رہتا ۔ بندہ جب چوری کرتا ہے تو وہ مومن نہیں رہتا اور بندہ جب شراب پیتا ہے تو وہ مومن نہیں رہتا اور جب وہ قتل ناحق کرتا ہے تو وہ مومن نہیں رہتا ۔ عکرمہ نے کہا کہ میں نے حضرت ابن عباس رضی اللہ عنہما سے پوچھا کہ ایمان اس سے کس طرح نکال لیا جاتا ہے ؟ آپ نے فرمایا کہ وہ اس طرح اور اس وقت آپ ان نے اپنی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں ڈال کر پھر الگ کر لیا پھر اگر وہ توبہ کر لیتا ہے تو ایمان اس کے پاس لوٹ آتا ہے ۔ اس طرح اور آپ نے اپنی انگلیوں کو دوسرے ہاتھ کی انگلیوں میں ڈالا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 159280,
        "last_updated": null
    },
    {
        "urduURN": 4067190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6810,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے اعمش نے بیان کیا ، ان سے ذکوان نے بیان کیا ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ زنا کرنے والا جب زنا کرتا ہے تو وہ مومن نہیں رہتا ۔ وہ چور جب چوری کرتا ہے تو وہ مومن نہیں رہتا شرابی جب شراب پیتا ہے تو وہ مومن نہیں رہتا ۔ پھر ان سب آدمیوں کے لیے توبہ کا دروازہ بہرحال کھلا ہوا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 159290,
        "last_updated": null
    },
    {
        "urduURN": 4067200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6811,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا کہ مجھ سے منصور اور سلیمان نے بیان کیا ، ان سے ابوائل نے ، ان سے ابومیسرہ نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے پوچھا یا رسول اللہ ! کون سا گناہ سب سے بڑا ہے ۔ فرمایا یہ کہ تم اللہ کا کسی کو شریک بناؤ ، حالانکہ اسی نے تمہیں پیدا کیا ہے ۔ میں نے پوچھا اس کے بعد ؟ فرمایا یہ کہ تم اپنی اولاد کو اس خطرے سے مار ڈالو کہ وہ تمہارے کھانے میں تمہارے ساتھ شریک ہو گی ۔ میں نے پوچھا اس کے بعد ؟ فرمایا یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ، یحییٰ نے بیان کیا ، ان سے سفیان نے بیان کیا ، ان سے واصل نے بیان کیا ، ان سے ابووائل نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ میں نے عرض کیا یا رسول اللہ ! پھر اسی حدیث کی طرح بیان کیا ۔ عمرو نے کہا کہ پھر میں نے اس حدیث کا ذکر عبدالرحمٰن بن مہدی سے کیا اور انہوں نے ہم سے یہ حدیث سفیان ثوری سے بیان کی ۔ ان سے اعمش ، منصور اور واصل نے ، ان سے ابوائل نے اور ان سے ابومیسرہ نے ۔ عبدالرحمٰن بن مہدی نے کہا کہ تم اس سند کو جانے بھی دو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 159300,
        "last_updated": null
    },
    {
        "urduURN": 4067210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6812,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے سلمہ بن کہیل نے بیان کیا ، کہا کہ میں نے شعبی سے سنا ، انہوں نے حضرت علی رضی اللہ عنہ سے بیان کیا کہ",
        "hadithText": "جب انہوں نے جمعہ کے دن عورت کو رجم کیا تو کہا کہ میں نے اس کا رجم رسول اللہ صلی اللہ علیہ وسلم کی سنت کے مطابق کیا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 159320,
        "last_updated": null
    },
    {
        "urduURN": 4067220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6813,
        "hadithSanad": "مجھ سے اسحاق واسطی نے بیان کیا ، کہا ہم سے خالد طحان نے بیان کیا ، ان سے شیبانی نے کہا میں نے حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ سے پوچھا ۔",
        "hadithText": "کیا رسول اللہ صلی اللہ علیہ وسلم نے کسی کو رجم کیا تھا ۔ انہوں نے کہا کہ ہاں میں نے پوچھا سورۃ النور سے پہلے یا اس کے بعد کہا کہ یہ مجھے معلوم نہیں ۔ ( امرنامعلوم کے لیے اظہار لاعلمی کر دینا بھی امر محمود ہے ۔ )</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 159330,
        "last_updated": null
    },
    {
        "urduURN": 4067230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6814,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، کہا ہم کو عبداللہ بن مبارک نے خبر دی ، کہا ہم کو یونس نے خبر دی ، ان سے ابن شہاب نے بیان کیا ، کہا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا ، ان سے حضرت جابر بن عبداللہ انصاری رضی اللہ عنہما نے کہ",
        "hadithText": "قبیلہ اسلم کے ایک صاحب ماعز نامی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے اور کہا کہ میں نے زنا کیا ہے ۔ پھر انہوں نے اپنے زنا کا چار مرتبہ اقرار کیا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے رجم کا حکم دیا اور انہیں رجم کیا گیا ۔ وہ شادی شدہ تھے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 159340,
        "last_updated": null
    },
    {
        "urduURN": 4067240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6815,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ اور سعید بن المسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک صاحب ماعز بن مالک اسلمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آئے ، اس وقت آنحضرت صلی اللہ علیہ وسلم مسجد میں تھے ، انہوں نے آپ کو آواز دی اور کہا کہ یا رسول اللہ ! میں نے زنا کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف سے منہ پھیر لیا ۔ انہوں نے یہ بات چار دفعہ دوہرائی جب چار دفعہ انہوں نے اس گناہ کی اپنے اوپر شہادت دی تو آنحضرت صلی اللہ علیہ وسلم نے انہیں بلایا اور دریافت فرمایا کیا تم دیوانے ہو ؟ انہوں نے کہا کہ نہیں ۔ آپ نے دریافت فرمایا پھر کیا تم شادی شدہ ہو ؟ انہوں نے کہا ہاں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں لے جاؤ اور رجم کر دو ۔ \n<span class=urdu_sanad>ابن شہاب نے بیان کیا کہ پھر مجھے انہوں نے خبر دی ، جنہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے سنا تھا کہ انہوں نے کہا کہ</span> رجم کرنے والوں میں میں بھی تھا ، ہم نے انہیں آبادی سے باہر عیدگاہ کے پاس رجم کیا تھا جب ان پر پتھر پڑے تو وہ بھاگ پڑے لیکن ہم نے انہیں حرہ کے پاس پکڑا اور رجم کر دیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 159351,
        "last_updated": null
    },
    {
        "urduURN": 4067260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6817,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہما نے آپس میں ( ایک بچے عبدالرحمٰن نامی میں ) اختلاف کیا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا عبد بن زمعہ ! بچہ تو لے لے بچہ اسی کو ملے گا جس کی جورو یا لونڈی کے پیٹ سے وہ پیدا ہوا اور سودہ ! تم اس سے پردہ کیا کرو ۔ حضرت امام بخاری رحمہ اللہ نے کہا کہ قتیبہ نے لیث سے اس زیادہ کے ساتھ بیان کیا کہ زانی کے حصہ میں پتھر کی سزا ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 159370,
        "last_updated": null
    },
    {
        "urduURN": 4067270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6818,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے محمد بن زیاد نے بیان کیا ، کہا کہ",
        "hadithText": "میں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا لڑکا اسی کو ملتا ہے جس کی جورو یا لونڈی کے پیٹ سے ہوا ہو اور حرام کار کے لیے صرف پتھر ہیں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 159380,
        "last_updated": null
    },
    {
        "urduURN": 4067280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6819,
        "hadithSanad": "ہم سے محمد بن عثمان نے بیان کیا ، کہا ہم سے خالد بن مخلد نے بیان کیا ، ان سے سلیمان بن بلال نے ، ان سے عبداللہ بن دینار نے بیان کیا اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک یہودی مرد اور ایک یہودی عورت کو لایا گیا ، جنہوں نے زنا کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا کہ تمہاری کتاب تورات میں اس کی سزا کیا ہے ؟ انہوں نے کہا کہ ہمارے علماء نے ( اس کی سزا ) چہرہ کو سیاہ کرنا اور گدھے پر الٹا سوار کرنا تجویز کی ہوئی ہے ۔ اس پر حضرت عبداللہ بن سلام رضی اللہ عنہ نے کہا یا رسول اللہ ! ان سے توریت منگوائیے ۔ جب توریت لائی گئی تو ان میں سے ایک نے رجم والی آیت پر اپنا ہاتھ رکھ لیا اور اس سے آگے اور پیچھے کی آیتیں پڑھنے لگا ۔ حضرت عبداللہ بن سلام رضی اللہ عنہ نے اس سے کہا کہ اپنا ہاتھ ہٹاؤ ( اور جب اس نے اپنا ہاتھ ہٹایا تو ) آیت رجم اس کے ہاتھ کے نیچے تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان دونوں کے متعلق حکم دیا اور انہیں رجم کر دیا گیا ۔ حضرت ابن عمر رضی اللہ عنہما نے بیان کیا کہ انہیں بلاط ( مسجدنبوی کے قریب ایک جگہ ) میں رجم کیا گیا ۔ میں نے دیکھا کہ یہودی عورت کو مرد بچانے کے لیے اس پر جھک جھک پڑتا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 159390,
        "last_updated": null
    },
    {
        "urduURN": 4067290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6820,
        "hadithSanad": "مجھ سے محمود نے بیان کیا ، کہا ہم سے عبدالرزاق نے بیان کیا ، کہا ہم کو معمر نے خبر دی ، انہیں زہری نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے اور انہیں حضرت جابر بن عبداللہ رضی اللہ عنہما نے کہ",
        "hadithText": "قبیلہ اسلم کے ایک صاحب ( ماعز بن مالک ) نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور زنا کا اقرار کیا ۔ لیکن آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف سے اپنا منہ پھیر لیا ۔ پھر جب انہوں نے چار مرتبہ اپنے لیے گواہی دی تو آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا کیا تم دیوانے ہو گئے ہو ؟ انہوں نے کہا کہ نہیں ۔ پھر آپ نے پوچھا کیا تمہارا نکاح ہو چکا ہے ؟ انہوں نے کہا کہ ہاں ۔ چنانچہ آپ کے حکم سے انہیں عیدگاہ میں رجم کیا گیا ۔ جب ان پر پتھر پڑے تو وہ بھاگ پڑے لیکن انہیں پکڑلیاگیا اور رجم کیا گیا یہاں تک کہ وہ مرگئے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کے حق میں کلمہ خیر فرمایا اور ان کا جنازہ ادا کیا اور ان کی تعریف کی جس کے وہ مستحق تھے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 159400,
        "last_updated": null
    },
    {
        "urduURN": 4067300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6821,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، ان سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے حمید بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب نے رمضان میں اپنی بیوی سے ہمبستری کر لی اور پھر رسول اللہ صلی اللہ علیہ وسلم سے اس کا حکم پوچھا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کیا تمہارے پاس کوئی غلام ہے ؟ انہوں نے کہا کہ نہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے دریافت فرمایا دو مہینے روزے رکھنے کی تم میں طاقت نہیں ؟ انہوں نے کہا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر کہا کہ پھر ساٹھ محتاجوں کو کھانا کھلاؤ ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 159410,
        "last_updated": null
    },
    {
        "urduURN": 4067310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6822,
        "hadithSanad": "اور لیث نے بیان کیا ، ان سے عمرو بن الحارث نے ، ان سے عبدالرحمٰن بن القاسم نے ، ان سے محمد بن جعفر بن زبیر نے ، ان سے عباد بن عبداللہ بن زبیر نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے پاس مسجد میں آئے اور عرض کیا میں تو دوزخ کا مستحق ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا بات ہوئی ؟ کہا کہ میں نے اپنی بیوی سے رمضان میں جماع کر لیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے کہا کہ پھر صدقہ کر ۔ انہوں نے کہا کہ میرے پاس کچھ بھی نہیں ۔ پھر وہ بیٹھ گیا اور اس کے بعد ایک صاحب گدھا ہانکتے لائے جس پر کھانے کی چیز رکھی تھی ۔ عبدالرحمٰن نے بیان کیا کہ مجھے معلوم نہیں کہ وہ کیا چیز تھی ۔ ( دوسری روایت میں یوں ہے کہ کھجور لدی ہوئی تھی ) اسے آنحضرت صلی اللہ علیہ وسلم کے پاس لایا جا رہا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ آگ میں جلنے والے صاحب کہاں ہیں ؟ وہ صاحب بولے کہ میں حاضر ہوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے لے اور صدقہ کر دے ۔ انہوں نے پوچھا کیا اپنے سے زیادہ محتاج کو دوں ؟ میرے گھر والوں کے لیے تو خود کوئی کھانے کی چیز نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر تم ہی کھا لو ۔ حضرت عبداللہ امام بخاری نے کہا کہ پہلی حدیث زیادہ واضح ہے جس میں اطعم اہلک کے الفاظ ہیں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 159420,
        "last_updated": null
    },
    {
        "urduURN": 4067320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6823,
        "hadithSanad": "مجھ سے عبدالقدوس بن محمد نے بیان کیا ، ان سے عمرو بن عاصم کلابی نے بیان کیا ، ان سے ہمام بن یحییٰ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے بیان کیا ، ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نبی کریم صلی اللہ علیہ وسلم کے پاس تھا کہ ایک صاحب کعب بن عمرو آئے اور کہا یا رسول اللہ ! مجھ پر حد واجب ہو گئی ہے ۔ آپ مجھ پر حد جاری کیجئے ۔ انہوں نے آنحضرت صلی اللہ علیہ وسلم نے اس سے کچھ نہیں پوچھا ۔ بیان کیا کہ پھر نماز کا وقت ہو گیا اور ان صاحب نے بھی آنحضرت صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ جب آنحضور نماز پڑھ چکے تو وہ پھر آنحضرت صلی اللہ علیہ وسلم کے پاس آ کر کھڑے ہو گئے اور کہا یا رسول اللہ ! مجھ پر حد واجب ہو گئی ہے آپ کتاب اللہ کے حکم کے مطابق مجھ پر حد جاری کیجئے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا ۔ کیا تم نے ابھی ہمارے ساتھ نماز نہیں پڑھی ہے ۔ انہوں نے کہا کہ جی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر اللہ نے تیرا گناہ معاف کر دیا ۔ یا فرمایا کہ تیری غلطی یا حد ( معاف کر دی ) ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 159430,
        "last_updated": null
    },
    {
        "urduURN": 4067330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6824,
        "hadithSanad": "مجھ سے عبداللہ بن محمد الجعفی نے بیان کیا ، کہا ہم سے وہب بن جریر نے بیان کیا ، کہا ہم سے ہمارے والد نے کہا کہ میں نے یعلیٰ بن حکیم سے سنا ، انہوں نے عکرمہ سے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب حضرت ماعز بن مالک نبی کریم صلی اللہ علیہ وسلم کے پاس آئے تو آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا غالباً تو نے بوسہ دیا ہو گا یا اشارہ کیا ہو گا یا دیکھا ہو گا ۔ انہوں نے کہا کہ نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کیا پھر تو نے ہمبستری ہی کر لی ہے ؟ اس مرتبہ آپ نے کنایہ سے کام نہیں لیا ۔ بیان کیا کہ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے انہیں رجم کا حکم دیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 159440,
        "last_updated": null
    },
    {
        "urduURN": 4067340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6825,
        "hadithSanad": "ہم سے سعید بن عفیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا مجھ سے عبدالرحمٰن بن خالد نے ، ان سے ابن شہاب نے ، ان سے ابن المسیب اور ابوسلمہ نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک صاحب آئے ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت مسجد میں بیٹھے ہوئے تھے ۔ انہوں نے آواز دی یا رسول اللہ ! میں نے زنا کیا ہے ۔ خود اپنے متعلق وہ کہہ رہے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے اپنا منہ پھیر لیا ۔ لیکن وہ صاحب بھی ہٹ کر اسی طرف کھڑے ہو گئے جدھر آپ صلی اللہ علیہ وسلم نے اپنا منہ پھیرا تھا اور عرض کیا یا رسول اللہ ! میں نے زنا کیا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر اپنا منہ پھیر لیا اور وہ بھی دوبارہ اس طرف آ گئے جدھر آنحضرت صلی اللہ علیہ وسلم نے اپنا منہ پھیرا تھا اور اس طرح جب اس نے چار مرتبہ اپنے گناہ کا اقرار کر لیا تو آنحضرت صلی اللہ علیہ وسلم نے اس کو بلایا اور پوچھا کیا تم پاگل ہو ؟ انہوں نے کہا کہ نہیں یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا تم شادی شدہ ہو ؟ انہوں نے کہا جی یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے صحابہ سے فرمایا کہ انہیں لے جاؤ اور رجم کر دو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 159451,
        "last_updated": null
    },
    {
        "urduURN": 4067350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم نے اسے زہری سے ( سن کر ) یاد کیا ، انہوں نے بیان کیا کہ مجھے عبیداللہ نے خبر دی ، انہوں نے حضرت ابوہریرہ اور زید بن خالد رضی اللہ عنہما سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے پاس تھے تو ایک صاحب کھڑے ہوئے اور کہا میں آپ کو اللہ کی قسم دیتا ہوں آپ ہمارے درمیان اللہ کی کتاب سے فیصلہ کریں ۔ اس پر اس کا مقابل بھی کھڑا ہو گیا اور وہ پہلے سے زیادہ سمجھدار تھا ، پھر اس نے کہا کہ واقعی آپ ہمارے درمیان کتاب اللہ سے ہی فیصلہ کیجئے اور مجھے بھی گفتگو کی اجازت دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کہو ۔ اس شخص نے کہا کہ میرا بیٹا اس شخص کے یہاںمزدوری پر کام کرتا تھا پھر اس نے اس کی عورت سے زنا کر لیا ، میں نے اس کے فدیہ میں اسے سو بکری اور ایک خادم دیا ، پھر میں نے بعض علم والوں سے پوچھا تو انہوں نے مجھے بتایا کہ میرے لڑکے پر سوکوڑے اور ایک سال شہر بدر ہونے کی حد واجب ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں تمہارے درمیان کتاب اللہ ہی کے مطابق فیصلہ کروں گا ۔ سو بکریاں اور خادم تمہیں واپس ہوں گے اور تمہارے بیٹے کو سو کوڑے لگائے جائیں گے اور ایک سال کے لیے اسے جلاوطن کیا جائے گا اور اے انیس ! صبح کو اس کی عورت کے پاس جانا اگر وہ ( زنا کا ) اقرار کر لے تو اسے رجم کر دو ۔ چنانچہ وہ صبح کو اس کے پاس گئے اور اس نے اقرار کر لیا اور انہوں نے رجم کر دیا ۔ علی بن عبداللہ مدینی کہتے ہیں میں نے سفیان بن عیینہ سے پوچھا جس شخص کا بیٹا تھا اس نے یوں نہیں کہا کہ ان عالموں نے مجھ سے بیان کیا کہ تیرے بیٹے پر رجم ہے ۔ انہوں نے کہا کہ مجھ کو اس میں شک ہے کہ زہری سے میں نے سنا ہے یا نہیں ، اس لیے میں نے اس کو کبھی بیان کیا کبھی نہیں بیان کیا بلکہ سکوت کیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 159470,
        "last_updated": null
    },
    {
        "urduURN": 4067360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6829,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ نے اور ان سے حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے کہا میں ڈرتا ہوں کہ کہیں زیادہ وقت گزر جائے اور کوئی شخص یہ کہنے لگے کہ کتاب اللہ میں تو رجم کا حکم ہمیں کہیں نہیں ملتا اور اس طرح وہ اللہ کے ایک فریضہ کو چھوڑ کر گمراہ ہوں جسے اللہ تعالیٰ نے نازل کیا ہے ۔ آگاہ ہو جاؤ کہ رجم کا حکم اس شخص کے لیے فرض ہے جس نے شادی شدہ ہونے کے باوجود زنا کیا ہو بشرطیکہ صحیح شرعی گواہیوں سے ثابت ہو جائے یا حمل ہو یا کوئی خود اقرار کرے ۔ سفیان نے بیان کیا کہ میں نے اسی طرح یاد کیا تھا آگاہ ہو جاؤ کہ رسول اللہ صلی اللہ علیہ وسلم نے رجم کیا تھا اور آپ کے بعد ہم نے رجم کیا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 159480,
        "last_updated": null
    },
    {
        "urduURN": 4067370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6830,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح بن کیسان نے ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں کئی مہاجرین کو ( قرآن مجید ) پڑھایا کرتا تھا ۔ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ بھی ان میں سے ایک تھے ۔ ابھی میں منیٰ میں ان کے مکان پر تھا اور وہ حضرت عمر رضی اللہ عنہ کے آخری حج میں ( سنہ 23 ھ ) ان کے ساتھ تھے کہ وہ میرے پاس لوٹ کر آئے اور کہا کہ کاش تم اس شخص کو دیکھتے جو آج امیرالمؤمنین کے پاس آیا تھا ۔ اس نے کہا کہ اے امیرالمؤمنین ! کیا آپ فلاں صاحب سے یہ پوچھ گچھ کریں گے جو یہ کہتے ہیں کہ اگر عمر کا انتقال ہو گیا تو میں صلاح صاحب طلحہ بن عبیداللہ سے بیعت کروں گا کیونکہ واللہ حضرت ابوبکر رضی اللہ عنہ کی بغیر سوچے سمجھے بیعت تو اچانک ہو گئی اور پھر وہ مکمل ہو گئی تھی ۔ اس پر حضرت عمر رضی اللہ عنہ بہت غصہ ہوئے اور کہا میں انشاءاللہ شام کے وقت لوگوں سے خطاب کروں گا اور انہیں ان لوگوں سے ڈراؤں گا جو زبردستی سے دخل درمعقولات کرنا چاہتے ہیں ۔ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا کہ اس پر میں نے عرض کیا یا امیرالمؤمنین ایسا نہ کیجئے ۔ حج کے موسم میں کم سمجھی اور برے بھلے ہر ہی قسم کے لوگ جمع ہیں اور جب آپ خطاب کے لئے کھڑے ہوں گے تو آپ کے قریب یہی لوگ زیادہ ہوں گے اور مجھے ڈر ہے کہ آپ کھڑے ہو کر کوئی بات کہیں اور وہ چاروں طرف پھیل جائے ، لیکن پھیلانے والے اسے صحیح طور پر یاد نہ رکھ سکیں گے اور اس کے غلط معانی پھیلانے لگیں گے ، اس لیے مدینہ منورہ پہنچنے تک کا انتظار کر لیجئے کیونکہ وہ ہجرت اور سنت کا مقام ہے ۔ وہاں آپ کو خالص دینی سمجھ بوجھ رکھنے والے اور شریف لوگ ملیں گے ، وہاں آپ جو کچھ کہنا چاہتے ہیں اعتماد کے ساتھ ہی فرما سکیں گے اور علم والے آپ کی باتوں کو یاد بھی رکھیں گے اور جو صحیح مطلب ہے وہی بیان کریں گے ۔ حضرت عمر رضی اللہ عنہ نے کہا ہاں اچھا اللہ کی قسم میں مدینہ منورہ پہنچتے ہی سب سے پہلے لوگوں کو اسی مضمون کا خطبہ دوں گا ۔ حضرت ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر ہم ذی الحجہ کے مہینہ کے آخر میں مدینہ منورہ پہنچے ۔ جمعہ کے دن سورج ڈھلتے ہی ہم نے ( مسجدنبوی ) پہنچنے میں جلدی کی اور میں نے دیکھا کہ سعید بن زید بن عمرو بن نفیل ممبر کی جڑ کے پاس بیٹھے ہوئے تھے ۔ میں بھی ان کے پاس بیٹھ گیا ۔ میرا ٹخنہ ان کے ٹخنے سے لگا ہوا تھا ۔ تھوڑی ہی دیر میں حضرت عمر رضی اللہ عنہ بھی باہر نکلے ، جب میں نے انہیں آتے دیکھا تو سعید بن زید بن عمرو بن نفیل رضی اللہ عنہ سے میں نے کہا کہ آج حضرت عمر رضی اللہ عنہ ایسی بات کہیں گے جو انہوں نے اس سے پہلے خلیفہ بنائے جانے کے بعد کبھی نہیں کہی تھی ۔ لیکن انہوں نے اس کو نہ مانا اور کہا کہ میں تو نہیں سمجھتا کہ آپ کوئی ایسی بات کہیں گے جو پہلے کبھی نہیں کہی تھی ۔ پھر حضرت عمر رضی اللہ عنہ ممبر پر بیٹھے اور جب مؤذن اذان دے کر خاموش ہوا تو آپ کھڑے ہوئے اور اللہ تعالیٰ کی ثنا اس کی شان کے مطابق بیان کرنے کے بعد فرمایا امابعد ! آج میں تم سے ایک ایسی بات کہوں گا جس کا کہنا میری تقدیر میں لکھا ہوا تھا ، مجھ کو نہیں معلوم کہ شاید میری یہ گفتگو موت کے قریب کی آخری گفتگو ہو ۔ پس جو کوئی اسے سمجھے اور محفوظ رکھے اسے چاہئے کہ اس بات کو اس جگہ تک پہنچادے جہاںتک اس کی سواری اسے لے جا سکتی ہے اور جسے خوف ہو کہ اس نے بات نہیں سمجھی ہے تو اس کے لیے جائز نہیں ہے کہ میری طرف غلط بات منسوب کرے ۔ بلاشبہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم کو حق کے ساتھ مبعوث کیا اور آپ پر کتاب نازل کی ، کتاب اللہ کی صورت میں جو کچھ آپ پر نازل ہوا ، ان میں آیت رجم بھی تھی ۔ ہم نے اسے پڑھا تھا سمجھا تھا اور یاد رکھا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے خود ( اپنے زمانہ میں ) رجم کرایا ۔ پھر آپ کے بعد ہم نے بھی رجم کیا لیکن مجھے ڈر ہے کہ اگر وقت یوں ہی آگے بڑھتا رہا تو کہیں کوئی یہ نہ دعویٰ کربیٹھے کہ رجم کی آیت ہم کتاب اللہ میں نہیں پاتے اور اس طرح وہ اس فریضہ کو چھوڑ کر گمراہ ہوں جسے اللہ تعالیٰ نے نازل کیا تھا ۔ یقیناً رجم کا حکم کتاب اللہ سے اس شخص کے لیے ثابت ہے جس نے شادی ہونے کے بعد زنا کیا ہو ۔ خواہ مرد ہوں یا عورتیں ، بشرطیکہ گواہی مکمل ہو جائے یاحمل ظاہر ہو یا وہ خود اقرار کر لے پھر کتاب اللہ کی آیتوں میں ہم یہ بھی پڑھتے تھے کہ اپنے حقیقی باپ دادوں کے سوا دوسروں کی طرف اپنے آپ کو منسوب نہ کرو ۔ کیونکہ یہ تمہارا کفر اور انکار ہے کہ تم اپنے اصل باپ دادوں کے سوا دوسروں کی طرف اپنی نسبت کرو ۔ ہاں اور سن لو کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ بھی فرمایا تھا کہ میری تعریف حد سے بڑھاکر نہ کرنا جس طرح عیسیٰ ابن مریم عیلہما السلام کی حد سے بڑھاکر تعریفیں کی گئیں ( ان کو اللہ کو بیٹا بنا دیا گیا ) بلکہ ( میرے لیے صرف یہ کہو کہ ) میں اللہ کا بندہ اور اس کا رسول ہوں اور مجھے یہ بھی معلوم ہوا ہے کہ تم میں سے کسی نے یوں کہا ہے کہ واللہ اگر عمرکا انتقال ہو گیا تو میں فلاں سے بیعت کروں گا دیکھو تم میں سے کسی کو یہ دھوکا نہ ہو کہ حضرت ابوبکر رضی اللہ عنہ کی بیعت ناگاہ ہوئی اور اللہ نے ناگہانی بیعت میں جو برائی ہوئی ہے اس سے تم کو بچائے رکھا اس کی وجہ یہ ہوئی کہ تم کو اللہ تعالیٰ نے اس کے شر سے محفوظ رکھا اور تم میں کوئی شخص ایسا نہیں جو ابوبکر رضی اللہ عنہ جیسا متقی ، خدا ترس ہو ۔ تم میں کون ہے جس سے ملنے کے لیے اونٹ چلائے جاتے ہوں ۔ دیکھو خیال رکھو کوئی شخص کسی سے بغیر مسلمانوں کے صلاح مشورہ اور اتفاق اور غلبہ آراء کے بغیر بیعت نہ کرے جو کوئی ایسا کرے گا اس کا نتیجہ یہی ہو گا کہ بیعت کرنے والا اور بیعت لینے والا دونوں اپنی جان گنوادیں گے اور سن لو بلاشبہ جس وقت حضور اکرم صلی اللہ علیہ وسلم کی وفات ہوی تو ابوبکر رضی اللہ عنہ ہم سب سے بہتر تھے البتہ انصار نے ہماری مخالفت کی تھی اور وہ سب لوگ سقیفہ بن ساعدہ میں جمع ہو گئے تھے ۔ اسی طرح علی اور زبیر رضی اللہ عنہما اور ان کے ساتھیوں نے بھی ہماری مخالفت کی تھی اور باقی مہاجرین ابوبکر رضی اللہ عنہ کے پاس جمع ہو گئے تھے ۔ اس وقت میں نے ابوبکر رضی اللہ عنہ سے کہا اے ابوبکر ! ہمیں اپنے ان انصار بھائیوں کے پاس لے چلئے ۔ چنانچہ ہم ان سے ملاقات کے ارادہ سے چل پڑے ۔ جب ہم ان کے قریب پہنچے تو ہماری انہیں کے دو نیک لوگوں سے ملاقات ہوئی اور انہوں نے ہم سے بیان کیا کہ انصاری آدمیوں نے یہ بات ٹھہرائی ہے کہ ( سعد بن عبادہ کو خلیفہ بنائیں ) اور انہوں نے پوچھا ۔ حضرات مہاجرین آپ لوگ کہاں جا رہے ہیں ۔ ہم نے کہا کہ ہم اپنے ان انصار بھائیوں کے پاس جا رہے ہیں ۔ انہوں نے کہا کہ آپ لوگ ہرگز وہاں نہ جائیں بلکہ خود جو کرنا ہے کر ڈالو لیکن میں نے کہا کہ بخدا ہم ضرور جائیں گے ۔ چنانچہ ہم آگے بڑھے اور انصار کے پاس سقیفہ بنی ساعدہ میں پہنچے مجلس میں ایک صاحب ( سردار خزرج ) چادر اپنے سارے جسم پر لپیٹے درمیان میں بیٹھے تھے ۔ میں نے پوچھا کہ یہ کون صاحب ہیں تو لوگوں نے بتایا کہ سعد بن عبادہ رضی اللہ عنہ ہیں ۔ میں نے پوچھا کہ انہیں کیا ہو گیا ہے ؟ لوگوں نے بتایا کہ بخار آ رہا ہے ۔ پھر ہمارے تھوڑی دیر تک بیٹھنے کے بعد ان کے خطیب نے کلمہ شہادت پڑھا اور اللہ تعالیٰ کی اس کی شان کے مطابق تعریف کی ۔ پھر کہا امابعد ! ہم اللہ کے دین کے مددگار ( انصار ) اور اسلام کے لشکر ہیں اور تم اے گروہ مہاجرین ! کم تعداد میں ہو ۔ تمہاری یہ تھوڑی سی تعداد اپنی قوم قریش سے نکل کر ہم لوگوں میں آ رہے ہو ۔ تم لوگ یہ چاہتے ہو کہ ہماری بیخ کنی کرو اور ہم کو خلافت سے محروم کر کے آپ خلیفہ بن بیٹھو یہ کبھی نہیں ہو سکتا ۔ جب وہ خطبہ پورا کر چکے تو میں نے بولنا چاہا ۔ میں نے ایک عمدہ تقریر اپنے ذہن میں ترتیب دے رکھی تھی ۔ میری بڑی خواہش تھی کہ حضرت ابوبکر رضی اللہ عنہ کے بات کرنے سے پہلے ہی میں اس کو شروع کر دوں اور انصار کی تقریر سے جو ابوبکر رضی اللہ عنہ کو غصہ پیدا ہوا ہے اس کو دور کر دوں جب میں نے بات کرنی چاہی تو ابوبکر رضی اللہ عنہ نے کہا ذرا ٹھہرو میں نے ان کو ناراض کرنا برا جانا ۔ آخر انہوں نے ہی تقریر شروع کی اور خدا کی قسم وہ مجھ سے زیادہ عقلمند اور مجھ سے زیادہ سنجیدہ اور متین تھے ۔ میں نے جو تقریر اپنے دل میں سوچ لی تھی اس میں سے انہوں نے کوئی بات نہیں چھوڑی ۔ فی البدیہہ وہی کہی بلکہ اس سے بھی بہتر پھر وہ خاموش ہو گئے ۔ ابوبکر رضی اللہ عنہ کی تقریر کا خلاصہ یہ تھا کہ انصاری بھائیو تم نے جو اپنی فضیلت اور بزرگی بیان کی ہے وہ سب درست ہے اور تم بیشک اس کے لیے سزا وار ہو مگر خلافت قریش کے سوا اور کسی خاندان والوں کے لیے نہیں ہو سکتی ۔ کیونکہ قریش ازروئے نسب اور ازروئے خاندان تمام عرب قوموں میں بڑھ چڑھ کر ہیں اب تم لوگ ایسا کرو کہ ان دو آدمیوں میں سے کسی سے بیعت کر لو ۔ ابوبکرنے میرا اور ابوعبیدہ بن جراح کا ہاتھ تھاما وہ ہمارے بیچ میں بیٹھے ہوئے تھے ، ان ساری گفتگو میں صرف یہی ایک بات مجھ سے میرے سوا ہوئی ۔ واللہ میں آگے کر دیا جاتا اور بےگناہ میری گردن ماردی جاتی تو یہ مجھے اس سے زیادہ پسند تھا کہ مجھے ایک ایسی قوم کا امیر بنایا جاتا جس میں ابوبکر رضی اللہ عنہ خود موجود ہوں ۔ میرا اب تک یہی خیال ہے یہ اور بات ہے کہ وقت پر نفس مجھے بہکادے اور میں کوئی دوسرا خیال کروں جو اب نہیں کرنا ۔ پھر انصار میں سے ایک کہنے والا حباب بن منذریوں کہنے لگا سنو سنو میں ایک لکڑی ہوں کہ جس سے اونٹ اپنا بدن رگڑ کر کھجلی کی تکلیف رفع کرتے ہیں اور میں وہ باڑ ہوں جو درختوں کے اردگرد حفاظت کے لیے لگائی جاتی ہے ۔ میں ایک عمدہ تدبیر بتاتا ہوں ایسا کرو دو خلیفہ رہیں ( دونوں مل کر کام کریں ) ایک ہماری قوم کا اور ایک قریش والوں کا ۔ مہاجرین قوم کا اب خوب شورغل ہونے لگا کوئی کچھ کہتا کوئی کچھ کہتا ۔ میں ڈرگیا کہ کہیں مسلمانوں میں پھوٹ نہ پڑ جائے آخر میں کہہ اٹھا ابوبکر ! اپنا ہاتھ بڑھاؤ ، انہوں نے ہاتھ بڑھایا میں نے ان سے بیعت کی اور مہاجرین جتنے وہاں موجود تھے انہوں نے بھی بیعت کر لی پھر انصاریوں نے بھی بیعت کر لی ( چلو جھگڑا تمام ہوا جو منظور الٰہی تھا وہی ظاہر ہوا ) اس کے بعد ہم حضرت سعد بن عبادہ کی طرف بڑھے ( انہوں نے بیعت نہیں کی ) ایک شخص انصار میں سے کہنے لگا بھائیو ! بیچارے سعد بن عبادہ کا تم نے خون کر ڈالا ۔ میں نے کہا اللہ اس کا خون کرے گا ۔ حضرت عمر رضی اللہ عنہ نے اس خطبے میں یہ بھی فرمایا اس وقت ہم کو حضرت ابوبکر رضی اللہ عنہ کی خلافت سے زیادہ کوئی چیز ضروری معلوم نہیں ہوتی کیونکہ ہم کو ڈر پیدا ہوا کہیں ایسا نہ ہو ہم لوگوں سے جدا رہیں اور ابھی انہوں نے کسی سے بیعت نہ کی ہو وہ کسی اور شخص سے بیعت کربیٹھیں تب دو صورتوں سے خالی نہیں ہوتا یا تو ہم بھی جبراً و قہراً اسی سے بیعت کر لیتے یا لوگوں کی مخالفت کرتے تو آپس میں فساد پیدا ہوتا ( پھوٹ پڑجاتی ) دیکھو پھر یہی کہتا ہوں جو شخص کسی سے بن سوچے سمجھے ، بن صلاح و مشورہ بیعت کر لے تو دوسرے لوگ بیعت کرنے والے کی پیروی نہ کرے ، نہ اس کی جس سے بیعت کی گئی ہے کیونکہ وہ دونوں اپنی جان گنوائیں گے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 159490,
        "last_updated": null
    },
    {
        "urduURN": 4067380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6831,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالعزیز بن سلمہ نے بیان کیا ، کہا ہم کو ابن شہاب نے خبر دی ، انہیں عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے زید بن خالد الجہی نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم ان لوگوں کے بارے میں حکم دے رہے تھے جو غیر شادی شدہ ہوں اور زنا کیا ہو کہ سو کوڑے مارے جائیں اور سال بھر کے لیے جلاوطن کر دیا جائے ۔ \n<span class=urdu_sanad>ابن شہاب نے بیان کیا کہ مجھے عروہ بن زبیر نے خبر دی کہ</span> حضرت عمر بن خطاب رضی اللہ عنہ نے جلاوطن کیا تھا پھر یہی طریقہ قائم ہو گیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 159501,
        "last_updated": null
    },
    {
        "urduURN": 4067400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6833,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایسے شخص کے بارے میں جس نے زنا کیا تھا اور وہ غیرشادی شدہ تھا حد قائم کرنے کے ساتھ ایک سال تک شہر باہر کرنے کا فیصلہ کیا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 159520,
        "last_updated": null
    },
    {
        "urduURN": 4067410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6834,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام دستوائی نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ان مردوں پر لعنت کی ہے جو مخنث بنتے ہیں اور ان عورتوں پر لعنت کی ہے جو مرد بنیں اور آپ نے فرمایا کہ انہیں اپنے گھروں سے نکال دو اور آنحضرت صلی اللہ علیہ وسلم نے فلاں کو گھر سے نکالا تھا اور حضرت عمر رضی اللہ عنہ نے فلاں کو نکالا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 159530,
        "last_updated": null
    },
    {
        "urduURN": 4067420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عاصم بن علی نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے بیان کیا ، ان سے زہری نے ، ان سے عبیداللہ نے اور ان سے حضرت ابوہریرہ اور زید بن خالد رضی اللہ عنہما نے کہ",
        "hadithText": "ایک دیہاتی نبی کریم صلی اللہ علیہ وسلم کے پاس آئے ۔ آنحضرت صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ۔ انہوں نے عرض کیا یا رسول اللہ ! ہمارے درمیان کتاب اللہ کے مطابق فیصلہ کر دیں ۔ اس پر دوسرے نے کھڑے ہو کر کہا کہ انہوں نے صحیح کہا یا رسول اللہ ! ان کا کتاب اللہ کے مطابق فیصلہ کریں ، میرا لڑکا ان کے یہاں مزدور تھا اور پھر اس نے ان کی بیوی کے ساتھ زنا کر لیا ۔ لوگوں نے مجھے بتایا کہ میرے لڑکے کو رجم کیا جائے گا ۔ چنانچہ میں نے سو بکریوں اور ایک کنیز کا فدیہ دیا ۔ پھر میں نے اہل علم سے پوچھا تو ان کا خیال ہے کہ میرے لڑکے پر سو کوڑے اور ایک سال کی جلاوطنی لازمی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں تم دونوں کا فیصلہ کتاب اللہ کے مطابق کروں گا ۔ بکریاں اور کنیز تمہیں واپس ملیں گی اور تمہارے لڑکے کو سو کوڑے اور ایک سال کی جلاوطنی کی سزا ملے گی اور انیس ! صبح اس عورت کے پاس جاؤ ( اور اگر وہ اقرار کرے تو ) اسے رجم کر دو ۔ چنانچہ انہوں نے اسے رجم کیا ۔ ( وہ عورت کہیں اور جگہ تھی آپ نے اسے رجم کرنے کے لیے انیس کو بھیجا اسی سے باب کا مطلب نکلا ۔ قسطلانی نے کہا کہ آپ نے جو انیس کو فریق ثانی کی جورو کے پاس بھیجا وہ زنا کی حد مارنے کے لیے نہیں بھیجا کیونکہ زنا کی حد لگانے کے لیے تجسس کرنا یا ڈھونڈنا بھی درست نہیں ہے اگر کوئی خود آ کر بھی زنا کا اقرار کرے اس کے لیے بھی تفتیش کرنا مستحب ہے یعنی یوں کہنا کہ شاید تو نے بوسہ دیا ہو گا یا مساس کیا ہو گا بلکہ آپ نے انیس کو صرف اس لیے بھیجا کہ اس عورت کو خبرکر دیں کہ فلاں شخص نے تجھ پر زنا کی تہمت لگائی ہے ۔ اب وہ حد قذف کا مطالبہ کرتی ہے یا معاف کرتی ہے ۔ جب انیس اس کے پاس پہنچے تو اس عورت نے صاف طور پر زنا کا اقبال کیا ۔ اس اقبال پر انیس رضی اللہ عنہ نے اس کو حد لگائی اور رجم کیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 159540,
        "last_updated": null
    },
    {
        "urduURN": 4067430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبیداللہ بن عبداللہ نے اور انہیں ابوہریرہ اور زید بن خالد رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے اس کنیز کے متعلق پوچھا گیا جو غیرشادی شدہ ہو اور زنا کرالیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر وہ زنا کرائے تو اسے کوڑے مارو ۔ اگر پھر زنا کرائے تو پھر کوڑے مارو ۔ اگر پھر زنا کرائے تو پھر کوڑے مارو اور اسے بیچ ڈالو خواہ ایک رسی ہی قیمت میں ملے ۔ ابن شہاب نے بیان کیا کہ مجھے یقین نہیں کہ تیسری مرتبہ ( کوڑے لگانے کے حکم ) کے بعد یہ فرمایا یا چوتھی مرتبہ کے بعد ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 159550,
        "last_updated": null
    },
    {
        "urduURN": 4067440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6839,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے سعید مقبری نے ، ان سے ان کے والد نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ اگر کنیز زنا کرائے اور اس کا زنا کھل جائے تو اسے کوڑے مارنے چاہئیں لیکن لعنت ملامت نہ کرنی چاہئے پھر اگر وہ دوبارہ زنا کرے تو پھر چاہئے کہ کوڑے مارے لیکن ملامت نہ کرے پھر اگر تیسری مرتبہ زنا کرائے تو بیچ دے خواہ بالوں کی ایک رسی ہی قیمت پر ہو ۔ اس روایت کی متابعت اسماعیل بن امیہ نے سعید سے کی ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 159560,
        "last_updated": null
    },
    {
        "urduURN": 4067450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6840,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا ہم سے شیبانی نے بیان کیا میں نے حضرت عبداللہ بن ابی اوفی رضی اللہ عنہ سے رجم کے بارے میں پوچھا تو انہوں نے بتلایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے رجم کیا تھا ۔ میں نے پوچھا سورۃ النور سے پہلے یا اس کے بعد ۔ انہوں نے بتلایا کہ مجھے معلوم نہیں ۔ اس روایت کی متابعت علی بن مسہر ، خالد بن عبداللہ المحاربی اور عبیدہ بن حمید نے شیبانی سے کی ہے اور بعض نے ( سورۃ النور کے بجائے ) سورۃ المائدہ کا ذکر کیا ہے لیکن پہلی روایت صحیح ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 159570,
        "last_updated": null
    },
    {
        "urduURN": 4067460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6841,
        "hadithSanad": "ہم سے اسماعیل بن عبداللہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے نافع نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "یہودی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا کہ ان میں سے ایک مرد اور ایک عورت نے زناکاری کی ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے پوچھا کہ تورات میں رجم کے متعلق کیا حکم ہے ؟ انہوں نے کہا کہ ہم انہیں رسواکرتے ہیں اور کوڑے لگاتے ہیں ۔ حضرت عبداللہ سلام رضی اللہ عنہ نے اس پر کہا کہ تم جھوٹے ہو اس میں رجم کا حکم موجود ہے ۔ چنانچہ وہ تورات لائے اور کھولا ۔ لیکن ان کے ایک شخص نے اپنا ہاتھ آیت رجم پر رکھ دیا اور اس سے پہلے اور بعد کا حصہ پڑھ دیا ۔ حضرت عبداللہ بن سلام رضی اللہ عنہ نے اس سے کہا کہ اپنا ہاتھ اٹھاؤ ۔ اس نے اپنا ہاتھ اٹھایا تو اس کے نیچے رجم کی آیت موجود تھی ۔ پھر انہوں نے کہا اے محمد ! آپ نے سچ فرمایا اس میں رجم کی آیت موجود ہے ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے حکم دیا اور دونوں رجم کئے گئے ۔ میں نے دیکھا کہ مرد عورت کو پتھروں سے بچانے کی کوشش میں اس پر جھکا رہا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 159580,
        "last_updated": null
    },
    {
        "urduURN": 4067470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ، انہیں ابن شہاب نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے اور انہیں ابوہریرہ اور زید بن خالد رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "دو آدمی اپنا مقدمہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لائے اور ان میں سے ایک نے کہا کہ ہمارا فیصلہ کتاب اللہ کے مطابق کر دیجئیے اور دوسرے نے جوزیادہ سمجھدار تھے کہا کہ ہاں یا رسول اللہ ! ہمارا فیصلہ کتاب اللہ کے مطابق کر دیجئیے اور مجھے عرض کرنے کی اجازت دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ کہو ۔ انہوں نے کہا کہ میرا بیٹا ان صاحب کے یہاں مزدور تھا ۔ مالک نے بیان کیا کہ عسیف مزدور کو کہتے ہیں اور اس نے ان کی بیوی کے ساتھ زنا کر لیا ۔ لوگوں نے مجھ سے کہا کہ میرے بیٹے کی سزا رجم ہے ۔ چنانچہ میں نے اس کے فدیہ میں سو بکریاں اور ایک لونڈی دے دی پھر جب میں نے علم والوں سے پوچھا تو انہوں نے بتایا کہ میرے لڑکے کی سزا سو کوڑے اور ایک سال کے لیے ملک بدر کرنا ہے ۔ رجم تو صرف اس عورت کو کیا جائے گا اس لیے کہ وہ شادی شدہ ہے ۔ رسول کریم صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ تمہارا فیصلہ کتاب اللہ کے مطابق کروں گا ۔ تمہاری بکریاں اور تمہاری لونڈی تمہیں واپس ہیں پھر ان کے بیٹے کو سو کوڑے لگوائے اور ایک سال کے لیے شہر بدر کیا اور انیس اسلمی رضی اللہ عنہ کو حکم فرمایا اس مذکورہ عورت کے پاس جائیں اگر وہ اقرار کر لے تو اسے رجم کر دیں چنانچہ اس نے اقرار کیا اور وہ رجم کر دی گئی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 159590,
        "last_updated": null
    },
    {
        "urduURN": 4067480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6844,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، انہوں نے کہا مجھ سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن القاسم نے بیان کیا ، ان سے ان کے والد ( قاسم بن محمد ) نے بیان کیا اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ نے کہا تمہاری وجہ سے آنحضرت صلی اللہ علیہ وسلم اور سب لوگوں کو روکنا پڑا جبکہ یہاں پانی بھی نہیں ہے ۔ چنانچہ وہ مجھ پر سخت ناراض ہوئے اور اپنے ہاتھ سے میری کوکھ میں مکا مارنے لگے مگر میں نے اپنے جسم میں کسی قسم کی حرکت اس لیے نہیں ہونے دی کہ آنحضرت صلی اللہ علیہ وسلم آرام فرما رہے تھے ۔ پھر اللہ تعالیٰ نے تیمم کی آیت نازل کی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 159600,
        "last_updated": null
    },
    {
        "urduURN": 4067490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6845,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، انہیں عمرو نے خبر دی ، ان سے عبدالرحمٰن بن قاسم نے بیان کیا ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "ابوبکر رضی اللہ عنہ آئے اور زور سے میرے ایک سخت گھونسا لگایا اور کہا تو نے ایک ہار کے لیے سب لوگوں کو روک دیا ۔ میں اس سے مرنے کے قریب ہو گئی اس قدر مجھ کو درد ہوا لیکن کیا کر سکتی تھی کیونکہ آنحضرت صلی اللہ علیہ وسلم کا سرمبارک میری ران پر تھا ۔ لکز اور وکز کے ایک ہی معنی ہیں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 159610,
        "last_updated": null
    },
    {
        "urduURN": 4067500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6846,
        "hadithSanad": "ہم سے موسیٰ نے بیان کیا ، ان سے ابوعوانہ نے بیان کیا ، کہا ہم سے عبدالملک نے بیان کیا ، ان سے مغیرہ کے کاتب وراد نے ، ان سے مغیرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "سعد بن عبادہ رضی اللہ عنہ نے کہا کہ اگر میں اپنی بیوی کے ساتھ کسی غیرمرد کو دیکھ لوں تو سیدھی تلوار کی دھار سے اسے مارڈالوں ۔ یہ بات نبی کریم صلی اللہ علیہ وسلم تک پہنچی تو آپ نے فرمایا کیا تمہیں سعد کی غیرت پر حیرت ہے ۔ میں ان سے بھی بڑھ کر غیرمند ہوں اور اللہ مجھ سے بھی زیادہ غیرمند ہے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 159620,
        "last_updated": null
    },
    {
        "urduURN": 4067510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6847,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک دیہاتی آیا اور کہا کہ یا رسول اللہ ! میری بیوی نے کالا لڑکا جنا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا ، تمہارے پاس اونٹ ہیں ؟ انہوں نے کہا کہ ہاں ۔ آپ نے پوچھا ان کے رنگ کیسے ہیں ؟ انہوں نے کہا کہ سرخ ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا ان میں کوئی خاکی رنگ کا بھی ہے ؟ انہوں نے کہا کہ ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا پھر یہ کہاں سے آ گیا ؟ انہوں نے کہا میرا خیال ہے کہ کسی رگ نے یہ رنگ کھینچ لیا جس کی وجہ سے ایسا اونٹ پیدا ہوا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر ایسا بھی ممکن ہے کہ تیرے بیٹے کا رنگ بھی کسی رگ نے کھینچ لیا ہو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 159630,
        "last_updated": null
    },
    {
        "urduURN": 4067520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6848,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے یزید بن ابی حبیب نے بیان کیا ، ان سے بکیر بن عبداللہ نے بیان کیا ، ان سے سلیمان بن یسار نے بیان کیا ، ان سے عبدالرحمٰن بن جابر بن عبداللہ نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حدود اللہ میں کسی مقررہ حد کے سوا کسی اور سزا میں دس کوڑے سے زیادہ بطور تعزیر و سزا نہ مارے جائیں ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 159640,
        "last_updated": null
    },
    {
        "urduURN": 4067530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6849,
        "hadithSanad": "ہم سے عمرو بن علی نے بیان کیا ، انہوں نے کہا ہم سے فضیل بن سلیمان نے بیان کیا ، انہوں نے کہا ہم سے مسلم بن ابی مریم نے بیان کیا ، کہا مجھ سے عبدالرحمٰن بن جابر نے ان صحابی سے بیان کیا جنہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا تھا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ تعالیٰ کی حدود میں سے کسی حد کے سوا مجرم کو دس کوڑے سے زیادہ کی سزا نہ دی جائے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 159650,
        "last_updated": null
    },
    {
        "urduURN": 4067540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6850,
        "hadithSanad": "ہم سے یحییٰ بن سلیمان نے بیان کیا ، انہوں نے کہا مجھ سے ابن وہب نے بیان کیا ، انہوں نے کہا مجھ کو عمرو نے خبر دی ، ان سے بکیر نے بیان کیا کہ",
        "hadithText": "میں سلیمان بن یسار کے پاس بیٹھا ہوا تھا کہ عبدالرحمٰن بن جابر آئے اور سلیمان بن یسار سے بیان کیا پھر سلیمان بن یسار ہماری طرف متوجہ ہوئے اور انہوں نے کہا کہ مجھ سے عبدالرحمٰن بن جابر نے بیان کیا ہے کہ ان سے ان کے والد نے بیان کیا اور انہوں نے ابوبردہ انصاری رضی اللہ عنہ سے سنا ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ حدود اللہ میں سے کسی حد کے سوا کسی سزا میں دس کوڑے سے زیادہ کی سزا نہ دو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 159660,
        "last_updated": null
    },
    {
        "urduURN": 4067550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6851,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے وصال ( مسلسل افطار کے بغیر کئی دن کے روزے رکھنے ) سے منع فرمایا تو بعض صحابہ نے عرض کیا یا رسول اللہ ! آپ خود تو وصال کرتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے کون مجھ جیسا ہے ؟ میرا تو حال یہ ہے کہ مجھے میرا رب کھلاتا ہے اور پلاتا ہے لیکن وصال کرنے سے صحابہ نہیں رکے تو آنحضرت صلی اللہ علیہ وسلم نے ان کے ساتھ ایک دن کے بعد دوسرے دن کا وصال کیا پھر اس کے بعد لوگوں نے چاند دیکھ لیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر ( عید کا ) چاند نہ دکھائی دیتا تو میں اور وصال کرتا ۔ یہ آپ نے تنبیہاً فرمایا تھا کیونکہ وہ وصال کرنے پر مصر تھے ۔ اس روایت کی متابعت شعیب ، یحییٰ بن سعید اور یونس نے زہری سے کی ہے اور عبدالرحمٰن بن خالد فہمی نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 159670,
        "last_updated": null
    },
    {
        "urduURN": 4067560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6852,
        "hadithSanad": "مجھ سے عیاش بن الولید نے بیان کیا ، کہا ہم سے عبدالاعلیٰ نے بیان کیا ، کہا ہم سے معمر نے بیان کیا ، ان سے زہری نے ، ان سے حضرت سالم نے ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں اس پر مار پڑتی کہ جب غلہ کے ڈھیر یوں ہی خریدیں ، بن ناپے اور تولے اس کو اسی جگہ دوسرے کے ہاتھ بیچ ڈالیں ہاں وہ غلہ اٹھا کر اپنے ٹھکانے لے جائیں پھر بیچیں تو کچھ سزا نہ ہوتی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 159680,
        "last_updated": null
    },
    {
        "urduURN": 4067570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6853,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہوں نے کہا ہم کو یونس نے خبر دی ، انہیں زہری نے ، انہیں عروہ نے خبر دی اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنے ذاتی معاملہ میں کبھی کسی سے بدلہ نہیں لیا ہاں جب اللہ کی قائم کی ہوئی حد کو توڑا جاتا تو آپ پھر بدلہ لیتے تھے ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 159690,
        "last_updated": null
    },
    {
        "urduURN": 4067580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6854,
        "hadithSanad": "ہم سے علی نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے زہری نے بیان کیا اور ان سے سہل بن سعد رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں نے دو لعان کرنے والے میاں بیوی کو دیکھا تھا ۔ اس وقت میری عمر پندرہ سال تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے دونوں کے درمیان جدائی کرا دی تھی ۔ شوہر نے کہا تھا کہ اگر اب بھی میں ( اپنی بیوی کو ) اپنے ساتھ رکھوں تو اس کا مطلب یہ ہے کہ میں جھوٹا ہوں ۔ سفیان نے بیان کیا کہ میں نے زہری سے یہ روایت محفوظ رکھی ہے کہ ” اگر اس عورت کے ایسا بچہ پیدا ہوا تو شوہر سچا ہے اور اگر اس کے ایسا ایسا بچہ پیدا ہوا جیسے چھپکلی ہوتی ہے تو شوہر جھوٹا ہے “ اور میں نے زہری سے سنا ، انہوں نے بیان کیا کہ اس عورت نے اس آدمی کے ہم شکل بچہ جنا جو میری طرح کا تھا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 159700,
        "last_updated": null
    },
    {
        "urduURN": 4067590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6855,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے قائم بن محمد نے بیان کیا کہ",
        "hadithText": "حضرت ابن عباس رضی اللہ عنہما نے دولعان کرنے والوں کا ذکر کیا تو حضرت عبداللہ بن شداد رضی اللہ عنہما نے کہا کہ یہ وہی تھی جس کے متعلق رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی عورت کو بلاگواہی رجم کر سکتا ( تو اسے ضرور کرتا ) ابن عباس رضی اللہ عنہما نے کہا کہ نہیں یہ وہ عورت تھی جو ( فسق و فجور ) ظاہر کیا کرتی تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 159710,
        "last_updated": null
    },
    {
        "urduURN": 4067600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6856,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن سعید نے بیان کیا ، ان سے عبدالرحمٰن بن قاسم نے بیان کیا ، ان سے قاسم بن محمد نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی مجلس میں لعان کا ذکر آیا تو عاصم بن عدی رضی اللہ عنہ نے اس پر ایک بات کہی پھر وہ واپس آئے ۔ اس کے بعد ان کی قوم کے ایک صاحب یہ شکایت لے کر ان کے پاس آئے کہ انہوں نے اپنی بیوی کے ساتھ غیرمرد کو دیکھا ہے ۔ عاصم رضی اللہ عنہ نے اس پر کہا کہ میں اپنی اس بات کی وجہ سے آزمائش میں ڈالا گیا ہوں ۔ پھر آپ ان صاحب کو لے کر نبی کریم صلی اللہ علیہ وسلم کی مجلس میں تشریف لائے اور آنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع دی جس حالت میں انہوں نے اپنی بیوی کو پایا ۔ وہ صاحب زردرنگ ، کم گوشت ، سیدھے بالوں والے تھے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ ! اس معاملہ کو ظاہر کر دے ۔ چنانچہ اس عورت کے یہاں اسی شخص کی شکل کا بچہ پیدا ہوا جس کے متعلق شوہر نے کہا تھا کہ اسے انہوں نے اپنی بیوی کے ساتھ دیکھا ہے پھر آنحضرت صلی اللہ علیہ وسلم نے دونوں کے درمیان لعان کرایا ۔ ابن عباس رضی اللہ عنہما سے مجلس میں ایک صاحب نے کہا کہ یہ وہی تھا جس کے متعلق آنحضرت صلی اللہ علیہ وسلم نے فرمایا تھا کہ اگر میں کسی کو بلاگواہی کے رجم کر سکتا تو اسے رجم کرتا ۔ ابن عباس رضی اللہ عنہما نے کہا کہ نہیں یہ تو وہ عورت تھی جو اسلام لانے کے بعد برائیاں اعلانیہ کرتی تھی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 159720,
        "last_updated": null
    },
    {
        "urduURN": 4067610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6857,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے سلیمان بن بلال نے بیان کیا ، ان سے ثور بن زید نے بیان کیا ، ان سے ابوالغیث سالم نے بیان کیا ، اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا ، کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سات مہلک گناہوں سے بچو ۔ صحابہ نے عرض کیا یا رسول اللہ ! وہ کیا کیا ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ کے ساتھ شرک کرنا ، جادو کرنا ، ناحق کسی کی جان لینا جو اللہ نے حرام کیا ہے ، سود کھانا ، یتیم کا مال کھانا ، جنگ کے دن پیٹھ پھیرنا اور پاک دامن غافل مومن عورتوں کو تہمت لگانا ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 159730,
        "last_updated": null
    },
    {
        "urduURN": 4067620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6858,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، ان سے فضیل بن غزوان نے ، ان سے عبدالرحمٰن بن ابی نعم نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ میں نے ابوالقاسم صلی اللہ علیہ وسلم سے سنا ، آپ نے فرمایا کہ",
        "hadithText": "جس نے اپنے غلام پر تہمت لگائی حالانکہ غلام اس تہمت سے بری تھا تو قیامت کے دن اسے کوڑے لگائے جائیں گے ، سوا اس کے کہ اس کی بات صحیح ہو ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 159740,
        "last_updated": null
    },
    {
        "urduURN": 4067630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 86,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، ان سے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے بیان کیا ، ان سے ابوہریرہ اور زیر بن خالد الجہنی رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا کہ میں آپ کو اللہ کی قسم دیتا ہوں آپ ہمارے درمیان کتاب اللہ کے مطابق فیصلہ کر دیں ۔ اس پر فریق مخالف کھڑا ہوا ، یہ زیادہ سمجھدار تھا اور کہا کہ انہوں نے سچ کہا ۔ ہمارا فیصلہ کتاب اللہ کے مطابق کیجئے اور یا رسول اللہ ! مجھے ( گفتگو کی ) اجازت دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہئے ۔ انہوں نے کہا کہ میرا لڑکا ان کے یہاں مزدوری کرتا تھا پھر اس نے ان کی بیوی کے ساتھ زنا کر لیا ۔ میں نے اس کے فدیہ میں ایک سو بکریاں اور ایک خادم دیا پھر میں نے اہل علم سے پوچھا تو انہوں نے مجھے بتایا کہ میرے بیٹے کو سو کوڑے اور ایک سال جلاوطنی کی سزا ملنی چاہئے اور اس کی بیوی کو رجم کیا جائے گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ، میں تمہارا فیصلہ کتاب اللہ کے مطابق ہی کروں گا ۔ سو بکریاں اور خادم تمہیں واپس ملیں گے اور تمہارے بیٹے کو سو کوڑے اور ایک سال جلاوطنی کی سزا دی جائے گی اور اے انیس اس عورت کے پاس صبح جانا اور اس سے پوچھنا اگر وہ زنا کا اقرار کر لے تو اسے رجم کرنا ۔ اس عورت نے اقرار کر لیا اور وہ رجم کر دی گئی ۔</b>",
        "bookID": "86.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 159750,
        "last_updated": null
    }
]