[
    {
        "urduURN": 4067640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6861,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے جریر بن عبدالحمید نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے ، ان سے عمرو بن شرجیل نے بیان کیا ، ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ایک صاحب یعنی خود آپ نے کہا یا رسول اللہ ! صلی اللہ علیہ وسلم اللہ کے نزدیک کون سا گناہ سب سے بڑا ہے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ کہ تم اللہ کا کسی کو شریک ٹھہراؤ جبکہ اس نے تمہیں پیدا کیا ہے ۔ پوچھا پھر کون ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر یہ کہ تم اپنے لڑکے کو اس ڈر سے مارڈالو کہ وہ تمہارے ساتھ کھانا کھائے گا ۔ پوچھا پھر کون ؟ فرمایا پھر یہ کہ تم اپنے پڑوسی کی بیوی سے زنا کرو ۔ پھر اللہ تعالیٰ نے اس کی تصدیق میں یہ آیت نازل کی ” اور وہ لوگ جو اللہ کے ساتھ کسی دوسرے معبود کو نہیں پکارتے اور نہ کسی ایسے انسان کی ناحق جان لیتے ہیں جسے اللہ نے حرام کیا اور نہ زنا کرتے ہیں اور جو کوئی ایسا کرے گا “ آخر آیت تک ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 159760,
        "last_updated": null
    },
    {
        "urduURN": 4067650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6862,
        "hadithSanad": "ہم سے علی بن جعد نے بیان کیا ، کہا ہم سے اسحاق بن سعید بن عمرو بن سعد بن العاص رضی اللہ عنہما نے بیان کیا ، ان سے ان کے والد نے اور ان سے ابن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مومن اس وقت تک اپنے دین کے بارے میں برابر کشادہ رہتا ہے ( اسے ہر وقت مغفرت کی امید رہتی ہے ) جب تک ناحق خون نہ کرے جہاں ناحق کیا تو مغفرت کا دروازہ تنگ ہو جاتا ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 159770,
        "last_updated": null
    },
    {
        "urduURN": 4067660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6863,
        "hadithSanad": "مجھ سے احمد بن یعقوب نے بیان کیا ، انہوں نے کہا ہم سے اسحاق نے بیان کیا ، انہوں نے کہا میں نے اپنے والد سے سنا ، وہ حضرت عبداللہ بن عمر رضی اللہ عنہما سے بیان کرتے تھے کہ",
        "hadithText": "ہلاکت کا بھنور جس میں گرنے کے بعد پھر نکلنے کی امید نہیں ہے وہ ناحق خون کرنا ہے ۔ جس کو اللہ تعالیٰ نے حرام کیا ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 159780,
        "last_updated": null
    },
    {
        "urduURN": 4067670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6864,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے اعمش نے ، ان سے ابووائل نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے پہلے ( قیامت کے دن ) لوگوں کے درمیان خون خرابے کے فیصلہ جات کئے جائیں گے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 159790,
        "last_updated": null
    },
    {
        "urduURN": 4067680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6865,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، کہا ہم سے عبداللہ بن مبارک نے بیان کیا ، کہا ہم کو یونس نے خبر دی ، ان سے زہری نے ، کہا مجھ سے عطاء بن یزید نے بیان کیا ، ان سے عبیداللہ بن عدی نے بیان کیا ، ان سے بنی زہرہ کے حلیف مقداد بن عمرو الکندی رضی اللہ عنہ نے بیان کیا",
        "hadithText": "وہ بدر کی لڑائی میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ شریک تھے کہ آپ نے پوچھا یا رسول اللہ ! اگر جنگ کے دوران میری کسی کافر سے مڈبھیڑ ہو جائے اور ہم ایک دوسرے کو قتل کرنے کی کوشش کرنے لگیں پھر وہ میرے ہاتھ پر اپنی تلوار مار کر اسے کاٹ دے اور اس کے بعد کسی درخت کی آڑ لے کر کہے کہ میں اللہ پر ایمان لایا تو کیا میں اسے اس کے اس اقرار کے بعد قتل کر سکتا ہوں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسے قتل نہ کرنا ۔ انہوں نے عرض کیا یا رسول اللہ ! اس نے تو میرا ہاتھ بھی کاٹ ڈالا اور یہ اقرار اس وقت کیا جب اسے یقین ہو گیا کہ اب میں اسے قتل ہی کر دوں گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اسے قتل نہ کرنا کیونکہ اگر تم نے اسے اسلام لانے کے بعد قتل کر دیا تو وہ تمہارے مرتبہ میں ہو گا جو تمہارا اسے قتل کرنے سے پہلے تھا یعنی معصوم معلوم الدم اور تم اس کے مرتبہ میں ہو گے جو اس کا اس کلمہ کے اقرار سے پہلے تھا جو اس نے اب کیا ہے ( یعنی ظالم مباح الدم ) ۔ \n<span class=urdu_sanad>اور حبیب بن ابی عمرہ نے بیان کیا ، ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ</span> نبی کریم صلی اللہ علیہ وسلم نے حضرت مقداد رضی اللہ عنہ سے فرمایا تھا کہ اگر کوئی مسلمان کافروں کے ساتھ رہتا ہو پھر وہ ڈر کے مارے اپنا ایمان چھپاتا ہو ، اگر وہ اپنا ایمان ظاہر کر دے اور تو اس کو مار ڈالے یہ کیوں کر درست ہو گا خود تو بھی تو مکہ میں پہلے اپنا ایمان چھپاتا تھا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 159801,
        "last_updated": null
    },
    {
        "urduURN": 4067700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6867,
        "hadithSanad": "ہم سے قبیصہ نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے اعمش نے ، ان سے عبداللہ ابن مرہ نے ، ان سے مسروق نے اور ان سے حضرت عبداللہ بن مسعود رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو جان ناحق قتل کی جائے اس کے ( گناہ کا ) ایک حصہ آدم علیہ السلام کے پہلے بیٹے ( قابیل پر ) پڑتا ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 159820,
        "last_updated": null
    },
    {
        "urduURN": 4067710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6868,
        "hadithSanad": "ہم سے ابوالولید نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہیں واقد بن عبداللہ نے خبر دی ، انہوں نے کہا مجھ کو میرے والد نے اور انہوں نے عبداللہ بن عمر رضی اللہ عنہما سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میرے بعد کافر نہ بن جانا کہ تم میں سے بعض بعض کی گردن مارنے لگ جاؤ ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 159830,
        "last_updated": null
    },
    {
        "urduURN": 4067720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6869,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے غندر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے علی بن مدرک نے بیان کیا ، انہوں نے کہا کہ میں نے ابوزرعہ بن عمرو بن جریر سے سنا ، ان سے جریر بن عبداللہ بجلی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے حجۃ الوداع کے دن فرمایا ، لوگوں کو خاموش کرا دو ۔ ( پھر فرمایا ) تم میرے بعد کافر نہ بن جانا کہ تم میں سے بعض بعض کی گردن مارنے لگے ۔ اس حدیث کی روایت ابوبکر اور ابن عباس رضی اللہ عنہم نے نبی کریم صلی اللہ علیہ وسلم سے کی ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 159840,
        "last_updated": null
    },
    {
        "urduURN": 4067730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6870,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ، انہوں نے کہا ہم سے محمد بن جعفر نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، ان سے فراس نے ، ان سے شعبی نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کبیرہ گناہ اللہ کے ساتھ کسی کو شریک ٹھہرانا ، والدین کی نافرمانی کرنا یا فرمایا کہ ناحق دوسرے کا مال لینے کے لیے جھوٹی قسم کھانا ہیں ۔ شک شعبہ کو تھا اور معاذ نے بیان کیا ، ان سے شعبہ نے بیان کیا ، کہا کبیرہ گناہ اللہ کے ساتھ کسی کو شریک ٹھہرانا ، کسی کا مال ناحق لینے کے لیے جھوٹی قسم کھانا اور والدین کی نافرمانی کرنا یا کہا کہ کسی کی جان لینا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 159850,
        "last_updated": null
    },
    {
        "urduURN": 4067740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6871,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ، انہوں نے کہا ہم سے عبدالصمد نے بیان کیا ، انہوں نے کہا ہم سے شعبہ نے بیان کیا ، انہوں نے کہا ہم سے عبیداللہ بن ابی بکر رضی اللہ عنہما نے بیان کیا ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا گناہ کبیرہ ۔ اور ہم سے عمرو نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے ابوبکرنے اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا سب سے بڑے گناہ اللہ کے ساتھ کسی کو شریک ٹھہرانا ، کسی کی ناحق جان لینا ، والدین کی نافرمانی کرنا اور جھوٹ بولنا ہیں یا فرمایا کہ جھوٹی گواہی دینا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 159860,
        "last_updated": null
    },
    {
        "urduURN": 4067750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6872,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، کہا ہم سے ہشیم نے بیان کیا ، کہا ہم سے حصین نے بیان کیا ، کہا ہم سے ابوظبیان نے بیان کیا ، کہا کہ میں نے اسامہ بن زید بن حارثہ رضی اللہ عنہما سے سنا ، انہوں نے بیان کرتے ہوئے کہا کہ",
        "hadithText": "ہمیں رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ جہینہ کی ایک شاخ کی طرح ( مہم پر ) بھیجا ۔ بیان کیا کہ پھر ہم نے ان لوگوں کو صبح کے وقت جالیا اور انہیں شکست دے دی ۔ راوی نے بیان کیا کہ میں اور قبیلہ انصار کے ایک صاحب قبیلہ جہینہ کے ایک شخص تک پہنچے اور جب ہم نے اسے گھیرلیا تو اس نے کہا ” لا الہ الا اﷲ “ انصاری صحابی نے تو ( یہ سنتے ہی ) ہاتھ روک لیا لیکن میں نے اپنے نیزے سے اسے قتل کر دیا ۔ راوی نے بیان کیا کہ جب ہم واپس آئے تو اس واقعہ کی خبر نبی کریم صلی اللہ علیہ وسلم کو ملی ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا اسامہ ! کیا تم نے کلمہ لا الہ الا اﷲ کا اقرار کرنے کے بعد اسے قتل کر ڈالا ۔ میں نے عرض کیا یا رسول اللہ ! اس نے صرف جان بچانے کے لیے اس کا اقرار کیا تھا ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا تم نے اسے لا الہ الا اﷲ کا اقرار کرنے کے بعد قتل کر ڈالا ۔ بیان کیا کہ آنحضرت اس جملہ کو اتنی دفعہ دہراتے رہے کہ میرے دل میں یہ خواہش پیدا ہو گئی کہ کاش میں اس سے پہلے مسلمان نہ ہوا ہوتا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 159870,
        "last_updated": null
    },
    {
        "urduURN": 4067760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6873,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، کہا ہم سے یزید نے بیان کیا ، ان سے ابوالخیر نے ، ان سے صنابحی نے اور ان سے عبادہ بن صامت رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں ان نقیبوں میں سے تھا جنہوں نے ( منیٰ میں لیلۃالعقبہ کے موقع پر ) رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی ۔ ہم نے اس کی بیعت ( عہد ) کی تھی کہ ہم اللہ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گے ، ہم چوری نہیں کریں گے ، زنا نہیں کریں گے ، کسی کی ناحق جان نہیں لیں گے جو اللہ نے حرام کی ہے ، ہم لوٹ مار نہیں کریں گے اور آپ صلی اللہ علیہ وسلم کی نافرمانی نہیں کریں گے اور یہ کہ اگر ہم نے اس پر عمل کیا تو ہمیں جنت ملے گی اور اگر ہم نے ان میں سے کسی طرح کا گناہ کیا تو اس کا فیصلہ اللہ تبارک و تعالیٰ کے یہاں ہو گا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 159880,
        "last_updated": null
    },
    {
        "urduURN": 4067770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6874,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے جویریہ نے بیان کیا ، ان سے نافع نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے ہم پر ہتھیار اٹھایا وہ ہم میں سے نہیں ہے ۔ حضرت ابوموسیٰ رضی اللہ عنہ نے بھی نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث روایت کی ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 159890,
        "last_updated": null
    },
    {
        "urduURN": 4067780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6875,
        "hadithSanad": "ہم سے عبدالرحمٰن بن المبارک نے بیان کیا ، کہا ہم سے حماد بن زید نے ، کہا ہم سے ایوب اور یونس نے ، ان سے امام حسن بصری نے ، ان سے احنف بن قیس نے کہ",
        "hadithText": "میں ان صاحب ( علی بن ابی طالب رضی اللہ عنہ ) کی جنگ جمل میں مدد کے لیے تیار تھا کہ ابوبکرہ رضی اللہ عنہ سے میری ملاقات ہوئی ۔ انہوں نے پوچھا ، کہا کا ارادہ ہے ؟ میں نے کہا کہ ان صاحب کی مدد کے لیے جانا چاہتا ہوں ۔ انہوں نے فرمایا کہ واپس چلے جاؤ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آنحضرت صلی اللہ علیہ وسلم فرماتے تھے کہ جب دو مسلمان تلوار کھینچ کر ایک دوسرے سے بھڑ جائیں تو قاتل اور مقتول دونوں دوزخ میں جاتے ہیں ۔ میں نے عرض کیا یا رسول اللہ ! ایک تو قاتل تھا لیکن مقتول کو سزا کیوں ملے گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا وہ بھی اپنے قاتل کے قتل پر آمادہ تھا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 159900,
        "last_updated": null
    },
    {
        "urduURN": 4067790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6876,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ایک یہودی نے ایک لڑکی کا سردوپتھروں کے درمیان رکھ کر کچل دیا پھر اس لڑکی سے پوچھا گیا کہ یہ کس نے کیا ہے ؟ فلاں نے ، فلاں نے ؟ آخر جب اس یہودی کا نام لیاگیا ( تولڑکی نے سر کے اشارہ سے ہاں کہا ) پھر یہودی کو نبی کریم صلی اللہ علیہ وسلم کے یہاں لایا گیا اور اس سے پوچھ گچھ کی جاتی رہی یہاں تک کہ اس نے جرم کا اقرار کر لیا چنانچہ کا سر بھی پتھروں سے کچلاگیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 159910,
        "last_updated": null
    },
    {
        "urduURN": 4067800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6877,
        "hadithSanad": "ہم سے محمد نے بیان کیا ، کہا ہم کو عبداللہ بن ادریس نے خبر دی ، انہیں شعبہ نے ، انہیں ہشام بن زید بن انس نے ، ان سے ان کے دادا انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مدینہ منورہ میں ایک لڑکی چاندی کے زیور پہنے باہرنکلی ۔ راوی نے بیان کیا کہ پھر اسے ایک یہودی نے پتھر سے ماردیا ۔ جب اسے نبی کریم صلی اللہ علیہ وسلم کے پاس لایا گیا تو ابھی اس میں جان باقی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا تمہیں فلاں نے مارا ہے ؟ اس پر لڑکی نے اپنا سر ( انکار کے لیے ) اٹھایا پھر آنحضرت صلی اللہ علیہ وسلم نے پوچھا تمہیں فلاں نے مارا ہے ؟ لڑکی نے اس پر بھی اٹھایا ۔ تیسری مرتبہ آنحضرت صلی اللہ علیہ وسلم نے پوچھا فلاں نے تمہیں مارا ہے ؟ اس پر لڑکی نے اپنا سر نیچے کی طرف جھکالیا ( اقرار کرتے ہوئے جھکالیا ) چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اس شخص کو بلایا تب آپ صلی اللہ علیہ وسلم نے دو پتھروں سے کچل کر اسے قتل کرایا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 159920,
        "last_updated": null
    },
    {
        "urduURN": 4067810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6878,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا ہم سے میرے والد نے بیان کیا ، انہوں نے کہا ہم سے اعمش نے بیان کیا ، ان سے عبداللہ بن مرہ نے بیان کیا ، ان سے مسروق نے بیان کیا اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کسی مسلمان کا خون جو کلمہ لا الہٰ الا اللہ محمد رسول اللہ کا ماننے والا ہو حلال نہیں ہے البتہ تین صورتوں میں جائز ہے ۔ جان کے بدلہ جان لینے والا ، شادی شدہ ہو کر زنا کرنے والا اور اسلام سے نکل جانے والا ( مرتد ) جماعت کو چھوڑ دینے والا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 159930,
        "last_updated": null
    },
    {
        "urduURN": 4067820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6879,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن جعفر نے بیان کیا ، ان سے شعبہ نے بیان کیا ، ان سے ہشام بن زید اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک یہودی نے ایک لڑکی کو اس کے چاندی کے زیور کے لالچ میں مارڈالا تھا ۔ اس نے لڑکی کو پتھر سے مارا پھر لڑکی نبی کریم صلی اللہ علیہ وسلم کے پاس لائی گئی تو اس کے جسم میں جان باقی تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کیا تمہیں فلاں نے مارا ہے ؟ اس نے سر کے اشارہ سے انکار کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے دوبارہ پوچھا ، کیا تمہیں فلاں نے مارا ہے ؟ اس مرتبہ بھی اس نے سر کے اشارے سے انکار کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے جب تیسری مرتبہ پوچھا تو اس نے سر کے اشارہ سے اقرار کیا ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے یہودی کو دوپتھروں میں کچل کر قتل کر دیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 159940,
        "last_updated": null
    },
    {
        "urduURN": 4067830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6880,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے شیبان نحوی نے ، ان سے یحییٰ نے ، ان سے ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ خزاعہ کے لوگوں نے ایک آدمی کو قتل کر دیا تھا ۔ اور عبداللہ بن رجاء نے کہا ، ان سے حرب بن شداد نے ، ان سے یحییٰ بن ابی کثیر نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ فتح مکہ کے موقع پر قبیلہ خزاعہ نے بنی لیث کے ایک شخص ( ابن اثوع ) کو اپنے جاہلیت کے مقتول کے بدلہ میں قتل کر دیا تھا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوے اور فرمایا اللہ تعالیٰ نے مکہ مکرمہ سے ہاتھیوں کے ( شاہ یمن ابرہہ کے ) لشکر کو روک دیا تھا لیکن اس نے اپنے رسول اور مومنوں کو اس پر غلبہ دیا ۔ ہاں یہ مجھ سے پہلے کسی کے لیے حلال نہیں ہوا تھا اور نہ میرے بعد کسی کے لیے حلال ہو گا اور میرے لیے بھی دن کو صرف ایک ساعت کے لیے ۔ اب اس وقت سے اس کی حرمت پھر قائم ہو گئی ۔ ( سن لو ) اس کا کانٹانہ اکھاڑا جائے ، اس کا درخت نہ تراشا جائے اور سوا اس کے جو اعلان کرنے کا ارادہ رکھتا ہے کوئی بھی یہاں کی گری ہوئی چیز نہ اٹھائے اور دیکھو جس کا کوئی عزیز قتل کر دیا جائے تو اسے دو باتوں میں اختیار ہے یا اسے اس کا خون بہادیا جائے یا قصاص دیا جائے ۔ یہ وعظ سن کر اس پر ایک یمنی صاحب ابوشاہ نامی کھڑے ہوئے اور کہا یا رسول اللہ ! اس وعظ کو میرے لیے لکھوادیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا یہ وعظ ابوشاہ کے لیے لکھ دو ۔ اس کے بعد قریش کے ایک صاحب عباس رضی اللہ عنہ کھڑے ہوئے اور کہا یا رسول اللہ اذخر گھاس کی اجازت فرما دیجئیے کیونکہ ہم اسے اپنے گھروں میں اور اپنی قبروں میں بچھاتے ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے اذخر گھاس اکھاڑنے کی اجازت دے دی ۔ اور اس روایت کی متابعت عبیداللہ نے شیبان کے واسطہ سے ہاتھوں کے واقعہ کے ذکر کے سلسلہ میں کی ۔ بعض نے ابونعیم کے حوالہ سے ” القتل “ کا لفظ روایت کا ہے اور عبیداللہ نے بیان کیا کہ یا مقتول کے گھر والوں کو قصاص دیا جائے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 159950,
        "last_updated": null
    },
    {
        "urduURN": 4067840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6881,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے سفیان بن عیینہ نے بیان کیا ، ان سے عمرو بن دینار نے بیان کیا ، ان سے مجاہد بن جبیر نے بیان کیا ، اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "بنی اسرائیل میں صرف قصاص کا رواج تھا ، دیت کی صورت نہیں تھی ۔ پھر اس امت کے لیے یہ حکم نازل ہوا کہ کتب علیکم القصاص فی القتلیٰ الخ ، ( سورۃ البقرہ ) ابن عباس نے کہا فمن عفی لہ سے یہی مراد ہے کہ مقتول کے وارث قتل عمد میں دیت پر راضی ہو جائیں اور اتباع بالمعروف سے یہ مراد ہے کہ مقتول کے وارث دستور کے موافق قاتل سے دیت کا تقاضا کرتے وآداء الیہ باحسان سے یہ مراد ہے کہ قاتل اچھی طرح خوش دلی سے دیت ادا کرے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 159960,
        "last_updated": null
    },
    {
        "urduURN": 4067850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6882,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں عبداللہ بن ابی حسین نے ، ان سے نافع بن جبیر نے بیان کیا اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "اللہ تعالیٰ کے نزدیک لوگوں ( مسلمانوں ) میں سب سے زیادہ مبغوض تین طرح کے لوگ ہیں ۔ حرم میں زیادتی کرنے والا ، دوسرا جو اسلام میں جاہلیت کی رسموں پر چلنے کا خواہشمند ہو ، تیسرے وہ شخص جو کسی آدمی کا ناحق خون کرنے کے لیے اس کے پیچھے لگے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 159970,
        "last_updated": null
    },
    {
        "urduURN": 4067860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6883,
        "hadithSanad": "ہم سے فروہ بن ابی المغراء نے بیان کیا ، کہا ہم سے علی بن مسہر نے بیان کیا ، ان سے ہشام بن عروہ نے ، ان سے ان کے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "مشرکین نے احد کی لڑائی میں پہلے شکست کھائی تھی ( دوسری سند ) امام بخاری نے کہا مجھ سے محمد بن حرب نے بیان کیا ، ان سے ابومروان یحییٰ ابن ابی زکریا نے بیان کیا ، ان سے ہشام نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ ابلیس احد کی لڑائی میں لوگوں میں چیخا ۔ اے اللہ کے بندو ! اپنے پیچھے والوں سے ، مگر یہ سنتے ہی آگے کے مسلمان پیچھے کی طرف پلٹ پڑے یہاں تک کہ مسلمانوں نے ( غلطی میں ) حذیفہ کے والد حضرت یمان رضی اللہ عنہ کو قتل کر دیا ۔ اس پر حذیفہ رضی اللہ عنہ نے کہا کہ یہ میرے والد ہیں ، میرے والد ! لیکن انہیں قتل ہی کر ڈالا ۔ پھر حذیفہ رضی اللہ عنہ نے کہا اللہ تمہاری مغفرت کرے ۔ بیان کیا کہ مشرکین میں کی ایک جماعت میدان سے بھاگ کر طائف تک پہنچ گئی تھی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 159980,
        "last_updated": null
    },
    {
        "urduURN": 4067870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6884,
        "hadithSanad": "مجھ سے اسحاق نے بیان کیا ، کہا ہم کو حبان بن ہلال نے خبر دی ، کہا ہم سے ہمام بن یحییٰ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک یہودی نے ایک لڑکی کا سردوپتھروں کے درمیان میں لے کر کچل دیا تھا ۔ اس لڑکی سے پوچھا گیا کہ یہ تمہارے ساتھ کس نے کیا ؟ کیا فلاں نے کیا ہے ؟ کیا فلاں نے کیا ہے ؟ آخر جب اس یہودی کا نام لیاگیا تو اس نے اپنے سر کے اشارے سے ( ہاں ) کہا پھر یہودی لایا گیا اور اس نے اقرار کر لیا چنانچہ نبی کریم صلی اللہ علیہ وسلم کے حکم سے اس کا بھی سر پتھر سے کچل دیا گیا ۔ ہمام نے دو پتھروں کا ذکر کیا ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 159990,
        "last_updated": null
    },
    {
        "urduURN": 4067880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6885,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یزید بن زریع نے بیان کیا ، کہا ہم سے سعید نے بیان کیا ، ان سے قتادہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ایک یہودی کو ایک لڑکی کے بدلہ میں قتل کرا دیا تھا ۔ یہودی نے اس لڑکی کو چاندی کے زیورات کے لالچ میں قتل کر دیا تھا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 160000,
        "last_updated": null
    },
    {
        "urduURN": 4067890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6886,
        "hadithSanad": "ہم سے عمر بن علی فلاس نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ، کہا ہم سے سفیان ثوری نے بیان کیا ، ان سے موسیٰ بن ابی عائشہ نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے منہ میں ( مرض الوفات کے موقع پر ) آپ کی مرضی کے خلاف ہم نے دوا ڈالی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے حلق میں دوا نہ ڈالو لیکن ہم نے سمجھا کہ مریض ہونے کی وجہ سے دوا پینے سے نفرت کر رہے ہیں لیکن جب آپ کو ہوش ہوا تو فرمایا کہ تم جتنے لوگ گھر میں ہو سب کے حلق میں زبردستی دوا ڈالی جائے سوا حضرت عباس رضی اللہ عنہ کے کہ وہ اس وقت موجود نہیں تھے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 160010,
        "last_updated": null
    },
    {
        "urduURN": 4067900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6887,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، کہا ہم سے ابوالزناد نے بیان کیا ، ان سے اعرج نے بیان کیا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، بیان کیا کہ",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہم آخری امت ہیں لیکن ( قیامت کے دن ) سب سے آگے رہنے والے ہیں ۔ \n<span class=urdu_sanad>اور اسی اسناد کے ساتھ</span> ( روایت ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ) اگر کوئی شخص تیرے گھر میں ( کسی سوراخ یا جنگلے وغیرہ سے ) تم سے اجازت لیے بغیر جھانک رہا ہو اور تم اسے کنکری مارو جس سے اس کی آنکھ پھوٹ جائے تو تم پر کوئی سزا نہیں ہے ۔ نہ گناہ ہو گا نہ دنیا کی کوئی سزا لاگو ہو گی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 160021,
        "last_updated": null
    },
    {
        "urduURN": 4067920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6889,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے حمید نے کہ",
        "hadithText": "ایک صاحب نبی کریم صلی اللہ علیہ وسلم کے گھر میں جھانک رہے تھے تو آنحضرت صلی اللہ علیہ وسلم نے ان کی طرف تیر کا پھل بڑھایا تھا ۔ میں نے پوچھا کہ یہ حدیث تم سے کس نے بیان کی ہے ؟ تو انہوں نے بیان کیا حضرت انس بن مالک رضی اللہ عنہ نے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 160040,
        "last_updated": null
    },
    {
        "urduURN": 4067930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6890,
        "hadithSanad": "مجھ سے اسحاق بن منصور نے بیان کیا ، کہا ہم کو ابواسامہ نے خبر دی ، انہیں ہشام نے خبر دی ، کہا ہم کو ہمارے والد نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "احد کی لڑائی میں مشرکین کو پہلے شکست ہو گئی تھی لیکن ابلیس نے چلا کر کہا اے اللہ کے بندو ! پیچھے کی طرف والوں سے بچو ! چنانچہ آگے کے لوگ پلٹ پڑے اور آگے والے پیچھے والوں سے ( جو مسلمان ہی تھے ) بھڑ گئے ۔ اچانک حذیفہ رضی اللہ عنہ نے دیکھا تو ان کے والد یمان رضی اللہ عنہ تھے ۔ حذیفہ رضی اللہ عنہ نے کہا اللہ کے بندو ! یہ تو میرے والد ہیں ، میرے والد ۔ بیان کیا کہ اللہ کی قسم مسلمان انہیں قتل کر کے ہی ہٹے ۔ اس پر حذیفہ رضی اللہ عنہ نے کہا اللہ تمہاری مغفرت کرے ۔ عروہ نے بیان کیا کہ اس واقعہ کا صدمہ حضرت حذیفہ رضی اللہ عنہ کو آخر وقت تک رہا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 160050,
        "last_updated": null
    },
    {
        "urduURN": 4067940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6891,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، کہا ہم سے یزید بن ابی عبید نے ، اور ان سے سلمہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ خیبر کی طرف نکلے ۔ جماعت کے ایک صاحب نے کہا عامر ! ہمیں اپنی حدی سنائیے ۔ انہوں نے حدی خوانی شروع کی تو نبی کریم صلی اللہ علیہ وسلم نے پوچھا کہ کون صاحب گاگاکر اونٹوں کو ہانک رہے ہیں ؟ لوگوں نے کہا کہ عامر ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اللہ ان پر رحم کرے ۔ صحابہ نے عرض کیا یا رسول اللہ ! آپ نے ہمیں عامر سے فائدہ کیوں نہیں اٹھانے دیا ۔ چنانچہ عامر رضی اللہ عنہ اسی رات کو اپنی ہی تلوار سے شہید ہو گئے ۔ لوگوں نے کہا کہ ان کے اعمال برباد ہو گئے ، انہوں نے خودکشی کر لی ( کیونکہ ایک یہودی پر حملہ کرتے وقت خود اپنی تلوار سے زخمی ہو گئے تھے ) جب میں واپس آیا اور میں نے دیکھا کہ لوگ آپس میں کہہ رہے ہیں کہ عامر کے اعمال برباد ہو گئے تو میں آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا اے اللہ کے نبی ! آپ پر میرے باپ اور ماں فدا ہوں ، یہ لوگ کہتے ہیں کہ عامر کے سارے اعمال برباد ہوئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو شخص یہ کہتا ہے غلط کہتا ہے ۔ عامر کو دوہرا اجر ملے گا وہ ( اللہ کے راستہ میں ) مشقت اٹھانے والے اور جہاد کرنے والے تھے اور کس قتل کا اجر اس سے بڑھ کر ہو گا ؟</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 160060,
        "last_updated": null
    },
    {
        "urduURN": 4067950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6892,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے قتادہ نے بیان کیا کہ میں نے زرارہ بن ابی اوفی سے سنا ، ان سے عمران بن حصین رضی اللہ عنہما نے کہ",
        "hadithText": "ایک شخص نے ایک شخص کے ہاتھ میں دانت سے کاٹا تو اس نے اپنا ہاتھ کاٹنے والے کے منہ میں سے کھینچ لیا جس سے اس کے آگے کے دو دانت ٹوٹ گئے پھر دونوں اپنا جھگڑا نبی کریم صلی اللہ علیہ وسلم کے پاس لائے توآنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنے ہی بھائی کو اس طرح دانت سے کاٹتے ہو جیسے اونٹ کاٹتا ہے تمہیں دیت نہیں ملے گی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 160070,
        "last_updated": null
    },
    {
        "urduURN": 4067960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6893,
        "hadithSanad": "ہم سے ابوعاصم نے بیان کیا ، ان سے ابن جریج نے ، ان سے عطاء نے ، ان سے صفوان بن یعلیٰ نے اور ان سے ان کے والد نے کہ",
        "hadithText": "میں ایک غزوہ میں باہر تھا اور ایک شخص نے دانت سے کاٹ لیا تھا جس کی وجہ سے اس کے آگے کے دانٹ ٹوٹ گئے تھے پھر رسول اللہ صلی اللہ علیہ وسلم نے اس مقدمہ کو باطل قرار دے کر اس کی دیت نہیں دلائی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 160080,
        "last_updated": null
    },
    {
        "urduURN": 4067970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6894,
        "hadithSanad": "ہم سے محمد بن عبداللہ انصاری نے بیان کیا ، کہا ہم سے حمید طویل نے بیان کیا ، ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نضرت کی بیٹی نے ایک لڑکی کو طمانچہ مارا تھا اور اس کے دانت ٹوٹ گئے تھے ۔ لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس مقدمہ لائے تو آنحضرت صلی اللہ علیہ وسلم نے قصاص کا حکم دیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 160090,
        "last_updated": null
    },
    {
        "urduURN": 4067980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6895,
        "hadithSanad": "ہم سے آدم نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا یہ اور یہ برابر یعنی چھنگلیا اور انگوٹھا دیت میں برابر ہیں ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 160100,
        "last_updated": null
    },
    {
        "urduURN": 4067990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6896,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے ابن ابی عدی نے بیان کیا ، ان سے شعبہ نے ان سے قتادہ نے ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے اسی طرح سنا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 160110,
        "last_updated": null
    },
    {
        "urduURN": 4068000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "اور مجھ سے ابن بشار نے بیان کیا ، ان سے یحییٰ نے ، ان سے عبیداللہ نے ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "ایک لڑکے اصیل نامی کو دھوکے سے قتل کر دیا گیا تھا ۔ عمر رضی اللہ عنہ نے کہا کہ سارے اہل صنعاء ( یمن کے لوگ ) اس کے قتل میں شریک ہوتے تو میں سب کو قتل کرا دیتا ۔ اور مغیرہ بن حکیم نے اپنے والد سے بیان کیا کہ چار آدمیوں نے ایک بچے کو قتل کر دیا تھا تو عمر رضی اللہ عنہ نے یہ بات فرمائی تھی ۔ ابوبکر ، ابن زبیر ، علی اور سوید بن مقرن رضی اللہ عنہما نے چانٹے کا بدلہ دلوایا تھا اور عمر رضی اللہ عنہ نے درے کی جو مار ایک شخص کو ہوئی تھی اس کا بدلہ لینے کے لیے فرمایا اور علی رضی اللہ عنہ نے تین کوڑوں کا قصاص لینے کا حکم دیا اور شریح نے کوڑے اور خراش لگانے کی سزا دی تھی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 160120,
        "last_updated": null
    },
    {
        "urduURN": 4068010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6897,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ہم سے یحییٰ نے ، ان سے سفیان نے ، ان سے موسیٰ بن ابی عائشہ نے بیان کیا ، ان سے عبیداللہ بن عبداللہ نے کہ",
        "hadithText": "عائشہ رضی اللہ عنہا نے کہا ، ہم نے نبی کریم صلی اللہ علیہ وسلم کے مرض میں آپ کے منہ میں زبردستی دوا ڈالی ۔ حالانکہ آنحضرت صلی اللہ علیہ وسلم اشارہ کرتے رہے کہ دوا نہ ڈالی جائے لیکن ہم نے سمجھا کہ مریض کو دوا سے جو نفرت ہوتی ہے ( اس کی وجہ سے آنحضرت صلی اللہ علیہ وسلم فرما رہے ہیں ) پھر جب آپ کو افاقہ ہوا تو فرمایا ۔ میں نے تمہیں نہیں کہا تھا کہ دوا نہ ڈالو ۔ بیان کیا کہ ہم نے عرض کیا کہ آپ نے دوا سے ناگواری کی وجہ سے ایسا کیا ہو گا ؟ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے ہر ایک کے منہ میں دوا ڈالی جائے اور میں دیکھتا رہوں گا سوائے عباس کے کیونکہ وہ اس وقت وہاں موجود ہی نہ تھے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 160130,
        "last_updated": null
    },
    {
        "urduURN": 4068020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6898,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سعید بن عبید نے بیان کیا ، ان سے بشیر بن یسارنے ، وہ کہتے تھے کہ قبیلہ انصار کے ایک صاحب سہل بن ابی حثمہ نے انہیں خبر دی کہ",
        "hadithText": "ان کی قوم کے کچھ لوگ خیبر گئے اور ( اپنے اپنے کاموں کے لیے ) مختلف جگہوں میں الگ الگ گئے پھر اپنے میں کے ایک شخص کو مقتول پایا ۔ جنہیں وہ مقتول ملے تھے ، ان سے ان لوگوں نے کہا کہ ہمارے ساتھی کو تم نے قتل کیا ہے ۔ انہوں نے کہا کہ نہ ہم نے قتل کیا اور نہ ہمیں قاتل کا پتہ معلوم ہے ؟ پھر یہ لوگ نبی کریم صلی اللہ علیہ وسلم کے پاس گئے اور کہا یا رسول اللہ ! ہم خیبر گئے اور پھر ہم نے وہاں اپنے ایک ساتھی کو مقتول پایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم میں جو بڑا ہے وہ بات کرے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ قاتل کے خلاف گواہی لاؤ ۔ انہوں نے کہا کہ ہمارے پاس کوئی گواہی نہیں ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر یہ ( یہودی ) قسم کھائیں گے ( اور ان کی قسم پر فیصلہ ہو گا ) انہوں نے کہا کہ یہودیوں کی قسموں کا کوئی اعتبار نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے پسند نہیں فرمایا کہ مقتول کا خون رائیگاں جائے چنانچہ آپ نے صدقہ کے اونٹوں میں سے سو اونٹ ( خود ہی ) دیت میں دیئے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 160140,
        "last_updated": null
    },
    {
        "urduURN": 4068030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6899,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے ابوبشر اسماعیل بن ابراہیم الاسدی نے بیان کیا ، کہا ہم سے حجاج بن ابی عثمان نے بیان کیا ، ان سے آل ابوقلابہ کے غلام ابورجاء نے بیان کیا اس نے کہا کہ مجھ سے ابوقلابہ نے بیان کیا کہ",
        "hadithText": "عمر بن عبدالعزیز نے ایک دن دربار عام کیا اور سب کو اجازت دی ۔ لوگ داخل ہوئے تو انہوں نے پوچھا قسامہ کے بارے میں تمہارا کیا خیال ہے ؟ کسی نے کہا کہ قسامہ کے ذریعہ قصاص لینا حق ہے اور خلفاء نے اس کے ذریعہ قصاص لیا ہے ۔ اس پر انہوں نے مجھ سے پوچھا ابوقلابہ تمہاری کیا رائے ہے ؟ اور مجھے عوام کے ساتھ لا کھڑا کر دیا ۔ میں نے عرض کیا امیرالمؤمنین ! آپ کے پاس عرب کے سردار اور شریف لوگ رہتے ہیں آپ کی کیا رائے ہو گی اگر ان میں سے پچاس آدمی کسی دمشقی کے شادی شدہ شخص کے بارے میں زنا کی گواہی دیں جبکہ ان لوگوں نے اس شخص کو دیکھا بھی نہ ہو کیا آپ ان کی گواہی پر اس شخص کو رجم کر دیں گے ۔ امیرالمؤمنین نے فرمایا کہ نہیں ۔ پھر میں نے کہا کہ آپ کا کیا خیال ہے اگر انہیں ( اشراف عرب ) میں سے پچاس افراد حمص کے کسی شخص کے متعلق چوری کی گواہی دے دیں اس کو بغیر دیکھے تو کیا آپ اس کا ہاتھ کاٹ دیں گے ؟ فرمایا کہ نہیں ۔ پھر میں نے کہا ، پس خدا کی قسم کہ رسول اللہ صلی اللہ علیہ وسلم نے کبھی کسی کو تین حالتوں کے سوا قتل نہیں کرایا ۔ ایک وہ شخص جس نے کسی کو ظلماً قتل کیا ہو اور اس کے بدلے میں قتل کیا گیا ہو ۔ دوسرا وہ شخص جس نے شادی کے بعد زنا کیا ہو ۔ تیسرا وہ شخص جس نے اللہ اور اس کے رسول سے جنگ کی ہو اور اسلام سے پھر گیا ہو ۔ لوگوں نے اس پر کہا ، کیا انس بن مالک رضی اللہ عنہ نے یہ حدیث نہیں بیان کی ہے کہ نبی کریم صلی اللہ علیہ وسلم نے چوری کے معاملہ میں ہاتھ پیر کاٹ دئیے تھے اور آنکھوں میں سلائی پھروائی تھی اور پھر انہیں دھوپ میں ڈلوا دیا تھا ۔ میں نے کہا کہ میں آپ لوگوں کو حضرت انس بن مالک رضی اللہ عنہ کی حدیث سناتا ہوں ۔ مجھ سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ قبیلہ عکل کے آٹھ افراد آنحضرت صلی اللہ علیہ وسلم کے پاس آئے اور آپ سے اسلام پر بیعت کی ، پھر مدینہ منورہ کی آب و ہوا انہیں ناموافق ہوئی اور وہ بیمار پڑ گئے تو انہوں نے آنحضرت صلی اللہ علیہ وسلم سے اس کی شکایت کی ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ پھر کیوں نہیں تم ہمارے چرواہے کے ساتھ اس کے اونٹوں میں چلے جاتے اور اونٹوں کا دودھ اور ان کا پیشاب پیتے ۔ انہوں نے عرض کیا کیوں نہیں ۔ چنانچہ وہ نکل گئے اور اونٹوں کا دودھ اور پیشاب پیا اور صحت مند ہو گئے ۔ پھر انہوں نے آنحضرت صلی اللہ علیہ وسلم کے چرواہ کو قتل کر دیا اور ہنکا لے گئے ۔ اس کی اطلاع جب آنحضرت صلی اللہ علیہ وسلم کو پہنچی تو آپ نے ان کی تلاش میں آدمی بھیجے ، پھر وہ پکڑے گئے اور لائے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے حکم دیا اور ان کے بھی ہاتھ اور پاؤں کاٹ دئیے گئے اور ان کی آنکھوں میں سلائی پھیر دی گئی پھر انہیں دھوپ میں ڈلوادیا اور آخر وہ مرگئے ۔ میں نے کہا کہ ان کے عمل سے بڑھ کر اور کیا جرم ہو سکتا ہے اسلام سے پھر گئے اور قتل کیا اور چوری کی ۔ عنبہ بن سعید نے کہا میں نے آج جیسی بات کبھی نہیں سنی تھی ۔ میں نے کہا عنبہ ! کیا تم میری حدیث رد کرتے ہو ؟ انہوں نے کہا کہ نہیں آپ نے یہ حدیث واقعہ کے مطابق بیان کر دی ہے ، واللہ اہل شام کے ساتھ اس وقت تک خیروبھلائی رہے گی جب تک یہ شیخ ( ابوقلابہ ) ان میں موجود رہیں گے ۔ میں نے کہا کہ اس قسامہ کے سلسلہ میں آنحضرت صلی اللہ علیہ وسلم کی ایک سنت ہے ۔ انصار کے کچھ لوگ آپ کے پاس آئے اور آنحضرت صلی اللہ علیہ وسلم سے بات کی پھر ان میں سے ایک صاحب ان کے سامنے ہی نکلے ( خیبر کے ارادہ سے ) اور وہاں قتل کردےئے گئے ۔ اس کے بعد دوسرے صحابہ بھی گئے اور دیکھا کہ ان کے ساتھ خون میں تڑپ رہے ہیں ۔ ان لوگوں نے واپس آکرآنحضرت صلی اللہ علیہ وسلم کو اس کی اطلاع دی اور کہا یا رسول اللہ ! ہمارے ساتھ گفتگو کر رہے اور اچانک وہ ہمیں ( خیبر میں ) خون میں تڑپتے ملے ۔ پھر آنحضرت صلی اللہ علیہ وسلم نکلے اور پوچھا کہ تمہارا کس پر شبہ ہے کہ انہوں نے ان کو قتل کیا ہے ۔ صحابہ نے کہا کہ ہم سمجھتے ہیں کہ یہودیوں نے ہی قتل کے ہے پھر آپ نے یہودیوں کو بلا بھیجا اور ان سے پوچھا کیا تم نے انہیں قتل کیا ہے ؟ انہوں نے انکار کر دیا تو آپ نے فرمایا کیا تم مان جاؤ گے اگر پچاس یہودی اس کی قسم لیں کہ انہوں نے مقتول کو قتل نہیں کیا ہے ۔ صحابہ نے عرض کیا یہ لوگ ذرا بھی پرواہ نہیں کریں گے کہ ہم سب کو قتل کرنے کے بعد پھر قسم کھالیں ( کہ قتل انہوں نے نہیں کیا ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا تو پھر تم میں سے پچاس آدمی قسم کھالیں اور خون بہا کے مستحق ہو جائیں ۔ صحابہ نے عرض کیا ہم بھی قسم کھانے کے لیے تیار نہیں ہیں ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے انہیں اپنے پاس سے خون بہادیا ( ابوقلابہ نے کہا کہ ) میں نے کہا کہ زمانہ جاہلیت میں قبیلہ ہذیل کے لوگوں نے اپنے ایک آدمی کواپنے میں سے نکال دیا تھا پھر وہ شخص بطحاء میں یمن کے ایک شخص کے گھر رات کو آیا ۔ اتنے میں ان میں سے کوئی شخص بیدار ہو گیا اور اس نے اس پر تلوار سے حملہ کر کے قتل کر دیا ۔ اس کے بعد ہذیل کے لوگ آئے اور انہوں نے یمنی کو ( جس نے قتل کیا تھا ) پکڑا کہ حضرت عمر رضی اللہ عنہ کے پاس لے گئے حج کے زمانہ میں اور کہا کہ اس نے ہمارے آدمی کو قتل کر دیا ہے ۔ یمنی نے کہا کہ انہوں نے اسے اپنی برادری سے نکال دیا تھا ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ اب ہذیل کے پچاس آدمی اس کی قسم کھائیں کہ انہوں نے اسے نکالا نہیں تھا ۔ بیان کیا کہ پھر ان میں سے انچاس آدمیوں نے قسم کھائی پھر انہیں کے قبیلہ کا ایک شخص شام سے آیا تو انہوں نے اس سے بھی مطالبہ کیا کہ وہ قسم کھائے لیکن اس نے اپنی قسم کے بدلہ میں ایک ہزار درہم دے کر اپنا پیچھا قسم سے چھڑالیا ۔ ہذلیوں نے اس کی جگہ ایک دوسرے آدمی کو تیار کر لیا پھر وہ مقتول کے بھائی کے پاس گیا اور اپنا ہاتھ اس کے ہاتھ سے ملایا ۔ انہوں نے بیان کیا کہ پھر ہم پچاس جنہوں نے قسم کھائی تھی روانہ ہوئے ۔ جب مقام نخلہ پر پہنچے تو بارش نے انہیں آیا ۔ سب لوگ پہاڑ کے ایک غار میں گھس گئے اور غار ان پچاسوں کے اوپر گر پڑا ۔ جنہوں نے قسم کھائی تھی اور سب کے سب مرگئے ۔ البتہ دونوں ہاتھ ملانے والے بچ گئے ۔ لیکن ان کے پیچھے سے ایک پتھر لڑھک کر گرا اور اس سے مقتول کے بھائی کی ٹانگ ٹوٹ گئی اس کے بعد وہ ایک سال اور زندہ رہا پھر مر گیا ۔ میں نے کہا کہ عبدالملک بن مروان نے قسامہ پر ایک شخص سے قصاص لی تھی پھر اسے اپنے کئے ہوئے پر ندامت ہوئی اور اس نے ان پچاسوں کے متعلق جنہوں نے قسم کھائی تھی حکم دیا اور ان کے نام رجسٹر سے کاٹ دئیے گئے پھر انہوں نے شام بھیج دیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 160150,
        "last_updated": null
    },
    {
        "urduURN": 4068040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6900,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عبیداللہ بن ابی بکر بن انس نے بیان کیا اور ان سے حضرت انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "ایک آدمی نبی کریم صلی اللہ علیہ وسلم کے ایک حجرہ میں جھانکنے لگے تو آنحضرت صلی اللہ علیہ وسلم تیر کا پھل لے کر اٹھے اور چاہتے تھے کہ غفلت میں اس کو مار دیں ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 160160,
        "last_updated": null
    },
    {
        "urduURN": 4068050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6901,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے بیان کیا اور انہیں سہل بن سعد الساعدی رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "ایک آدمی نبی کریم صلی اللہ علیہ وسلم کے دروازہ کے ایک سوراخ سے اندر جھانکنے لگے ۔ اس وقت آنحضرت صلی اللہ علیہ وسلم کے پاس لوہے کا کنگھا تھا جس سے آپر سرجھاڑ رہے تھے ۔ جب آپ نے اسے دیکھا تو فرمایا کہ اگر مجھے معلوم ہوتا کہ تم میرا انتظار کر رہے ہو تو میں اسے تمہاری آنکھ میں چبھودیتا ۔ پھر آپ نے فرمایا کہ ( گھر کے اندر آنے کا ) اذن لینے کا حکم دیا گیا ہے وہ اسی لیے تو ہے کہ نظر نہ پڑے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 160170,
        "last_updated": null
    },
    {
        "urduURN": 4068060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6902,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے ، ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا اگر کوئی شخص تمہاری اجازت کے بغیر تمہیں ( جب کہ تم گھر کے اندر ہو ) جھانک کر دیکھے اور تم اسے کنکری ماردو جس سے اس کی آنکھ پھوٹ جائے تو تم پر کوئی گناہ نہیں ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 160180,
        "last_updated": null
    },
    {
        "urduURN": 4068070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6903,
        "hadithSanad": "ہم سے صدقہ بن الفضل نے بیان کیا ، کہا ہم کو ابن عیینہ نے خبر دی ، ان سے مطرف نے بیان کیا ، کہا کہ میں نے شعبی سے سنا ، کہا کہ میں نے ابوجحیفہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے حضرت علی رضی اللہ عنہ سے پوچھا ، کیا آپ کے پاس کوئی ایسی چیز بھی ہے جو قرآن مجید میں نہیں ہے اور ایک مرتبہ انہوں نے اس طرح بیان کیا کہ جو لوگوں کے پاس نہیں ہے ۔ اس پر انہوں نے کہا کہ اس ذات کی قسم جس نے دانے سے کونپل کو پھاڑ کر نکالا ہے اور مخلوق کو پیدا کیا ۔ ہمارے پاس قرآن مجید کے سوا اور کچھ نہیں ہے ۔ سوا اس سمجھ کے جو کسی شخص کو اس کی کتاب میں دی جائے اور جو کچھ اس صحیفہ میں ہے ۔ میں نے پوچھا صحیفہ میں کیا ہے ؟ فرمایا خون بہا ( دیت ) سے متعلق احکام اور قیدی کے چھڑانے کا حکم اور یہ کہ کوئی مسلمان کسی کافر کے بدلہ میں قتل نہیں کیا جائے گا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 160190,
        "last_updated": null
    },
    {
        "urduURN": 4068080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6904,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو امام مالک نے خبر دی ۔ ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا کہ اور ہم سے اسماعیل نے بیان کیا ، ان سے امام مالک نے ، ان سے ابن شہاب نے ، ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "قبیلہ ہذیل کی دو عورتوں نے ایک دوسری کو ( پتھر سے ) مارا جس سے ایک کے پیٹ کا بچہ ( جنین ) گر گیا پھر اس میں رسول اللہ صلی اللہ علیہ وسلم نے اسے ایک غلام یا کنیز دینے کا فیصلہ کیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 160200,
        "last_updated": null
    },
    {
        "urduURN": 4068090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6905,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، ان سے ان کے والد نے ، ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے ان سے ایک عورت کے حمل گرادینے کے خون بہا کے سلسلہ میں مشورہ کیا تو حضرت مغیرہ رضی اللہ عنہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے غلام یا کنیز کا اس سلسلے میں فیصلہ کیا تھا ۔ \n<span class=urdu_sanad>پھر حضرت محمد بن مسلمہ رضی اللہ عنہ نے بھی گواہی دی کہ</span> جب آنحضرت صلی اللہ علیہ وسلم نے اس کا فیصلہ کیا تھا تو وہ موجود تھے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 160211,
        "last_updated": null
    },
    {
        "urduURN": 4068110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6907,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ، ان سے ہشام نے ، ان سے ان کے والد نے کہ",
        "hadithText": "حضرت عمر رضی اللہ عنہ نے لوگوں سے قسم دے کر پوچھا کہ کس نے نبی کریم صلی اللہ علیہ وسلم سے حمل گرنے کے سلسلے میں فیصلہ سنا ہے ؟ مغیرہ رضی اللہ عنہ نے کہا کہ میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ہے ، آپ نے اس میں ایک غلام یا کنیز دینے کا فیصلہ کیا تھا ۔ \n<span class=urdu_sanad>عمر رضی اللہ عنہ نے کہا کہ</span> اس پر اپنا کوئی گواہ لاؤ ۔ چنانچہ محمد بن مسلمہ رضی اللہ عنہ نے کہا کہ میں گواہی دیتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم نے یہ فیصلہ کیا تھا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 160231,
        "last_updated": null
    },
    {
        "urduURN": 4068130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "مجھ سے محمد بن عبداللہ نے بیان کیا ، کہا ہم سے محمد بن سابق نے بیان کیا ، کہا ہم سے زائدہ نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے ، انہوں نے مغیرہ بن شعبہ رضی اللہ عنہ سے سنا ، وہ حضرت عمر رضی اللہ عنہ سے بیان کرتے تھے کہ",
        "hadithText": "امیرالمؤمنین نے ان سے عورت کے حمل گرادینے کے ( خون بہا کے سلسلے میں ) ان سے اسی طرح مشورہ کیا تھا آخر تک ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 160250,
        "last_updated": null
    },
    {
        "urduURN": 4068140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6909,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے ابن شہاب نے ، ان سے سعید بن مسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بنی لحیان کی ایک عورت کے جنین ( کے گرنے ) پر ایک غلام یا کنیز کا فیصلہ کیا تھا ۔ پھر وہ عورت جس کے متعلق آنحضرت صلی اللہ علیہ وسلم نے دیت دینے کا فیصلہ کیا تھا اس کا انتقال ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فیصلہ کیا کہ اس کی میراث اس کے لڑکوں اور اس کے شوہر کو ملے گی اور دیت اس کے ددھیال والوں کو دینی ہو گی ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 160260,
        "last_updated": null
    },
    {
        "urduURN": 4068150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6910,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ، کہا ہم سے ابن وہب نے بیان کیا ، کہا ہم سے یونس نے بیان کیا ، ان سے ابن شہاب نے ، ان سے ابن المسیب اور ابوسلمہ بن عبدالرحمٰن نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "بنی ہذیل کی دو عورتیں آپس میں لڑیں اور ایک نے دوسری عورت پر پتھر پھینک مارا جس سے وہ عورت اپنے پیٹ کے بچے ( جنین ) سمیت مرگئی ۔ پھر ( مقتولہ کے رشہ دار ) مقدمہ رسول اللہ صلی اللہ علیہ وسلم کے دربار میں لے گئے ۔ آنحضرت صلی اللہ علیہ وسلم نے فیصلہ کیا کہ پیٹ کے بچے کا خون بہا ایک غلام یا کنیز دینی ہو گی اور عورت کے خون بہا کو قاتل عورت کے عاقلہ ( عورت کے باپ کی طرف سے رشتہ دار عصبہ ) کے ذمہ واجب قرار دیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 160270,
        "last_updated": null
    },
    {
        "urduURN": 4068160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6911,
        "hadithSanad": "مجھ سے عمر بن زرارہ نے بیان کیا ، کہا ہم کو اسماعیل بن ابراہیم نے خبر دی ، انہیں عبدالعزیز نے اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو حضرت طلحہ رضی اللہ عنہ میرا ہاتھ پکڑ کر آنحضرت صلی اللہ علیہ وسلم کے پاس لائے اور کہا یا رسول اللہ ! انس سمجھ دار لڑکا ہے اور یہ آپ کی خدمت کرے گا ۔ حضرت انس رضی اللہ عنہ نے بیان کیا کہ پھر میں نے آنحضرت صلی اللہ علیہ وسلم کی خدمت سفر میں بھی کی اور گھر پر بھی ۔ واللہ آنحضور صلی اللہ علیہ وسلم نے کبھی مجھ سے کسی چیز کے متعلق جو میں نے کر دیا ہو یہ نہیں فرمایا کہ یہ کام تم نے اس طرح کیوں کیا اور نہ کسی ایسی چیز کے متعلق جسے میں نے نہ کیا ہو آپ نے یہ نہیں فرمایا کہ یہ کام تم نے اس طرح کیوں نہیں کیا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 160280,
        "last_updated": null
    },
    {
        "urduURN": 4068170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6912,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انہوں نے کہا ہم سے لیث نے بیان کیا ، انہوں نے کہا ہم سے ابن شہاب نے بیان کیا ، ان سے سعید بن مسیب اور ابوسلمہ بن عبدالرحمٰن نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا چوپائے اگر کسی کو زخمی کر دیں تو ان کا خون بہا نہیں ، کنویں میں گرنے کا کوئی خون بہا نہیں ، کان میں دبنے کا کوئی خون بہا نہیں اور دفینہ میں پانچواں حصہ ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 160290,
        "last_updated": null
    },
    {
        "urduURN": 4068180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6913,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ نے ، انہوں نے محمد بن زیادسے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ،",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ، آپ نے فرمایا بے زبان جانور کسی کو زخمی کرے تو اس کی دیت کچھ نہیں ہے ، اسی طرح کام میں کام کرنے سے کوئی نقصان پہنچے ، اسی طرح کنویں میں کام کرنے سے اور جو کافروں کا مال دفن کیا ہوا ملے اس میں پانچواں حصہ سرکار میں لیا جائے گا ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 160300,
        "last_updated": null
    },
    {
        "urduURN": 4068190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6914,
        "hadithSanad": "ہم سے قیس بن حفص نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے ، کہا ہم سے حسن بن عمرو فقیمی نے ، کہا ہم سے مجاہد نے ، انہوں نے عبداللہ بن عمرو رضی اللہ عنہما سے ،",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے ، آپ نے فرمایا جو شخص ایسی جان کو مارڈاے جس سے عہد کر چکا ہو ( اس کی امان دے چکا ہو ) جیسے ذمی کافر کو تو وہ جنت کی خوشبو بھی نہ سونگھے گا ( چہ جائے کہ اس میں داخل ہو ) حالانکہ بہشت کی خوشبو چالیس برس کی راہ سے معلوم ہوتی ہے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 160310,
        "last_updated": null
    },
    {
        "urduURN": 4068200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6915,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ، کہا ہم سے زہیر بن معاویہ نے ، کہا ہم سے مطرف بن طریف نے ، ان سے عامر شعبی نے بیان کیا ۔ ابوجحیفہ سے روایت کر کے ، کہا میں نے علی رضی اللہ عنہ سے کہا ۔ ( دوسری سند ) امام بخاری نے کہا اور ہم سے صدقہ بن فضل نے ، کہا ہم کو سفیان بن عیینہ نے خبر دی ، کہا ہم سے مطرف بن طریف نے بیان کیا ، کہا میں نے عامر شعبی سے سنا ، وہ بیان کرتے تھے",
        "hadithText": "میں نے ابوجحیفہ سے سنا ، انہوں نے کہا میں نے علی رضی اللہ عنہ سے پوچھا کیا تمہارے پاس اور بھی کچھ آیتیں یا سورتیں ہیں جو اس قرآن میں نہیں ہیں ( یعنی مشہور مصحف میں ) اور کبھی سفیان بن عیینہ نے یوں کہا کہ جو عام لوگوں کے پاس نہیں ہیں ۔ حضرت علی رضی اللہ عنہ نے کہا قسم اس خدا کی جس نے دانہ چیر کر اگایا اور جان کو پیدا کیا ہمارے پاس اس قرآن کے سوا اور کچھ نہیں ہے ۔ البتہ ایک سمجھ ہے جو اللہ تعالیٰ اپنی کتاب کی جس کو چاہتا ہے عنایت فرماتا ہے اور وہ جو اس ورق پہ لکھا ہوا ہے ۔ ابوجحیفہ نے کہا اس ورق پہ کیا لکھا ہے ؟ انہوں نے کہا دیت اور قیدی چھڑانے کے احکام اور یہ مسئلہ کہ مسلمان کافر کے بدلے قتل نہ کیا جائے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 160320,
        "last_updated": null
    },
    {
        "urduURN": 4068210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6916,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، کہا ہم سے سفیان ثوری نے ، انہوں نے عمرو بن یحییٰ سے ، انہوں نے اپنے والد سے ، انہوں نے ابو سعید خدری رضی اللہ عنہ سے ،",
        "hadithText": "انہوں نے آنحضرت صلی اللہ علیہ وسلم سے آپ نے فرمایا دیکھو اور پیغمبروں سے مجھ کو فضیلت مت دو ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 160330,
        "last_updated": null
    },
    {
        "urduURN": 4068220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 87,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6917,
        "hadithSanad": "ہم سے محمد بن یوسف بیکندی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ، انہوں نے عمرو بن یحییٰ مازنی سے انہوں نے اپنے والد ( یحیٰی بن عمارہ ) سے ، انہوں نے ابو سعید خدری رضی اللہ عنہ سے ، انہوں نے کہا",
        "hadithText": "یہود میں سے ایک شخص آنحضرت صلی اللہ علیہ وسلم کے پاس آیا ، اس کو کسی نے طمانچہ لگایا تھا ۔ کہنے لگا اے محمد ! ( صلی اللہ علیہ وسلم ) تمہارے اصحاب میں سے ایک انصاری شخص ( نام نامعلوم ) نے مجھ کو طمانچہ مارا ۔ آپ نے لوگوں سے فرمایا اس کو بلاؤ تو انہوں نے بلایا ( وہ حاضر ہوا ) آپ نے پوچھا تو نے اس کے منہ پر طمانچہ کیوں مارا ۔ وہ کہنے لگا یا رسول اللہ ! ایسا ہوا کہ میں یہودیوں کے پاس سے گزرا ، میں نے سنا یہ یہودی یوں قسم کھا رہا تھا قسم اس پروردگار کی جس نے موسیٰ علیہ السلام کو سارے آدمیوں میں سے چن لیا ۔ میں نے کہا کیا محمد صلی اللہ علیہ وسلم سے بھی وہ افضل ہیں اور اس وقت مجھے غصہ آ گیا ۔ میں نے ایک طمانچہ لگا دیا ( غصے میں یہ خطا مجھ سے ہو گئی ) آپ نے فرمایا ( دیکھو خیال رکھو ) اور پیغمبروں پر مجھ کو فضیلت نہ دو قیامت کے دن ایسا ہو گا سب لوگ ( ہیبت خداوندی سے ) بیہوش ہو جائیں گے پھر میں سب سے پہلے ہوش میں آؤں گا ۔ کیا دیکھوں گا موسیٰ علیہ السلام ( مجھ سے بھی پہلے ) عرش کا ایک کونہ تھامے کھڑے ہیں ۔ اب یہ میں نہیں جانتا کہ وہ مجھ سے پہلے ہوش میں آ جائیں گے یا کوہ طور پر جو ( دنیا میں ) بیہوش ہو چکے تھے اس کے بدل وہ آخرت میں بیہوش ہی نہ ہوں گے ۔</b>",
        "bookID": "87.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 160340,
        "last_updated": null
    }
]