[
    {
        "urduURN": 4068450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6940,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے خالف بن یزید نے بیان کیا ، ان سے سعید بن ابی ہلال بن اسامہ نے ، انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نماز میں دعا کرتے تھے کہ اے اللہ عیاش بن ابی ربیعہ ، سلمہ بن ہشام اور ولید بن الولید ( رضی اللہ عنہم ) کو نجات دے ۔ اے اللہ بے بس مسلمانوں کو نجات دے ۔ اے اللہ قبیلہ مضر کے لوگوں کو سختی کے ساتھ پیس ڈال اور ان پر ایسی قحط سالی بھیج جیسی حضرت یوسف علیہ السلام کے زمانہ میں آئی تھی ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 160570,
        "last_updated": null
    },
    {
        "urduURN": 4068460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6941,
        "hadithSanad": "ہم سے محمد بن عبداللہ بن حوشب الطائفی نے بیان کیا ، انہوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، انہوں نے کہا ہم سے ایوب نے بیان کیا ، ان سے ابوقلابہ نے بیان کیا ، اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تین خصوصیتیں ایسی ہیں کہ جس میں پائی جائیں گی وہ ایمان کی شیرینی پالے گا اول یہ کہ اللہ اور اس کے رسول اسے سب سے زیادہ عزیز ہوں ۔ دوسرے یہ کہ وہ کسی شخص سے محبت صرف اللہ ہی کے لیے کرے تیسرے یہ کہ اسے کفر کی طرف لوٹ کر جانا اتنا ناگوار ہو جیسے آگ میں پھینک دیا جانا ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 160580,
        "last_updated": null
    },
    {
        "urduURN": 4068470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6942,
        "hadithSanad": "ہم سے سعید بن سلیمان نے بیان کیا ، کہا ہم سے عباد نے ، ان سے اسماعیل نے ، انہوں نے قیس سے سنا ، انہوں نے سعید بن زید رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے اپنے آپ کو اس حال میں پایا کہ اسلام لانے کی وجہ سے ( مکہ معظمہ میں ) عمر رضی اللہ عنہ نے مجھے باندھ دیا تھا اور اب جو کچھ تم نے عثمان رضی اللہ عنہ کے ساتھ کیا ہے اس پر اگر احد پہاڑ ٹکڑے ٹکڑے ہو جائے تو اسے ایسا ہی ہونا چاہئے ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 160590,
        "last_updated": null
    },
    {
        "urduURN": 4068480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6943,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، ان سے اسماعیل نے ، کہا ہم سے قیس نے بیان کیا ، ان سے خباب بن الارت رضی اللہ عنہ نے کہ",
        "hadithText": "ہم نے رسول اللہ صلی اللہ علیہ وسلم سے اپنا حال زار بیان کیا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت کعبہ کے سایہ میں اپنی چادر پر بیٹھے ہوئے تھے ۔ ہم نے عرض کیا کیوں نہیں آپ ہمارے لیے اللہ تعالیٰ سے مددمانگتے اور اللہ تعالیٰ سے دعا کرتے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ۔ تم سے پہلے بہت سے نبیوں اور ان پر ایمان لانے والوں کا حال یہ ہوا کہ ان میں سے کسی ایک کو پکڑ لیا جاتا اور گڑھا کھود کر اس میں انہیں ڈال دیا جاتا پھر آرا لایا جاتا اور ان کے سر پر رکھ کر دو ٹکڑے کر دئیے جاتے اور لوہے کے کنگھے ان کے گوشت اور ہڈیوں میں دھنسا دئیے جاتے لیکن یہ آزمائشیں بھی انہیں اپنے دین سے نہیں روک سکتی تھیں ۔ اللہ کی قسم اس اسلام کا کام مکمل ہو گا اور ایک سوار صنعاء سے حضرموت تک اکیلا سفر کرے گا اور اسے اللہ کے سوا اور کسی کا خوف نہیں ہو گا اور بکریوں پر سوا بھیڑئیے کے خوف کے ( اور کسی لوٹ وغیرہ کا کوئی ڈر نہ ہو گا ) لیکن تم لوگ جلدی کرتے ہو ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 160600,
        "last_updated": null
    },
    {
        "urduURN": 4068490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6944,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے سعید مقبری نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم مسجدمیں تھے کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور فرمایا کہ یہودیوں کے پاس چلو ۔ ہم آنحضرت صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے اور جب ہم ” بیت المدراس “ کے پاس پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے انہیں آواز دی اے قوم یہود ! اسلام لاؤ تم محفوظ ہو جاؤ گے ۔ یہودیوں نے کہا ابوالقاسم ! آپ نے پہنچا دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرا بھی یہی مقصد ہے پھر آپ نے دوبارہ یہی فرمایا اور یہودیوں نے کہا کہ ابوالقاسم آپ نے پہنچا دیا آنحضرت صلی اللہ علیہ وسلم نے تیسری مرتبہ یہی فرمایا ۔ اور پھر فرمایا تمہیں معلوم ہونا چاہئے کہ زمین اللہ اور اس کے رسول کی ہے اور میں تمہیں جلاوطن کرتا ہوں ۔ پس تم میں سے جس کے پاس مال ہو اسے چاہئے کہ جلاوطن ہونے سے پہلے اسے بیچ دے ورنہ جان لو کہ زمین اللہ اور اس کے رسول کی ہے ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 160610,
        "last_updated": null
    },
    {
        "urduURN": 4068500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6945,
        "hadithSanad": "ہم سے یحییٰ بن قزعہ نے بیان کیا ، کہا ہم سے امام مالک نے بیان کیا ، ان سے عبدالرحمٰن بن القاسم نے ، ان سے ان کے والد نے اور ان سے یزید بن حارثہ انصاری کے دو صاحبزادوں عبدالرحمٰن اور مجمع نے اور ان سے خنساء بنت خذام انصاریہ نے کہ",
        "hadithText": "ان کے والد نے ان کی شادی کر دی ان کی ایک شادی اس سے پہلے ہو چکی تھی ( اور اب بیوہ تھیں ) اس نکاح کو انہوں نے ناپسند کیا اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر ( اپنی ناپسندیدگی ظاہر کر دی ) تو آنحضرت صلی اللہ علیہ وسلم نے اس نکاح کو فسخ کر دیا ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 160620,
        "last_updated": null
    },
    {
        "urduURN": 4068510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6946,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، ان سے ابن جریج نے ، ان سے ابن ابی ملیکہ نے ، ان سے ابوعمرو نے جن کا نام ذکوان ہے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے عرض کیا یا رسول اللہ ! کیا عورتوں سے ان کے نکاح کے سلسلہ میں اجازت لی جائے گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں ۔ میں نے عرض کیا لیکن کنواری لڑکی سے اجازت لی جائے گی تو وہ شرم کی وجہ سے چپ سادھ لے گی ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس کی خاموشی ہی اجازت ہے ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 160630,
        "last_updated": null
    },
    {
        "urduURN": 4068520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6947,
        "hadithSanad": "ہم سے ابونعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا ، ان سے عمرو بن دینار نے اور ان سے حضرت جابر رضی اللہ عنہ نے کہ",
        "hadithText": "ایک انصاری صحابی نے کسی غلام کو مدبر بنایا اور ان کے پاس اس کے سوا اور کوئی مال نہیں تھا ۔ رسول اللہ صلی اللہ علیہ وسلم کو جب اس کی اطلاع ملی تو دریافت فرمایا ۔ اسے مجھ سے کون خریدے گا چنانچہ نعیم بن النحام رضی اللہ عنہ نے آٹھ سو درہم میں خرید لیا ۔ بیان کیا کہ پھر میں نے حضرت جابر رضی اللہ عنہ سے سنا انہوں نے بیان کیا کہ وہ ایک قبطی غلام تھا اور پہلے ہی سال مرگیا ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 160640,
        "last_updated": null
    },
    {
        "urduURN": 4068530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6948,
        "hadithSanad": "ہم سے حسین بن منصور نے بیان کیا ، کہا ہم سے اسباط بن محمد نے بیان کیا ، کہا ہم سے شیبانی سلیمان بن فیروز نے بیان کیا ، ان سے عکرمہ نے اور ان سے ابن عباس رضی اللہ عنہما نے ، شیبانی نے کہا کہ",
        "hadithText": "مجھ سے عطاء ابوالحسن السوائی نے بیان کیا اور میرا یہی خیال ہے کہ انہوں نے یہ حدیث حضرت ابن عباس رضی اللہ عنہما سے بیان کی ۔ سورۃ المائدہ کی آیت يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها‏ .... بیان کیا کہ جب کوئی شخص ( زمانہ جاہلیت میں ) مر جاتا تو اس کے وارث اس کی عورت کے حقدار بنتے اگر ان میں سے کوئی چاہتا تو اس سے شادی کر لیتا اور چاہتا تو شادی نہ کرتا اس طرح مرنے والے کے وارث اس عورت پر عورت کے وارثوں سے زیادہ حق رکھتے ۔ اس پر یہ آیت نازل ہوئی ( بیوہ عورت عدت گزارنے کے بعد مختار ہے وہ جس سے چاہے شادی کرے اس پر زبردستی کرنا ہرگز جائز نہیں ہے ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 160650,
        "last_updated": null
    },
    {
        "urduURN": 4068540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6949,
        "hadithSanad": "اور لیث بن سعد نے بیان کیا کہ مجھ سے نافع نے بیان کیا ، انہیں صفیہ بنت ابی عبید نے خبر دی کہ",
        "hadithText": "حکومت کے غلاموں میں سے ایک نہ حصہ خمس کی ایک باندی سے صحبت کر لی اور اس کے ساتھ زبردستی کر کے اس کی بکارت توڑ دی تو حضرت عمر رضی اللہ عنہ نے غلام پر حد جاری کرائی اور اسے شہر بدر بھی کر دیا لیکن باندی پر حد نہیں جاری کی ۔ کیونکہ غلام نے اس کے ساتھ زبردستی کی تھی ۔ زہری نے ایسی کنواری باندی کے متعلق کہا جس کے ساتھ کسی آزاد نے ہمبستری کر لی ہو کہ حاکم کنواری باندی میں اس کی وجہ سے اس شخص سے اتنے دام بھرلے جتنے بکارت جاتے رہنے کی وجہ سے اس کے دام کم ہو گئے ہیں اور اس کو کوڑے بھی لگائے اگر آزاد مرد ثیبہ لونڈی سے زنا کرے تب خریدے ۔ اماموں نے یہ حکم نہیں دیا ہے کہ اس کو کچھ مالی تاوان دینا پڑے گا بلکہ صرف حد لگائی جائے گی ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 160660,
        "last_updated": null
    },
    {
        "urduURN": 4068550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6950,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم سے شعیب نے بیان کیا ، ان سے ابوالزناد نے ، ان سے اعرج نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ابراہیم علیہ السلام نے سارہ علیہا السلام کو ساتھ لے کر ہجرت کی تو ایک ایسی بستی میں پہنچے جس میں بادشاہوں میں سے ایک بادشاہ یا ظالموں میں سے ایک ظالم رہتا تھا اس ظالم نے ابراہیم علیہ السلام کے پاس یہ حکم بھیجا کہ سارہ علیہا السلام کو اس کے پاس بھیجیں آپ نے سارہ کو بھیج دیا وہ ظالم ان کے پاس آیا تو وہ وضو کر کے نماز پڑھ رہی تھیں انہوں نے دعا کی کہ اے اللہ ! اگر میں تجھ پر اور تیرے رسول پر ایمان رکھتی ہوں تو تو مجھ پر کافر کو نہ مسلط کر پھر ایسا ہوا کہ وہ کم بخت بادشاہ اچانک خراٹے لینے اور گر کر پاؤں ہلانے لگا ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 160670,
        "last_updated": null
    },
    {
        "urduURN": 4068560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6951,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں سالم نے خبر دی اور انہیں حضرت عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مسلمان مسلمان کا بھائی ہے نہ اس پر ظلم کرے اور نہ اسے ( کسی ظالم کے ) سپرد کرے ۔ اور جو شخص اپنے کسی بھائی کی ضرورت پوری کرنے میں لگا ہو گا اللہ تعالیٰ اس کی ضرورت اور حاجت پوری کرے گا ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 160680,
        "last_updated": null
    },
    {
        "urduURN": 4068570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 89,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 6952,
        "hadithSanad": "ہم سے محمد بن عبدالرحیم نے بیان کیا ، انہوں نے کہا ہم سے سعید بن سلیمان واسطی نے بیان کیا ، انہوں نے کہا ہم سے ہشیم نے بیان کیا ، کہا ہم کو عبیداللہ بن ابی بکر بن انس نے خبر دی اور ان سے حضرت انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اپنے بھائی کی مدد کرو ۔ خواہ وہ ظالم ہو یا مظلوم ۔ ایک صحابی رضی اللہ عنہ نے عرض کیا یا رسول اللہ جب وہ مظلوم ہو تو میں اس کی مدد کروں گا لیکن آپ کا کیا خیال ہے جب وہ ظالم ہو گا پھر میں اس کی مدد کیسے کروں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس وقت تم اسے ظلم سے روکنا کیونکہ یہی اس کی مدد ہے ۔</b>",
        "bookID": "89.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 160690,
        "last_updated": null
    }
]