[
    {
        "urduURN": 4005180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 521,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انھوں نے کہا کہ میں نے امام مالک رحمہ اللہ علیہ کو پڑھ کر سنایا ابن شہاب کی روایت سے کہ",
        "hadithText": "حضرت عمر بن عبدالعزیز رحمہ اللہ علیہ نے ایک دن ( عصر کی ) نماز میں دیر کی ، پس عروہ بن زبیر رضی اللہ عنہ کے پاس تشریف لے گئے ، اور انھوں نے بتایا کہ ( اسی طرح ) مغیرہ بن شعبہ رضی اللہ عنہ نے ایک دن ( عراق کے ملک میں ) نماز میں دیر کی تھی جب وہ عراق میں ( حاکم ) تھے ۔ پس ابومسعود انصاری ( عقبہ بن عمر ) ان کی خدمت میں گئے ۔ اور فرمایا ، مغیرہ رضی اللہ عنہ ! آخر یہ کیا بات ہے ، کیا آپ کو معلوم نہیں کہ جب جبرائیل علیہ السلام تشریف لائے تو انھوں نے نماز پڑھی اور رسول کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے کہا کہ میں اسی طرح حکم دیا گیا ہوں ۔ اس پر حضرت عمر بن عبدالعزیز رحمہ اللہ نے عروہ سے کہا ، معلوم بھی ہے آپ کیا بیان کر رہے ہیں ؟ کیا جبرائیل علیہ السلام نے نبی کریم صلی اللہ علیہ وسلم کو نماز کے اوقات ( عمل کر کے ) بتلائے تھے ۔ عروہ نے کہا ، کہ ہاں اسی طرح بشیر بن ابی مسعود رضی اللہ عنہ اپنے والد کے واسطہ سے بیان کرتے تھے ۔ عروہ رحمہ اللہ علیہ نے کہا کہ مجھ سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز اس وقت پڑھ لیتے تھے جب ابھی دھوپ ان کے حجرہ میں موجود ہوتی تھی اس سے بھی پہلے کہ وہ دیوار پر چڑھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 105201,
        "last_updated": null
    },
    {
        "urduURN": 4005200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 523,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے عباد بن عباد بصریٰ نے ، اور یہ عباد کے لڑکے ہیں ، ابوجمرہ ( نصر بن عمران ) کے ذریعہ سے ، انھوں نے ابن عباس رضی اللہ عنہما سے ، انھوں نے کہا کہ",
        "hadithText": "عبدالقیس کا وفد رسول کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور کہا کہ ہم اس ربیعہ قبیلہ سے ہیں اور ہم آپ صلی اللہ علیہ وسلم کی خدمت میں صرف حرمت والے مہینوں ہی میں حاضر ہو سکتے ہیں ، اس لیے آپ صلی اللہ علیہ وسلم کسی ایسی بات کا ہمیں حکم دیجیئے ، جسے ہم آپ صلی اللہ علیہ وسلم سے سیکھ لیں اور اپنے پیچھے رہنے والے دوسرے لوگوں کو بھی اس کی دعوت دے سکیں ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں تمہیں چار چیزوں کا حکم دیتا ہوں اور چار چیزوں سے روکتا ہوں ، پہلے خدا پر ایمان لانے کا ، پھر آپ صلی اللہ علیہ وسلم نے اس کی تفصیل بیان فرمائی کہ اس بات کی شہادت دینا کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ میں اللہ کا رسول ہوں ، اور دوسرے نماز قائم کرنے کا ، تیسرے زکوٰۃ دینے کا ، اور چوتھے جو مال تمہیں غنیمت میں ملے ، اس میں سے پانچواں حصہ ادا کرنے کا اور تمہیں میں تونبڑی حنتم ، قسار اور نقیر کے استعمال سے روکتا ہوں ۔ ( نوٹ : یہ تمام برتن شراب بنانے کے لیے استعمال ہوتے تھے ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 105220,
        "last_updated": null
    },
    {
        "urduURN": 4005210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 524,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ، انھوں نے کہا کہ ہم سے یحییٰ بن سعید قطان نے کہا کہ ہم سے اسماعیل بن ابی خالد نے بیان کیا ، انھوں نے کہا کہ ہم سے قیس بن ابی حازم نے جریر بن عبداللہ رضی اللہ عنہ کی روایت سے بیان کیا کہ جریر بن عبداللہ بجلی رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم کے دست مبارک پر نماز قائم کرنے ، زکوٰۃ دینے ، اور ہر مسلمان کے ساتھ خیرخواہی کرنے پر بیعت کی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 105230,
        "last_updated": null
    },
    {
        "urduURN": 4005220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 525,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، انھوں نے کہا ہم سے یحییٰ بن سعید قطان نے اعمش کی روایت سے بیان کیا ، اعمش ( سلیمان بن مہران ) نے کہا کہ مجھ سے شقیق بن مسلمہ نے بیان کیا ، شقیق نے کہا کہ میں نے حذیفہ بن یمان رضی اللہ عنہ سے سنا ۔ حذیفہ رضی اللہ عنہ نے فرمایا کہ",
        "hadithText": "ہم حضرت عمر رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے کہ آپ نے پوچھا کہ فتنہ سے متعلق رسول اللہ صلی اللہ علیہ وسلم کی کوئی حدیث تم میں سے کسی کو یاد ہے ؟ میں بولا ، میں نے اسے ( اسی طرح یاد رکھا ہے ) جیسے آنحضور صلی اللہ علیہ وسلم نے اس حدیث کو بیان فرمایا تھا ۔ حضرت عمر رضی اللہ عنہ بولے ، کہ تم رسول اللہ صلی اللہ علیہ وسلم سے فتن کو معلوم کرنے میں بہت بے باک تھے ۔ میں نے کہا کہ انسان کے گھر والے ، مال اولاد اور پڑوسی سب فتنہ ( کی چیز ) ہیں ۔ اور نماز ، روزہ ، صدقہ ، اچھی بات کے لیے لوگوں کو حکم کرنا اور بری باتوں سے روکنا ان فتنوں کا کفارہ ہیں ۔ حضرت عمر رضی اللہ عنہ نے فرمایا کہ میں تم سے اس کے متعلق نہیں پوچھتا ، مجھے تم اس فتنہ کے بارے میں بتلاؤ جو سمندر کی موج کی طرح ٹھاٹھیں مارتا ہوا بڑھے گا ۔ اس پر میں نے کہا کہ یا امیرالمؤمنین ! آپ اس سے خوف نہ کھائیے ۔ آپ کے اور فتنہ کے درمیان ایک بند دروازہ ہے ۔ پوچھا کیا وہ دروازہ توڑ دیا جائے گا یا ( صرف ) کھولا جائے گا ۔ میں نے کہا کہ توڑ دیا جائے گا ۔ حضرت عمر رضی اللہ عنہ بول اٹھے ، کہ پھر تو وہ کبھی بند نہیں ہو سکے گا ۔ شقیق نے کہا کہ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا ، کیا حضرت عمر رضی اللہ عنہ اس دروازہ کے متعلق کچھ علم رکھتے تھے تو انھوں نے کہا کہ ہاں ! بالکل اسی طرح جیسے دن کے بعد رات کے آنے کا ۔ میں نے تم سے ایک ایسی حدیث بیان کی ہے جو قطعاً غلط نہیں ہے ۔ ہمیں اس کے متعلق حذیفہ رضی اللہ عنہ سے پوچھنے میں ڈر ہوتا تھا ( کہ دروازہ سے کیا مراد ہے ) اس لیے ہم نے مسروق سے کہا ( کہ وہ پوچھیں ) انھوں نے دریافت کیا تو آپ نے بتایا کہ وہ دروازہ خود حضرت عمر رضی اللہ عنہ ہی تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 105240,
        "last_updated": null
    },
    {
        "urduURN": 4005230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 526,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ، کہا کہ ہم سے یزید بن زریع نے بیان کیا ، سلیمان تیمی کے واسطہ سے ، انہوں نے ابوعثمان نہدی سے ، انہوں نے ابن مسعود رضی اللہ عنہما سے کہ",
        "hadithText": "ایک شخص نے کسی غیر عورت کا بوسہ لے لیا ۔ اور پھر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں آیا اور آپ کو اس حرکت کی خبر دے دی ۔ اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی ، کہ نماز دن کے دونوں حصوں میں قائم کرو اور کچھ رات گئے بھی ، اور بلاشبہ نیکیاں برائیوں کو مٹا دیتی ہیں ۔ اس شخص نے کہا کہ یا رسول اللہ ! کیا یہ صرف میرے لیے ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں بلکہ میری تمام امت کے لیے یہی حکم ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 105250,
        "last_updated": null
    },
    {
        "urduURN": 4005240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 527,
        "hadithSanad": "ہم سے ابوالولید ہشام بن عبدالملک نے بیان کیا ، کہا ہم سے شعبہ نے ، انھوں نے کہا کہ مجھے ولید بن عیزار کوفی نے خبر دی ، کہا کہ میں نے ابوعمر و شیبانی سے سنا ، وہ کہتے تھے کہ میں نے اس گھر کے مالک سے سنا ، ( آپ عبداللہ بن مسعود رضی اللہ عنہما کے گھر کی طرف اشارہ کر رہے تھے ) انھوں نے فرمایا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے پوچھا کہ اللہ تعالیٰ کی بارگاہ میں کون سا عمل زیادہ محبوب ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے وقت پر نماز پڑھنا ، پھر پوچھا ، اس کے بعد ، فرمایا والدین کے ساتھ نیک معاملہ رکھنا ۔ پوچھا اس کے بعد ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی راہ میں جہاد کرنا ۔ ابن مسعود رضی اللہ عنہما نے فرمایا کہ آنحضرت صلی اللہ علیہ وسلم نے مجھے یہ تفصیل بتائی اور اگر میں اور سوالات کرتا تو آپ صلی اللہ علیہ وسلم اور زیادہ بھی بتلاتے ۔ ( لیکن میں نے بطور ادب خاموشی اختیار کی ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 105260,
        "last_updated": null
    },
    {
        "urduURN": 4005250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 528,
        "hadithSanad": "ہم سے ابراہیم بن حمزہ نے بیان کیا ، کہا ہم سے عبدالعزیز بن ابی حازم اور عبدالعزیز بن محمد در اوردی نے یزید بن عبداللہ کی روایت سے ، انھوں نے محمد بن ابراہیم تیمی سے ، انھوں نے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اگر کسی شخص کے دروازے پر نہر جاری ہو اور وہ روزانہ اس میں پانچ پانچ دفعہ نہائے تو تمہارا کیا گمان ہے ۔ کیا اس کے بدن پر کچھ بھی میل باقی رہ سکتا ہے ؟ صحابہ نے عرض کی کہ نہیں یا رسول اللہ ! ہرگز نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہی حال پانچوں وقت کی نمازوں کا ہے کہ اللہ پاک ان کے ذریعہ سے گناہوں کو مٹا دیتا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 105270,
        "last_updated": null
    },
    {
        "urduURN": 4005260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 529,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے مہدی بن میمون نے غیلان بن جریر کے واسطہ سے ، انھوں نے حضرت انس رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے عہد کی کوئی بات اس زمانہ میں نہیں پاتا ۔ لوگوں نے کہا ، نماز تو ہے ۔ فرمایا اس کے اندر بھی تم نے کر رکھا ہے جو کر رکھا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 105280,
        "last_updated": null
    },
    {
        "urduURN": 4005270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 530,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ، انھوں نے کہا ہمیں عبدالواحد بن واصل ابوعبیدہ حداد نے خبر دی ، انھوں نے عبدالعزیز کے بھائی عثمان بن ابی رواد کے واسطہ سے بیان کیا ، انھوں نے کہا کہ میں نے زہری سے سنا کہ",
        "hadithText": "میں دمشق میں حضرت انس بن مالک رضی اللہ عنہ کی خدمت میں گیا ۔ آپ اس وقت رو رہے تھے ۔ میں نے عرض کیا کہ آپ کیوں رو رہے ہیں ؟ انھوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم کے عہد کی کوئی چیز اس نماز کے علاوہ اب میں نہیں پاتا اور اب اس کو بھی ضائع کر دیا گیا ہے ۔ اور بکر بن خلف نے کہا کہ ہم سے محمد بن بکر برسانی نے بیان کیا کہ ہم سے عثمان بن ابی رواد نے یہی حدیث بیان کی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 105290,
        "last_updated": null
    },
    {
        "urduURN": 4005280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 531,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے ہشام بن عبداللہ دستوائی نے قتادہ ابن دعامہ کے واسطے سے ، انھوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جب تم میں سے کوئی نماز میں ہوتا ہے تو وہ اپنے رب سے سرگوشی کرتا رہتا ہے اس لیے اپنی داہنی جانب نہ تھوکنا چاہیے لیکن بائیں پاؤں کے نیچے تھوک سکتا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 105300,
        "last_updated": null
    },
    {
        "urduURN": 4005290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 532,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہا ہم سے یزید بن ابراہیم نے ، انھوں نے کہا کہ ہم سے قتادہ نے انس بن مالک رضی اللہ عنہ سے بیان کیا ، آپ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے تھے کہ",
        "hadithText": "آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ سجدہ کرنے میں اعتدال رکھو ( سیدھی طرح پر کرو ) اور کوئی شخص تم میں سے اپنے بازوؤں کو کتے کی طرح نہ پھیلائے ۔ جب کسی کو تھوکنا ہی ہو تو سامنے یا داہنی طرف نہ تھوکے ، کیونکہ وہ نماز میں اپنے رب سے پوشیدہ باتیں کرتا رہتا ہے اور سعید نے قتادہ رضی اللہ عنہ سے روایت کر کے بیان کیا ہے کہ آگے یا سامنے نہ تھوکے البتہ بائیں طرف پاؤں کے نیچے تھوک سکتا ہے اور شعبہ نے کہا کہ اپنے سامنے اور دائیں جانب نہ تھوکے ، بلکہ بائیں طرف یا پاؤں کے نیچے تھوک سکتا ہے ۔ اور حمید نے انس بن مالک رضی اللہ عنہ سے وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ قبلہ کی طرف نہ تھوکے اور نہ دائیں طرف البتہ بائیں طرف یا پاؤں کے نیچے تھوک سکتا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 105310,
        "last_updated": null
    },
    {
        "urduURN": 4005300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے ایوب بن سلیمان مدنی نے بیان کیا ، کہا ہم سے ابوبکر عبدالحمید بن ابی اویس نے سلیمان بن بلال کے واسطہ سے کہ صالح بن کیسان نے کہا کہ ہم سے اعرج عبدالرحمٰن وغیرہ نے حدیث بیان کی ۔ وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے تھے اور عبداللہ بن عمر رضی اللہ عنہما کے مولیٰ نافع عبداللہ بن عمر رضی اللہ عنہما سے اس حدیث کی روایت کرتے تھے کہ ان دونوں صحابہ رضی اللہ عنہما نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا جب گرمی تیز ہو جائے تو نماز کو ٹھنڈے وقت میں پڑھو ، کیونکہ گرمی کی تیزی جہنم کی آگ کی بھاپ سے ہوتی ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 105321,
        "last_updated": null
    },
    {
        "urduURN": 4005310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 535,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے غندر محمد بن جعفر نے بیان کیا ، ان سے شعبہ بن حجاج نے مہاجر ابوالحسن کی روایت سے بیان کیا ، انھوں نے زید بن وہب ہمدانی سے سنا ۔ انھوں نے ابوذر رضی اللہ عنہ سے",
        "hadithText": "کہ نبی کریم صلی اللہ علیہ وسلم کے مؤذن ( بلال ) نے ظہر کی اذان دی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھنڈا کر ، ٹھنڈا کر ، یا یہ فرمایا کہ انتظار کر ، انتظار کر ، اور فرمایا کہ گرمی کی تیزی جہنم کی آگ کی بھاپ سے ہے ۔ اس لیے جب گرمی سخت ہو جائے تو نماز ٹھنڈے وقت میں پڑھا کرو ، پھر ظہر کی اذان اس وقت کہی گئی جب ہم نے ٹیلوں کے سائے دیکھ لیے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 105340,
        "last_updated": null
    },
    {
        "urduURN": 4005320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 536,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے بیان کیا ، کہا اس حدیث کو ہم نے زہری سے سن کر یاد کیا ، وہ سعید بن مسیب کے واسطہ سے بیان کرتے ہیں ، وہ ابوہریرہ رضی اللہ عنہ سے ، وہ نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "جب گرمی تیز ہو جائے تو نماز کو ٹھنڈے وقت میں پڑھا کرو ، کیونکہ گرمی کی تیزی دوزخ کی آگ کی بھاپ کی وجہ سے ہوتی ہے ۔ دوزخ نے اپنے رب سے شکایت کی کہ اے میرے رب ! ( آگ کی شدت کی وجہ سے ) میرے بعض حصہ نے بعض حصہ کو کھا لیا ہے اس پر اللہ تعالیٰ نے اسے دو سانس لینے کی اجازت دی ، ایک سانس جاڑے میں اور ایک سانس گرمی میں ۔ اب انتہائی سخت گرمی اور سخت سردی جو تم لوگ محسوس کرتے ہو وہ اسی سے پیدا ہوتی ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 105351,
        "last_updated": null
    },
    {
        "urduURN": 4005340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 538,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا کہا مجھ سے میرے باپ نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، کہا کہ ہم سے ابوصالح ذکوان نے ابو سعید خدری رضی اللہ عنہ کے واسطہ سے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( کہ گرمی کے موسم میں ) ظہر کو ٹھنڈے وقت میں پڑھا کرو ، کیونکہ گرمی کی شدت جہنم کی بھاپ سے پیدا ہوتی ہے ۔ اس حدیث کی متابعت سفیان ثوری ، یحییٰ اور ابوعوانہ نے اعمش کے واسطہ سے کی ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 105370,
        "last_updated": null
    },
    {
        "urduURN": 4005350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 539,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے بنی تیم اللہ کے غلام مہاجر ابوالحسن نے بیان کیا ، کہا کہ میں نے زید بن وہب جہنی سے سنا ، وہ ابوذر غفاری رضی اللہ عنہ سے نقل کرتے تھے کہ انھوں نے کہا کہ",
        "hadithText": "ہم ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ۔ مؤذن نے چاہا کہ ظہر کی اذان دے ۔ لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ وقت کو ٹھنڈا ہونے دو ، مؤذن نے ( تھوڑی دیر بعد ) پھر چاہا کہ اذان دے ، لیکن آپ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھنڈا ہونے دو ۔ جب ہم نے ٹیلے کا سایہ ڈھلا ہوا دیکھ لیا ۔ ( تب اذان کہی گئی ) پھر نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ گرمی کی تیزی جہنم کی بھاپ کی تیزی سے ہے ۔ اس لیے جب گرمی سخت ہو جایا کرے تو ظہر کی نماز ٹھنڈے وقت میں پڑھا کرو ۔ ابن عباس رضی اللہ عنہما نے فرمایا «يتفيئو» ( کا لفظ جو سورۃ النحل میں ہے ) کے معنے «تتميل‏» ( جھکنا ، مائل ہونا ) ہیں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 105380,
        "last_updated": null
    },
    {
        "urduURN": 4005360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 540,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا ، کہا ہم سے شعیب نے زہری کی روایت سے بیان کیا ، انھوں نے کہا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "جب سورج ڈھلا تو نبی کریم صلی اللہ علیہ وسلم حجرہ سے باہر تشریف لائے اور ظہر کی نماز پڑھی ۔ پھر منبر پر تشریف لائے ۔ اور قیامت کا ذکر فرمایا ۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت میں بڑے عظیم امور پیش آئیں گے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اگر کسی کو کچھ پوچھنا ہو تو پوچھ لے ۔ کیونکہ جب تک میں اس جگہ پر ہوں تم مجھ سے جو بھی پوچھو گے ۔ میں اس کا جواب ضرور دوں گا ۔ لوگ بہت زیادہ رونے لگے ۔ آپ صلی اللہ علیہ وسلم برابر فرماتے جاتے تھے کہ جو کچھ پوچھنا ہو پوچھو ۔ عبداللہ بن حذافہ سہمی کھڑے ہوئے اور دریافت کیا کہ حضور صلی اللہ علیہ وسلم میرے باپ کون ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے باپ حذافہ تھے ۔ آپ صلی اللہ علیہ وسلم اب بھی برابر فرما رہے تھے کہ پوچھو کیا پوچھتے ہو ۔ اتنے میں عمر رضی اللہ عنہ ادب سے گھٹنوں کے بل بیٹھ گئے اور انھوں نے فرمایا کہ ہم اللہ تعالیٰ کے مالک ہونے ، اسلام کے دین ہونے اور محمد ( صلی اللہ علیہ وسلم ) کے نبی ہونے سے راضی اور خوش ہیں ۔ ( پس اس گستاخی سے ہم باز آتے ہیں کہ آپ صلی اللہ علیہ وسلم سے جا اور بے جا سوالات کریں ) اس پر آنحضرت صلی اللہ علیہ وسلم خاموش ہو گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ابھی ابھی میرے سامنے جنت اور جہنم اس دیوار کے کونے میں پیش کی گئی تھی ۔ پس میں نے نہ ایسی کوئی عمدہ چیز دیکھی ( جیسی جنت تھی ) اور نہ کوئی ایسی بری چیز دیکھی ( جیسی دوزخ تھی ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 105390,
        "last_updated": null
    },
    {
        "urduURN": 4005370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 541,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، کہ ہم سے شعبہ نے بیان کیا ابوالمنہال کی روایت سے ، انھوں نے ابوبرزہ ( فضلہ بن عبید رضی اللہ عنہ ) سے ، انھوں نے کہا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم صبح کی نماز اس وقت پڑھتے تھے جب ہم اپنے پاس بیٹھے ہوئے شخص کو پہچان لیتے تھے ۔ صبح کی نماز میں آنحضور صلی اللہ علیہ وسلم ساٹھ سے سو تک آیتیں پڑھتے ۔ اور آپ صلی اللہ علیہ وسلم ظہر اس وقت پڑھتے جب سورج ڈھل جاتا ۔ اور عصر کی نماز اس وقت کہ ہم مدینہ منورہ کی آخری حد تک ( نماز پڑھنے کے بعد ) جاتے لیکن سورج اب بھی تیز رہتا تھا ۔ نماز مغرب کا حضرت انس رضی اللہ عنہ نے جو وقت بتایا تھا وہ مجھے یاد نہیں رہا ۔ اور آنحضور صلی اللہ علیہ وسلم عشاء کی نماز کو تہائی رات تک دیر کرنے میں کوئی حرج نہیں سمجھتے تھے ، پھر ابوالمنہال نے کہا کہ آدھی رات تک ( موخر کرنے میں ) کوئی حرج نہیں سمجھتے تھے ۔ اور معاذ نے کہا کہ شعبہ نے فرمایا کہ پھر میں دوبارہ ابوالمنہال سے ملا تو انھوں نے فرمایا ” یا تہائی رات تک “ ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 105400,
        "last_updated": null
    },
    {
        "urduURN": 4005380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 542,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انھوں نے کہا کہ ہمیں عبداللہ بن مبارک نے خبر دی ، انھوں نے کہا ہم سے خالد بن عبدالرحمٰن نے بیان کیا ، انھوں نے کہا مجھ سے غالب قطان نے بکر بن عبداللہ مزنی کے واسطہ سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے آپ نے فرمایا کہ",
        "hadithText": "جب ہم ( گرمیوں میں ) نبی کریم صلی اللہ علیہ وسلم کے پیچھے ظہر کی نماز دوپہر دن میں پڑھتے تھے تو گرمی سے بچنے کے لیے کپڑوں پر سجدہ کیا کرتے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 105410,
        "last_updated": null
    },
    {
        "urduURN": 4005390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 543,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، کہا ہم سے حماد بن زید نے بیان کیا عمرو بن دینار سے ۔ انھوں نے جابر بن زید سے ، انھوں نے ابن عباس رضی اللہ عنہما سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مدینہ میں رہ کر سات رکعات ( ایک ساتھ ) اور آٹھ رکعات ( ایک ساتھ ) پڑھیں ۔ ظہر اور عصر ( کی آٹھ رکعات ) اور مغرب اور عشاء ( کی سات رکعات ) ایوب سختیانی نے جابر بن زید سے پوچھا شاید برسات کا موسم رہا ہو ۔ جابر بن زید نے جواب دیا کہ غالباً ایسا ہی ہو گا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 105420,
        "last_updated": null
    },
    {
        "urduURN": 4005400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 544,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ، کہا ہم سے انس بن عیاض لیثی نے ہشام بن عروہ کے واسطہ سے بیان کیا ، انھوں نے اپنے والد سے کہ حضرت مائی عائشہ صدیقہ رضی اللہ عنہا نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم عصر کی نماز ایسے وقت پڑھتے تھے کہ ان کے حجرہ میں سے ابھی دھوپ باہر نہیں نکلتی تھی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 105430,
        "last_updated": null
    },
    {
        "urduURN": 4005410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 545,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث بن سعد نے ابن شہاب سے بیان کیا ، انھوں نے عروہ بن زبیر رضی اللہ عنہ سے ، انھوں نے حضرت عائشہ صدیقہ رضی اللہ عنہا سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے عصر کی نماز پڑھی تو دھوپ ان کے حجرہ ہی میں تھی ۔ سایہ وہاں نہیں پھیلا تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 105440,
        "last_updated": null
    },
    {
        "urduURN": 4005420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 546,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہا ہم سے سفیان بن عیینہ نے ابن شہاب زہری سے بیان کیا ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ صدیقہ رضی اللہ عنہا سے ، آپ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم جب عصر کی نماز پڑھتے تو سورج ابھی میرے حجرے میں جھانکتا رہتا تھا ۔ ابھی سایہ نہ پھیلا ہوتا تھا ۔ ابوعبداللہ ( امام بخاری ) کہتے ہیں کہ امام مالک اور یحییٰ بن سعید ، شعیب رحمہم اللہ اور ابن ابی حفصہ کے روایتوں میں ( زہری سے ) «والشمس قبل أن تظهر‏» کے الفاظ ہیں ، ( جن کا مطلب یہ ہے کہ دھوپ ابھی اوپر نہ چڑھی ہوتی ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 105450,
        "last_updated": null
    },
    {
        "urduURN": 4005430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 547,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انھوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی ، انھوں نے کہا ہمیں عوف نے خبر دی سیار بن سلامہ سے ، انھوں نے بیان کیا کہ",
        "hadithText": "میں اور میرے باپ ابوبرزہ اسلمی رضی اللہ عنہ کی خدمت میں حاضر ہوئے ۔ ان سے میرے والد نے پوچھا کہ نبی کریم صلی اللہ علیہ وسلم فرض نمازیں کن وقتوں میں پڑھتے تھے ۔ انھوں نے فرمایا کہ دوپہر کی نماز جسے تم ” پہلی نماز “ کہتے ہو سورج ڈھلنے کے بعد پڑھتے تھے ۔ اور جب عصر پڑھتے اس کے بعد کوئی شخص مدینہ کے انتہائی کنارہ پر اپنے گھر واپس جاتا تو سورج اب بھی تیز ہوتا تھا ۔ سیار نے کہا کہ مغرب کے وقت کے متعلق آپ نے جو کچھ کہا تھا وہ مجھے یاد نہیں رہا ۔ اور عشاء کی نماز جسے تم «عتمه» کہتے ہو اس میں دیر کو پسند فرماتے تھے اور اس سے پہلے سونے کو اور اس کے بعد بات چیت کرنے کو ناپسند فرماتے اور صبح کی نماز سے اس وقت فارغ ہو جاتے جب آدمی اپنے قریب بیٹھے ہوئے دوسرے شخص کو پہچان سکتا اور صبح کی نماز میں آپ ساٹھ سے سو تک آیتیں پڑھا کرتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 105460,
        "last_updated": null
    },
    {
        "urduURN": 4005440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 548,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ، وہ امام مالک رحمہ اللہ علیہ سے ، انھوں نے اسحاق بن عبداللہ بن ابی طلحہ سے روایت کیا ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے اس حدیث کو روایت کیا ، انھوں نے فرمایا کہ",
        "hadithText": "ہم عصر کی نماز پڑھ چکتے اور اس کے بعد کوئی بنی عمرو بن عوف ( قباء ) کی مسجد میں جاتا تو ان کو وہاں عصر کی نماز پڑھتے ہوئے پاتا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 105470,
        "last_updated": null
    },
    {
        "urduURN": 4005450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 549,
        "hadithSanad": "ہم سے محمد بن مقاتل نے بیان کیا ، انھوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی ، انھوں نے کہا ہمیں ابوبکر بن عثمان بن سہل بن حنیف نے خبر دی ، انھوں نے کہا میں نے ابوامامہ ( سعد بن سہل ) سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "ہم نے عمر بن عبدالعزیز رحمہ اللہ علیہ کے ساتھ ظہر کی نماز پڑھی ۔ پھر ہم نکل کر حضرت انس بن مالک رضی اللہ عنہ کی خدمت میں حاضر ہوئے تو دیکھا آپ نماز پڑھ رہے ہیں ۔ میں نے عرض کی کہ اے مکرم چچا ! یہ کون سی نماز آپ نے پڑھی ہے ۔ فرمایا کہ عصر کی اور اسی وقت ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بھی یہ نماز پڑھتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 105480,
        "last_updated": null
    },
    {
        "urduURN": 4005460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 550,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا کہ کہا ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی ، انھوں نے کہا کہ مجھ سے انس بن مالک رضی اللہ عنہ نے بیان کیا ، انھوں نے فرمایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم جب عصر کی نماز پڑھتے تو سورج بلند اور تیز روشن ہوتا تھا ۔ پھر ایک شخص مدینہ کے بالائی علاقہ کی طرف جاتا وہاں پہنچنے کے بعد بھی سورج بلند رہتا تھا ( زہری نے کہا کہ ) مدینہ کے بالائی علاقہ کے بعض مقامات تقریباً چار میل پر یا کچھ ایسے ہی واقع ہیں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 105490,
        "last_updated": null
    },
    {
        "urduURN": 4005470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 551,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک رحمہ اللہ علیہ نے ابن شہاب زہری کے واسطہ سے خبر دی ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے کہ آپ نے فرمایا",
        "hadithText": "ہم عصر کی نماز پڑھتے ( نبی کریم صلی اللہ علیہ وسلم کے ساتھ ) اس کے بعد کوئی شخص قباء جاتا اور جب وہاں پہنچ جاتا تو سورج ابھی بلند ہوتا تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 105500,
        "last_updated": null
    },
    {
        "urduURN": 4005480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 552,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہمیں امام مالک نے نافع کے ذریعہ سے خبر پہنچائی ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس کی نماز عصر چھوٹ گئی گویا اس کا گھر اور مال سب لٹ گیا ۔ امام بخاری رحمہ اللہ علیہ نے فرمایا کہ سورۃ محمد میں جو «يترکم» کا لفظ آیا ہے وہ «وتر» سے نکالا گیا ہے ۔ «وتر» کہتے ہیں کسی شخص کا کوئی آدمی مار ڈالنا یا اس کا مال چھین لینا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 105510,
        "last_updated": null
    },
    {
        "urduURN": 4005490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 553,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے ہشام بن عبداللہ دستوائی نے بیان کیا ، کہا ہمیں یحییٰ بن ابی کثیر نے ابوقلابہ عبداللہ بن زید سے خبر دی ۔ انھوں نے ابوالملیح سے ، کہا",
        "hadithText": "ہم بریدہ رضی اللہ عنہ کے ساتھ ایک سفر جنگ میں تھے ۔ ابر و بارش کا دن تھا ۔ آپ نے فرمایا کہ عصر کی نماز جلدی پڑھ لو ۔ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عصر کی نماز چھوڑ دی ، اس کا نیک عمل ضائع ہو گیا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 105520,
        "last_updated": null
    },
    {
        "urduURN": 4005500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 554,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ، کہا ہم سے مروان بن معاویہ نے ، کہا ہم سے اسماعیل بن ابی خالد نے قیس بن ابی حازم سے ۔ انھوں نے جریر بن عبداللہ بجلی رضی اللہ عنہ سے ، انھوں نے کہا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھے ۔ آپ صلی اللہ علیہ وسلم نے چاند پر ایک نظر ڈالی پھر فرمایا کہ تم اپنے رب کو ( آخرت میں ) اسی طرح دیکھو گے جیسے اس چاند کو اب دیکھ رہے ہو ۔ اس کے دیکھنے میں تم کو کوئی زحمت بھی نہیں ہو گی ، پس اگر تم ایسا کر سکتے ہو کہ سورج طلوع ہونے سے پہلے والی نماز ( فجر ) اور سورج غروب ہونے سے پہلے والی نماز ( عصر ) سے تمہیں کوئی چیز روک نہ سکے تو ایسا ضرور کرو ۔ پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی کہ ’’ پس اپنے مالک کی حمد و تسبیح کر سورج طلوع ہونے اور غروب ہونے سے پہلے ۔ ‘‘ اسماعیل ( راوی حدیث ) نے کہا کہ ( عصر اور فجر کی نمازیں ) تم سے چھوٹنے نہ پائیں ۔ ان کا ہمیشہ خاص طور پر دھیان رکھو ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 105530,
        "last_updated": null
    },
    {
        "urduURN": 4005510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 555,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے امام مالک رحمہ اللہ علیہ نے ابوالزناد عبداللہ بن ذکوان سے ، انھوں نے عبدالرحمٰن بن ہرمز اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ رات اور دن میں فرشتوں کی ڈیوٹیاں بدلتی رہتی ہیں ۔ اور فجر اور عصر کی نمازوں میں ( ڈیوٹی پر آنے والوں اور رخصت پانے والوں کا ) اجتماع ہوتا ہے ۔ پھر تمہارے پاس رہنے والے فرشتے جب اوپر چڑھتے ہیں تو اللہ تعالیٰ پوچھتا ہے حالانکہ وہ ان سے بہت زیادہ اپنے بندوں کے متعلق جانتا ہے ، کہ میرے بندوں کو تم نے کس حال میں چھوڑا ۔ وہ جواب دیتے ہیں کہ ہم نے جب انہیں چھوڑا تو وہ ( فجر کی ) نماز پڑھ رہے تھے اور جب ان کے پاس گئے تب بھی وہ ( عصر کی ) نماز پڑھ رہے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 105540,
        "last_updated": null
    },
    {
        "urduURN": 4005520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 556,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انھوں نے کہا ہم سے شیبان نے یحییٰ بن ابی کثیر سے ، انھوں نے ابوسلمہ سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اگر عصر کی نماز کی ایک رکعت بھی کوئی شخص سورج غروب ہونے سے پہلے پا سکا تو پوری نماز پڑھے ( اس کی نماز ادا ہوئی نہ قضاء ) اسی طرح اگر سورج طلوع ہونے سے پہلے فجر کی نماز کی ایک رکعت بھی پا سکے تو پوری نماز پڑھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 105550,
        "last_updated": null
    },
    {
        "urduURN": 4005530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 557,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا مجھ سے ابراہیم بن سعد نے ابن شہاب سے ، انہوں نے سالم بن عبداللہ بن عمر رضی اللہ عنہما سے ، انہوں نے اپنے باپ عبداللہ بن عمر رضی اللہ عنہما سے کہ انہوں نے رسول کریم صلی اللہ علیہ وسلم سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ تم سے پہلے کی امتوں کے مقابلہ میں تمہاری زندگی صرف اتنی ہے جتنا عصر سے سورج ڈوبنے تک کا وقت ہوتا ہے ۔ توراۃ والوں کو توراۃ دی گئی ۔ تو انھوں نے اس پر ( صبح سے ) عمل کیا ۔ آدھے دن تک پھر وہ عاجز آ گئے ، کام پورا نہ کر سکے ، ان لوگوں کو ان کے عمل کا بدلہ ایک ایک قیراط دیا گیا ۔ پھر انجیل والوں کو انجیل دی گئی ، انھوں نے ( آدھے دن سے ) عصر تک اس پر عمل کیا ، اور وہ بھی عاجز آ گئے ۔ ان کو بھی ایک ایک قیراط ان کے عمل کا بدلہ دیا گیا ۔ پھر ( عصر کے وقت ) ہم کو قرآن ملا ۔ ہم نے اس پر سورج کے غروب ہونے تک عمل کیا ( اور کام پورا کر دیا ) ہمیں دو دو قیراط ثواب ملا ۔ اس پر ان دونوں کتاب والوں نے کہا ۔ اے ہمارے پروردگار ! انہیں تو آپ نے دو دو قیراط دئیے اور ہمیں صرف ایک ایک قیراط ۔ حالانکہ عمل ہم نے ان سے زیادہ کیا ۔ اللہ عزوجل نے فرمایا ، تو کیا میں نے اجر دینے میں تم پر کچھ ظلم کیا ۔ انھوں نے عرض کی کہ نہیں ۔ اللہ تعالیٰ نے فرمایا کہ پھر یہ ( زیادہ اجر دینا ) میرا فضل ہے جسے میں چاہوں دے سکتا ہوں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 105560,
        "last_updated": null
    },
    {
        "urduURN": 4005540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 558,
        "hadithSanad": "ہم سے ابوکریب محمد بن علانے بیان کیا ، کہا ہم سے ابواسامہ نے برید بن عبداللہ کے واسطہ سے بیان کیا ، انہوں نے ابوبردہ عامر بن عبداللہ سے ، انہوں نے اپنے باپ ابوموسیٰ اشعری عبداللہ بن قیس رضی اللہ عنہ سے ۔ انہوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ مسلمانوں اور یہود و نصاری کی مثال ایک ایسے شخص کی سی ہے کہ جس نے کچھ لوگوں سے مزدوری پر رات تک کام کرنے کے لئے کہا ۔ انہوں نے آدھے دن کام کیا ۔ پھر جواب دے دیا کہ ہمیں تمہاری اجرت کی ضرورت نہیں ، ( یہ یہود تھے ) پھر اس شخص نے دوسرے مزدور بلائے اور ان سے کہا کہ دن کا جو حصہ باقی بچ گیا ہے ( یعنی آدھا دن ) اسی کو پورا کر دو ۔ شرط کے مطابق مزدوری تمہیں ملے گی ۔ انہوں نے بھی کام شروع کیا لیکن عصر تک وہ بھی جواب دے بیٹھے ۔ ( یہ نصاریٰ تھے ) پس اس تیسرے گروہ نے ( جو اہل اسلام ہیں ) پہلے دو گروہوں کے کام کی پوری مزدوری لے لی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 105570,
        "last_updated": null
    },
    {
        "urduURN": 4005550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 559,
        "hadithSanad": "ہم سے محمد بن مہران نے بیان کیا ، کہا ہم سے ولید بن مسلمہ نے ، انھوں نے کہا کہ ہم سے عبدالرحمٰن بن عمرو اوزاعی نے بیان کیا ، کہا مجھ سے ابوالنجاشی نے بیان کیا ، ان کا نام عطاء بن صہیب تھا اور یہ رافع بن خدیج رضی اللہ عنہ کے غلام ہیں ۔ انھوں نے کہا کہ میں نے رافع بن خدیج سے سنا",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہم مغرب کی نماز نبی کریم صلی اللہ علیہ وسلم کے ساتھ پڑھ کر جب واپس ہوتے اور تیراندازی کرتے ( تو اتنا اجالا باقی رہتا تھا کہ ) ایک شخص اپنے تیر گرنے کی جگہ کو دیکھتا تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 105580,
        "last_updated": null
    },
    {
        "urduURN": 4005560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 560,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ، کہا ہم سے محمد بن جعفر نے ، کہا ہم سے شعبہ بن حجاج نے سعد بن ابراہیم سے ، انھوں نے محمد بن عمرو بن حسن بن علی سے ، انھوں نے کہا کہ",
        "hadithText": "حجاج کا زمانہ آیا ( اور وہ نماز دیر کر کے پڑھایا کرتا تھا اس لیے ) ہم نے حضرت جابر بن عبداللہ رضی اللہ عنہما سے اس کے بارے میں پوچھا تو انھوں نے فرمایا کہ نبی کریم صلی اللہ علیہ وسلم ظہر کی نماز ٹھیک دوپہر میں پڑھایا کرتے تھے ۔ ابھی سورج صاف اور روشن ہوتا تو نماز عصر پڑھاتے ۔ نماز مغرب وقت آتے ہی پڑھاتے اور نماز عشاء کو کبھی جلدی پڑھاتے اور کبھی دیر سے ۔ جب دیکھتے کہ لوگ جمع ہو گئے ہیں تو جلدی پڑھا دیتے اور اگر لوگ جلدی جمع نہ ہوتے تو نماز میں دیر کرتے ۔ ( اور لوگوں کا انتظار کرتے ) اور صبح کی نماز صحابہ رضی اللہ عنہم یا ( یہ کہا کہ ) نبی کریم صلی اللہ علیہ وسلم اندھیرے میں پڑھتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 105590,
        "last_updated": null
    },
    {
        "urduURN": 4005570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 561,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ، انھوں نے کہا ہم سے یزید بن ابی عبید نے بیان کیا سلمہ بن اکوع رضی اللہ عنہ سے ، فرمایا کہ",
        "hadithText": "ہم نماز مغرب نبی کریم صلی اللہ علیہ وسلم کے ساتھ اس وقت پڑھتے تھے جب سورج پردے میں چھپ جاتا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 105600,
        "last_updated": null
    },
    {
        "urduURN": 4005580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 562,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا ہم سے عمرو بن دینار نے بیان کیا ، کہا میں نے جابر بن زید سے سنا ، وہ ابن عباس رضی اللہ عنہما کے واسطے سے بیان کرتے تھے ۔ آپ نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سات رکعات ( مغرب اور عشاء کی ) ایک ساتھ آٹھ رکعات ( ظہر اور عصر کی نمازیں ) ایک ساتھ پڑھیں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 105610,
        "last_updated": null
    },
    {
        "urduURN": 4005590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 563,
        "hadithSanad": "ہم سے ابومعمر نے بیان کیا ، جو عبداللہ بن عمرو ہیں ، کہا ہم سے عبدالوارث بن سعید نے حسین بن ذکوان سے بیان کیا ، کہا ہم سے عبداللہ بن بریدہ نے ، کہا مجھ سے عبداللہ مزنی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، ایسا نہ ہو کہ ’’ مغرب ‘‘ کی نماز کے نام کے لیے اعراب ( یعنی دیہاتی لوگوں ) کا محاورہ تمہاری زبانوں پر چڑھ جائے ۔ عبداللہ بن مغفل رضی اللہ عنہ نے کہا یا خود آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بدوی مغرب کو عشاء کہتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 105620,
        "last_updated": null
    },
    {
        "urduURN": 4005600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 564,
        "hadithSanad": "ہم سے عبدان عبداللہ بن عثمان نے بیان کیا ، انھوں نے کہا ہمیں عبداللہ بن مبارک نے خبر دی ، انھوں نے کہا ہمیں یونس بن یزید نے خبر دی زہری سے کہ سالم نے یہ کہا کہ مجھے ( میرے باپ ) عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "ایک رات نبی کریم صلی اللہ علیہ وسلم نے ہمیں عشاء کی نماز پڑھائی ۔ یہی جسے لوگ «عتمه» کہتے ہیں ۔ پھر ہمیں خطاب کرتے ہوئے فرمایا کہ تم اس رات کو یاد رکھنا ۔ آج جو لوگ زندہ ہیں ایک سو سال کے گزرنے تک روئے زمین پر ان میں سے کوئی بھی باقی نہیں رہے گا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 105630,
        "last_updated": null
    },
    {
        "urduURN": 4005610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 565,
        "hadithSanad": "ہم سے مسلم بن ابراہیم نے بیان کیا ، کہا ہم سے شعبہ حجاج نے سعد بن ابراہیم سے بیان کیا ، وہ محمد بن عمرو سے جو حسن بن علی بن ابی طالب کے بیٹے ہیں ، فرمایا کہ",
        "hadithText": "ہم نے جابر بن عبداللہ رضی اللہ عنہما سے نبی کریم صلی اللہ علیہ وسلم کی نماز کے بارے میں دریافت کیا ۔ تو آپ نے فرمایا کہ آپ نماز ظہر دوپہر میں پڑھتے تھے ۔ اور جب نماز عصر پڑھتے تو سورج صاف روشن ہوتا ۔ مغرب کی نماز واجب ہوتے ہی ادا فرماتے ، اور ’’ عشاء ‘‘ میں اگر لوگ جلدی جمع ہو جاتے تو جلدی پڑھ لیتے اور اگر آنے والوں کی تعداد کم ہوتی تو دیر کرتے ۔ اور صبح کی نماز منہ اندھیرے میں پڑھا کرتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 105640,
        "last_updated": null
    },
    {
        "urduURN": 4005620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 566,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے عقیل کے واسطے سے بیان کیا ، انھوں نے ابن شہاب سے ، انھوں نے عروہ سے کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
        "hadithText": "ایک رات رسول کریم صلی اللہ علیہ وسلم نے عشاء کی نماز دیر سے پڑھی ۔ یہ اسلام کے پھیلنے سے پہلے کا واقعہ ہے ۔ آپ صلی اللہ علیہ وسلم اس وقت تک باہر تشریف نہیں لائے جب تک حضرت عمر رضی اللہ عنہ نے یہ نہ فرمایا کہ عورتیں اور بچے سو گئے ۔ پس آپ صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تمہارے علاوہ دنیا میں کوئی بھی انسان اس نماز کا انتظار نہیں کرتا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 105650,
        "last_updated": null
    },
    {
        "urduURN": 4005630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 567,
        "hadithSanad": "ہم سے محمد بن علاء نے بیان کیا کہا ہم سے ابواسامہ نے برید کے واسطہ سے ، انھوں نے ابربردہ سے انھوں نے حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے ، آپ نے فرمایا کہ",
        "hadithText": "میں نے اپنے ان ساتھیوں کے ساتھ جو کشتی میں میرے ساتھ ( حبشہ سے ) آئے تھے ’’ بقیع بطحان ‘‘ میں قیام کیا ۔ اس وقت نبی کریم صلی اللہ علیہ وسلم مدینہ میں تشریف رکھتے تھے ۔ ہم میں سے کوئی نہ کوئی عشاء کی نماز میں روزانہ باری مقرر کر کے نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا کرتا تھا ۔ اتفاق سے میں اور میرے ایک ساتھی ایک مرتبہ آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ۔ آپ صلی اللہ علیہ وسلم اپنے کسی کام میں مشغول تھے ۔ ( کسی ملی معاملہ میں آپ صلی اللہ علیہ وسلم اور حضرت ابوبکر صدیق رضی اللہ عنہ گفتگو فرما رہے تھے ) جس کی وجہ سے نماز میں دیر ہو گئی اور تقریباً آدھی رات گزر گئی ۔ پھر نبی کریم صلی اللہ علیہ وسلم تشریف لائے اور نماز پڑھائی ۔ نماز پوری کر چکے تو حاضرین سے فرمایا کہ اپنی اپنی جگہ پر وقار کے ساتھ بیٹھے رہو اور ایک خوشخبری سنو ۔ تمہارے سوا دنیا میں کوئی بھی ایسا آدمی نہیں جو اس وقت نماز پڑھتا ہو ، یا آپ صلی اللہ علیہ وسلم نے یہ فرمایا کہ تمہارے سوا اس وقت کسی ( امت ) نے بھی نماز نہیں پڑھی تھی ۔ یہ یقین نہیں کہ آپ نے ان دو جملوں میں سے کون سا جملہ کہا تھا ۔ پھر راوی نے کہا کہ ابوموسیٰ رضی اللہ عنہ نے فرمایا ۔ پس ہم نبی کریم صلی اللہ علیہ وسلم سے یہ سن کر بہت ہی خوش ہو کر لوٹے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 105660,
        "last_updated": null
    },
    {
        "urduURN": 4005640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 568,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، انھوں نے کہا ہم سے عبدالوہاب ثقفی نے بیان کیا ، انھوں نے کہا کہ ہم سے خالد حذاء نے بیان کیا ابوالمنہال سے ، انھوں نے ابوبرزہ اسلمی رضی اللہ عنہ سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم عشاء سے پہلے سونے اور اس کے بعد بات چیت کرنے کو ناپسند فرماتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 105670,
        "last_updated": null
    },
    {
        "urduURN": 4005650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 569,
        "hadithSanad": "ہم سے ایوب بن سلیمان نے بیان کیا ، کہا ہم سے ابوبکرنے سلیمان سے ، ان سے صالح بن کیسان نے بیان کیا کہ مجھے ابن شہاب نے عروہ سے خبر دی کہ حضرت عائشہ رضی اللہ عنہا نے بتلایا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے ایک دفعہ عشاء کی نماز میں دیر فرمائی ۔ یہاں تک کہ عمر رضی اللہ عنہ نے پکارا ، نماز ! عورتیں اور بچے سب سو گئے ۔ تب آپ صلی اللہ علیہ وسلم گھر سے باہر تشریف لائے ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ روئے زمین پر تمہارے علاوہ اور کوئی اس نماز کا انتظار نہیں کرتا ۔ راوی نے کہا ، اس وقت یہ نماز ( باجماعت ) مدینہ کے سوا اور کہیں نہیں پڑھی جاتی تھی ۔ صحابہ اس نماز کو شام کی سرخی کے غائب ہونے کے بعد رات کے پہلے تہائی حصہ تک ( کسی وقت بھی ) پڑھتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 105680,
        "last_updated": null
    },
    {
        "urduURN": 4005660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 570,
        "hadithSanad": "ہم سے محمود نے بیان کیا ، انھوں نے کہا ہم سے عبدالرزاق نے بیان کیا ، انھوں نے کہا ہمیں ابن جریج نے خبر دی ، انھوں نے کہا کہ مجھے نافع نے خبر دی ، انھوں نے کہا مجھے عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم ایک رات کسی کام میں مشغول ہو گئے اور بہت دیر کی ۔ ہم ( نماز کے انتظار میں بیٹھے ہوئے ) مسجد ہی میں سو گئے ، پھر ہم بیدار ہوئے ، پھر ہم سو گئے ، پھر ہم بیدار ہوئے ۔ پھر نبی کریم صلی اللہ علیہ وسلم گھر سے باہر تشریف لائے اور فرمایا کہ دنیا کا کوئی شخص بھی تمہارے سوا اس نماز کا انتظار نہیں کرتا ۔ اگر نیند کا غلبہ نہ ہوتا تو ابن عمر رضی اللہ عنہما عشاء کو پہلے پڑھنے یا بعد میں پڑھنے کو کوئی اہمیت نہیں دیتے تھے ۔ کبھی نماز عشاء سے پہلے آپ سو بھی لیتے تھے ۔ ابن جریج نے کہا میں نے عطاء سے معلوم کیا ۔\nمیں نے حضرت عبداللہ بن عباس رضی اللہ عنہما سے سنا تھا کہ نبی کریم صلی اللہ علیہ وسلم نے ایک رات عشاء کی نماز میں دیر کی جس کے نتیجہ میں لوگ ( مسجد ہی میں ) سو گئے ۔ پھر بیدار ہوئے پھر سو گئے ‘ پھر بیدار ہوئے ۔ آخر میں عمر بن خطاب رضی اللہ عنہ اٹھے اور پکارا ’’ نماز ‘‘ عطاء نے کہا کہ ابن عباس رضی اللہ عنہما نے بتلایا کہ اس کے بعد نبی کریم صلی اللہ علیہ وسلم گھر سے تشریف لائے ۔ وہ منظر میری نگاہوں کے سامنے ہے جب کہ آپ صلی اللہ علیہ وسلم کے سرمبارک سے پانی کے قطرے ٹپک رہے تھے اور آپ ہاتھ سر پر رکھے ہوئے تھے ۔ آپ نے فرمایا کہ اگر میری امت کے لیے مشکل نہ ہو جاتی ، تو میں انہیں حکم دیتا کہ عشاء کی نماز کو اسی وقت پڑھیں ۔ میں نے عطاء سے مزید تحقیق چاہی کہ نبی کریم صلی اللہ علیہ وسلم کے ہاتھ سر پر رکھنے کی کیفیت کیا تھی ؟ ابن عباس رضی اللہ عنہما نے انہیں اس سلسلے میں کس طرح خبر دی تھی ۔ اس پر حضرت عطاء نے اپنے ہاتھ کی انگلیاں تھوڑی سی کھول دیں اور انہیں سر کے ایک کنارے پر رکھا پھر انہیں ملا کر یوں سر پر پھیرنے لگے کہ ان کا انگوٹھا کان کے اس کنارے سے جو چہرے سے قریب ہے اور داڑھی سے جا لگا ۔ نہ سستی کی اور نہ جلدی ، بلکہ اس طرح کیا اور کہا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر میری امت پر مشکل نہ گزرتی تو میں حکم دیتا کہ اس نماز کو اسی وقت پڑھا کریں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 105691,
        "last_updated": null
    },
    {
        "urduURN": 4005680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 572,
        "hadithSanad": "ہم سے عبدالرحیم محاربی نے بیان کیا ، کہا ہم سے زائدہ نے حمید طویل سے ، انھوں نے حضرت انس رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ( ایک دن ) عشاء کی نماز آدھی رات گئے پڑھی ۔ اور فرمایا کہ دوسرے لوگ نماز پڑھ کر سو گئے ہوں گے ۔ ( یعنی دوسری مساجد میں پڑھنے والے مسلمان ) اور تم لوگ جب تک نماز کا انتظار کرتے رہے ( گویا سارے وقت ) نماز ہی پڑھتے رہے ۔ ابن مریم نے اس میں یہ زیادہ کیا کہ ہمیں یحییٰ بن ایوب نے خبر دی ۔ کہا مجھ سے حمید طویل نے بیان کیا ، انھوں نے حضرت انس رضی اللہ عنہ سے یہ سنا ، گویا اس رات آپ کی انگوٹھی کی چمک کا نقشہ اس وقت بھی میری نظروں کے سامنے چمک رہا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 105710,
        "last_updated": null
    },
    {
        "urduURN": 4005690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 573,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے اسماعیل سے ، کہا ہم سے قیس نے بیان کیا ، کہا مجھ سے جریر بن عبداللہ نے بیان کیا ، کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے آپ صلی اللہ علیہ وسلم نے چاند کی طرف نظر اٹھائی جو چودھویں رات کا تھا ۔ پھر فرمایا کہ تم لوگ بے ٹوک اپنے رب کو اسی طرح دیکھو گے جیسے اس چاند کو دیکھ رہے ہو ( اسے دیکھنے میں تم کو کسی قسم کی بھی مزاحمت نہ ہو گی ) یا یہ فرمایا کہ تمہیں اس کے دیدار میں مطلق شبہ نہ ہو گا اس لیے اگر تم سے سورج کے طلوع اور غروب سے پہلے ( فجر اور عصر ) کی نمازوں کے پڑھنے میں کوتاہی نہ ہو سکے تو ایسا ضرور کرو ۔ ( کیونکہ ان ہی کے طفیل دیدار الٰہی نصیب ہو گا یا ان ہی وقتوں میں یہ رویت ملے گی ) پھر آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی «فسبح بحمد ربك قبل طلوع الشمس وقبل غروبها» ’’ پس اپنے رب کے حمد کی تسبیح پڑھ سورج کے نکلنے اور اس کے غروب ہونے سے پہلے ۔ ‘‘ امام ابوعبداللہ بخاری رحمہ اللہ علیہ نے کہا کہ ابن شہاب نے اسماعیل کے واسطہ سے جو قیس سے بواسطہ جریر ( راوی ہیں ) یہ زیادتی نقل کی کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ’’ تم اپنے رب کو صاف دیکھو گے ‘‘ ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 105720,
        "last_updated": null
    },
    {
        "urduURN": 4005700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 574,
        "hadithSanad": "ہم سے ہدبہ بن خالد نے بیان کیا ، کہا ہم سے ہمام نے ، انھوں نے کہا کہ ہم سے ابوجمرہ نے بیان کیا ، ابوبکر بن ابی موسیٰ اشعری رضی اللہ عنہ سے ، انھوں نے اپنے باپ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے ٹھنڈے وقت کی دو نمازیں ( وقت پر ) پڑھیں ( فجر اور عصر ) تو وہ جنت میں داخل ہو گا ۔ ابن رجاء نے کہا کہ ہم سے ہمام نے ابوجمرہ سے بیان کیا کہ ابوبکر بن عبداللہ بن قیس رضی اللہ عنہ نے انہیں اس حدیث کی خبر دی ۔ ہم سے اسحاق نے بیان کیا ، کہا ہم سے حبان نے ، انھوں نے کہا کہ ہم سے ہمام نے بیان کیا ، کہا ہم سے ابوجمرہ نے بیان کیا ابوبکر بن عبداللہ رضی اللہ عنہ سے ، انھوں نے اپنے والد سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ، پہلی حدیث کی طرح ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 105731,
        "last_updated": null
    },
    {
        "urduURN": 4005710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 575,
        "hadithSanad": "ہم سے عمرو بن عاصم نے یہ حدیث بیان کی ، کہا ہم سے ہمام نے یہ حدیث بیان کی قتادہ سے ، انھوں نے انس رضی اللہ عنہ سے کہ یزید بن ثابت رضی اللہ عنہ نے ان سے بیان کیا کہ",
        "hadithText": "ان لوگوں نے ( ایک مرتبہ ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ سحری کھائی ، پھر نماز کے لیے کھڑے ہو گئے ۔ میں نے دریافت کیا کہ ان دونوں کے درمیان کس قدر فاصلہ رہا ہو گا ۔ فرمایا کہ جتنا پچاس یا ساٹھ آیت پڑھنے میں صرف ہوتا ہے اتنا فاصلہ تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 105750,
        "last_updated": null
    },
    {
        "urduURN": 4005720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 576,
        "hadithSanad": "ہم سے حسن بن صباح نے یہ حدیث بیان کی ، انھوں نے روح بن عبادہ سے سنا ، انھوں نے کہا ہم سے سعید نے بیان کیا ، انھوں نے قتادہ سے روایت کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم اور زید بن ثابت رضی اللہ عنہ نے سحری کھائی ، پھر جب وہ سحری کھا کر فارغ ہوئے تو نماز کے لیے اٹھے اور نماز پڑھی ۔ ہم نے انس رضی اللہ عنہ سے پوچھا کہ آپ کی سحری سے فراغت اور نماز کی ابتداء میں کتنا فاصلہ تھا ؟ انھوں نے فرمایا کہ اتنا کہ ایک شخص پچاس آیتیں پڑھ سکے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 105760,
        "last_updated": null
    },
    {
        "urduURN": 4005730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 577,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا اپنے بھائی عبدالحمید بن ابی اویس سے ، انھوں نے سلیمان بن بلال سے ، انھوں نے ابی حازم سلمہ بن دینار سے کہ انھوں نے سہل بن سعد رضی اللہ عنہ صحابی سے سنا ۔ آپ نے فرمایا کہ",
        "hadithText": "میں اپنے گھر سحری کھاتا ، پھر نبی کریم صلی اللہ علیہ وسلم کے ساتھ نماز فجر پانے کے لیے مجھے جلدی کرنی پڑتی تھی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 105770,
        "last_updated": null
    },
    {
        "urduURN": 4005740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 578,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہمیں لیث نے خبر دی ، انھوں نے عقیل بن خالد سے ، انھوں نے ابن شہاب سے ، انھوں نے کہا کہ مجھے عروہ بن زبیر رضی اللہ عنہ نے خبر دی کہ ام المؤمنین حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ",
        "hadithText": "مسلمان عورتیں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز فجر پڑھنے چادروں میں لپٹ کر آتی تھیں ۔ پھر نماز سے فارغ ہو کر جب اپنے گھروں کو واپس ہوتیں تو انہیں اندھیرے کی وجہ سے کوئی شخص پہچان نہیں سکتا تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 105780,
        "last_updated": null
    },
    {
        "urduURN": 4005750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 579,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا امام مالک سے ، انھوں نے زید بن اسلم سے ، انھوں نے عطاء بن یسار اور بسر بن سعید اور عبدالرحمٰن بن ہرمز اعرج سے ، ان تینوں نے ابوہریرہ رضی اللہ عنہ کے واسطے سے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے فجر کی ایک رکعت ( جماعت کے ساتھ ) سورج نکلنے سے پہلے پا لی اس نے فجر کی نماز ( باجماعت کا ثواب ) پا لیا ۔ اور جس نے عصر کی ایک رکعت ( جماعت کے ساتھ ) سورج ڈوبنے سے پہلے پا لی ، اس نے عصر کی نماز ( باجماعت کا ثواب ) پا لیا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 105790,
        "last_updated": null
    },
    {
        "urduURN": 4005760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 580,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے امام مالک نے ابن شہاب سے ، انھوں نے ابوسلمہ بن عبدالرحمٰن بن عوف رضی اللہ عنہ سے انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے ایک رکعت نماز ( باجماعت ) پا لی اس نے نماز ( باجماعت کا ثواب ) پا لیا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 105800,
        "last_updated": null
    },
    {
        "urduURN": 4005770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 581,
        "hadithSanad": "ہم سے حفص بن عمر نے بیان کیا ، انھوں نے کہا ہم سے ہشام دستوائی نے بیان کیا ، انھوں نے قتادہ بن دعامہ سے ، انھوں نے ابوالعالیہ رفیع سے ، انھوں نے ابن عباس رضی اللہ عنہما سے ، فرمایا کہ",
        "hadithText": "میرے سامنے چند معتبر حضرات نے گواہی دی ، جن میں سب سے زیادہ معتبر میرے نزدیک حضرت عمر رضی اللہ عنہ تھے ، کہ نبی کریم صلی اللہ علیہ وسلم نے فجر کی نماز کے بعد سورج بلند ہونے تک اور عصر کی نماز کے بعد سورج ڈوبنے تک نماز پڑھنے سے منع فرمایا ۔ ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے شعبہ سے ، انھوں نے قتادہ سے کہ میں نے ابوالعالیہ سے سنا ، وہ ابن عباس رضی اللہ عنہما سے بیان کرتے تھے کہ انھوں نے فرمایا کہ مجھ سے چند لوگوں نے یہ حدیث بیان کی ۔ ( جو پہلے ذکر ہوئی ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4005780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 582,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ہشام بن عروہ سے ، انھوں نے کہا کہ مجھے میرے والد عروہ نے خبر دی ، انھوں نے کہا کہ مجھے عبداللہ بن عمر رضی اللہ عنہما نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ نماز پڑھنے کے لیے سورج کے طلوع اور غروب ہونے کے انتظار میں نہ بیٹھے رہو ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 0,
        "matchingArabicURN": 0,
        "last_updated": null
    },
    {
        "urduURN": 4005790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 583,
        "hadithSanad": "حضرت عروہ نے کہا مجھ سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جب سورج کا اوپر کا کنارہ طلوع ہونے لگے تو نماز نہ پڑھو یہاں تک کہ وہ بلند ہو جائے ۔ اور جب سورج ڈوبنے لگے اس وقت بھی نماز نہ پڑھو ، یہاں تک کہ غروب ہو جائے ۔ اس حدیث کو یحییٰ بن سعید قطان کے ساتھ عبدہ بن سلیمان نے بھی روایت کیا ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 105831,
        "last_updated": null
    },
    {
        "urduURN": 4005800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 584,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ، انھوں نے ابی اسامہ کے واسطے سے بیان کیا ۔ انھوں نے عبیداللہ بن عمر سے ، انھوں نے خبیب بن عبدالرحمٰن سے ، انھوں نے حفص بن عاصم سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دو طرح کی خریدوفروخت اور دو طرح کے لباس اور دو وقتوں کی نمازوں سے منع فرمایا ۔ آپ صلی اللہ علیہ وسلم نے نماز فجر کے بعد سورج نکلنے تک اور نماز عصر کے بعد غروب ہونے تک نماز پڑھنے سے منع فرمایا ( اور کپڑوں میں ) اشتمال صماء یعنی ایک کپڑا اپنے اوپر اس طرح لپیٹ لینا کہ شرمگاہ کھل جائے ۔ اور ( احتباء ) یعنی ایک کپڑے میں گوٹ مار کر بیٹھنے سے منع فرمایا ۔ ( اور خریدوفروخت میں ) آپ صلی اللہ علیہ وسلم نے منابذہ اور ملامسہ سے منع فرمایا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 105850,
        "last_updated": null
    },
    {
        "urduURN": 4005810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 585,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہ کہا ہمیں امام مالک نے نافع سے خبر دی ، انھوں نے ابن عمر رضی اللہ عنہما سے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی تم میں سے انتظار میں نہ بیٹھا رہے کہ سورج طلوع ہوتے ہی نماز کے لیے کھڑا ہو جائے ۔ اسی طرح سورج کے ڈوبنے کے انتظار میں بھی نہ رہنا چاہیے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 105860,
        "last_updated": null
    },
    {
        "urduURN": 4005820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 586,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ، انھوں نے صالح سے یہ حدیث بیان کی ، انھوں نے ابن شہاب سے ، انھوں نے کہا مجھ سے عطاء بن یزید جندعی لیثی نے بیان کیا کہ انھوں نے حضرت ابو سعید خدری رضی اللہ عنہ سے سنا ۔ انھوں نے فرمایا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ فجر کی نماز کے بعد کوئی نماز سورج کے بلند ہونے تک نہ پڑھی جائے ۔ اسی طرح عصر کی نماز کے بعد سورج ڈوبنے تک کوئی نماز نہ پڑھی جائے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 105870,
        "last_updated": null
    },
    {
        "urduURN": 4005830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 587,
        "hadithSanad": "ہم سے محمد بن ابان نے بیان کیا ، کہا کہ ہم سے غندر محمد بن جعفر نے بیان کیا ، کہا کہ ہم سے شعبہ نے حدیث بیان کی ابوالتیاح یزید بن حمید سے ، کہا کہ میں نے حمران بن ابان سے سنا ، وہ معاویہ بن ابی سفیان رضی اللہ عنہما سے یہ حدیث بیان کرتے تھے کہ",
        "hadithText": "انھوں نے فرمایا کہ تم لوگ تو ایک ایسی نماز پڑھتے ہو کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی صحبت میں رہے لیکن ہم نے کبھی آپ صلی اللہ علیہ وسلم کو وہ نماز پڑھتے نہیں دیکھا ۔ بلکہ آپ صلی اللہ علیہ وسلم نے تو اس سے منع فرمایا تھا ۔ حضرت معاویہ رضی اللہ عنہ کی مراد عصر کے بعد دو رکعتوں سے تھی ۔ ( جسے آپ کے زمانہ میں بعض لوگ پڑھتے تھے ) ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 105880,
        "last_updated": null
    },
    {
        "urduURN": 4005840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 588,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ، انھوں نے کہا کہ ہم سے عبدہ نے بیان کیا ، انھوں نے عبیداللہ سے خبر دی ، انھوں نے خبیب سے ، انھوں نے حفص بن عاصم سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دو وقت نماز پڑھنے سے منع فرمایا ۔ نماز فجر کے بعد سورج نکلنے تک اور نماز عصر کے بعد سورج غروب ہونے تک ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 105890,
        "last_updated": null
    },
    {
        "urduURN": 4005850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 589,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، کہا ہم سے حماد بن زید نے ایوب سے کہا ، انھوں نے نافع سے ، انھوں نے ابن عمر رضی اللہ عنہما سے ، آپ نے فرمایا کہ",
        "hadithText": "جس طرح میں نے اپنے ساتھیوں کو نماز پڑھتے دیکھا ۔ میں بھی اسی طرح نماز پڑھتا ہوں ۔ کسی کو روکتا نہیں ۔ دن اور رات کے جس حصہ میں جی چاہے نماز پڑھ سکتا ہے ۔ البتہ سورج کے طلوع اور غروب کے وقت نماز نہ پڑھا کرو ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 105900,
        "last_updated": null
    },
    {
        "urduURN": 4005860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 590,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ، کہ کہا ہم سے عبدالواحد بن ایمن نے بیان کیا ، کہا کہ مجھ سے میرے باپ ایمن نے حدیث بیان کی کہ انھوں نے عائشہ رضی اللہ عنہا سے سنا ۔ آپ نے فرمایا کہ",
        "hadithText": "خدا کی قسم ! جس نے رسول اللہ صلی اللہ علیہ وسلم کو اپنے یہاں بلا لیا ۔ آپ صلی اللہ علیہ وسلم نے عصر کے بعد کی دو رکعات کو کبھی ترک نہیں فرمایا ، یہاں تک کہ آپ صلی اللہ علیہ وسلم ، اللہ پاک سے جا ملے ۔ اور آپ صلی اللہ علیہ وسلم کو وفات سے پہلے نماز پڑھنے میں بڑی دشواری پیش آتی تھی ۔ پھر اکثر آپ صلی اللہ علیہ وسلم بیٹھ کر نماز ادا فرمایا کرتے تھے ۔ اگرچہ نبی کریم صلی اللہ علیہ وسلم انہیں پوری پابندی کے ساتھ پڑھتے تھے لیکن اس خوف سے کہ کہیں ( صحابہ بھی پڑھنے لگیں اور اس طرح ) امت کو گراں باری ہو ، انہیں آپ صلی اللہ علیہ وسلم مسجد میں نہیں پڑھتے تھے ۔ آپ صلی اللہ علیہ وسلم کو اپنی امت کا ہلکا رکھنا پسند تھا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 105910,
        "last_updated": null
    },
    {
        "urduURN": 4005870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 591,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ قطان نے بیان کیا ، کہا ہم سے ہشام بن عروہ نے بیان کیا ، کہا کہ مجھے میرے باپ عروہ نے خبر دی ، کہا کہ عائشہ رضی اللہ عنہا نے فرمایا",
        "hadithText": "میرے بھانجے ! نبی کریم صلی اللہ علیہ وسلم نے عصر کے بعد کی دو رکعات میرے یہاں کبھی ترک نہیں کیں ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 105920,
        "last_updated": null
    },
    {
        "urduURN": 4005880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 592,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے عبدالواحد بن زیاد نے بیان کیا ، کہا ہم سے شیبانی نے بیان کیا ، کہا ہم سے عبدالرحمٰن بن اسود نے بیان کیا ، انھوں نے اپنے باپ سے ، انھوں نے حضرت عائشہ رضی اللہ عنہا سے کہ",
        "hadithText": "آپ نے فرمایا کہ دو رکعتوں کو رسول اللہ صلی اللہ علیہ وسلم نے کبھی ترک نہیں فرمایا ۔ پوشیدہ ہو یا عام لوگوں کے سامنے ، صبح کی نماز سے پہلے دو رکعات اور عصر کی نماز کے بعد دو رکعات ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 105930,
        "last_updated": null
    },
    {
        "urduURN": 4005890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 593,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے ابواسحاق سے بیان کیا ، کہا کہ ہم نے اسود بن یزید اور مسروق بن اجدع کو دیکھا کہ",
        "hadithText": "انھوں نے حضرت عائشہ رضی اللہ عنہا کے اس کہنے پر گواہی دی کہ نبی کریم صلی اللہ علیہ وسلم جب بھی میرے گھر میں عصر کے بعد تشریف لائے تو دو رکعت ضرور پڑھتے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 105940,
        "last_updated": null
    },
    {
        "urduURN": 4005900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 594,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، انھوں نے کہا کہ ہم سے ہشام دستوائی نے یحییٰ بن ابی کثیر سے بیان کیا ، وہ قلابہ سے نقل کرتے ہیں کہ ابوالملیح عامر بن اسامہ ہذلی نے ان سے بیان کیا ، انھوں نے کہا کہ",
        "hadithText": "ہم ابر کے دن ایک مرتبہ بریدہ بن حصیب رضی اللہ عنہ صحابی کے ساتھ تھے ، انھوں نے فرمایا کہ نماز سویرے پڑھا کرو ۔ کیونکہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس نے عصر کی نماز چھوڑی اس کا عمل اکارت ہو گیا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 105950,
        "last_updated": null
    },
    {
        "urduURN": 4005910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 595,
        "hadithSanad": "ہم سے عمران بن میسرہ نے روایت کیا ، کہا ہم سے محمد بن فضیل نے بیان کیا ، کہا کہ ہم سے حصین بن عبدالرحمٰن نے عبداللہ بن ابی قتادہ سے ، انھوں نے اپنے باپ سے ، کہا",
        "hadithText": "ہم ( خیبر سے لوٹ کر ) نبی کریم صلی اللہ علیہ وسلم کے ساتھ رات میں سفر کر رہے تھے ۔ کسی نے کہا کہ حضور ! آپ اب پڑاؤ ڈال دیتے تو بہتر ہوتا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ڈر ہے کہ کہیں نماز کے وقت بھی تم سوتے نہ رہ جاؤ ۔ اس پر حضرت بلال رضی اللہ عنہ بولے کہ میں آپ سب لوگوں کو جگا دوں گا ۔ چنانچہ سب لوگ لیٹ گئے ۔ اور حضرت بلال رضی اللہ عنہ نے بھی اپنی پیٹھ کجاوہ سے لگا لی ۔ اور ان کی بھی آنکھ لگ گئی اور جب نبی کریم صلی اللہ علیہ وسلم بیدار ہوئے تو سورج کے اوپر کا حصہ نکل چکا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا بلال ! تو نے کیا کہا تھا ۔ وہ بولے آج جیسی نیند مجھے کبھی نہیں آئی ۔ پھر رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہاری ارواح کو جب چاہتا ہے قبض کر لیتا ہے اور جس وقت چاہتا ہے واپس کر دیتا ہے ۔ اے بلال ! اٹھ اور اذان دے ۔ پھر آپ صلی اللہ علیہ وسلم نے وضو کیا اور جب سورج بلند ہو کر روشن ہو گیا تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور نماز پڑھائی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 105960,
        "last_updated": null
    },
    {
        "urduURN": 4005920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 596,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے حدیث نقل کی ، انھوں نے کہا ہم سے ہشام دستوائی نے بیان کیا ، انھوں نے یحییٰ بن ابی کثیر سے روایت کیا ، انھوں نے ابوسلمہ بن عبدالرحمٰن سے ، انھوں نے جابر بن عبداللہ رضی اللہ عنہما سے کہ",
        "hadithText": "حضرت عمر بن خطاب رضی اللہ عنہ غزوہ خندق کے موقع پر ( ایک مرتبہ ) سورج غروب ہونے کے بعد آئے اور وہ کفار قریش کو برا بھلا کہہ رہے تھے ۔ اور آپ نے کہا کہ اے اللہ کے رسول ! سورج غروب ہو گیا ، اور نماز عصر پڑھنا میرے لیے ممکن نہ ہو سکا ۔ اس پر رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ نماز میں نے بھی نہیں پڑھی ۔ پھر ہم وادی بطحان میں گئے اور آپ صلی اللہ علیہ وسلم نے وہاں نماز کے لیے وضو کیا ، ہم نے بھی وضو بنایا ۔ اس وقت سورج ڈوب چکا تھا ۔ پہلے آپ صلی اللہ علیہ وسلم نے عصر پڑھائی اس کے بعد مغرب کی نماز پڑھی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 105970,
        "last_updated": null
    },
    {
        "urduURN": 4005930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 597,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین اور موسیٰ بن اسماعیل نے بیان کیا ، ان دونوں نے کہا کہ ہم سے ہمام بن یحییٰ نے قتادہ سے بیان کیا ، انھوں نے انس بن مالک رضی اللہ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے کہ",
        "hadithText": "آپ صلی اللہ علیہ وسلم نے فرمایا اگر کوئی نماز پڑھنا بھول جائے تو جب بھی یاد آ جائے اس کو پڑھ لے ۔ اس قضاء کے سوا اور کوئی کفارہ اس کی وجہ سے نہیں ہوتا ۔ اور ( اللہ تعالیٰ نے فرمایا کہ ) نماز میرے یاد آنے پر قائم کر ۔ موسیٰ نے کہا کہ ہم سے ہمام نے حدیث بیان کی کہ میں نے قتادہ رضی اللہ عنہ سے سنا وہ یوں پڑھتے تھے نماز پڑھ میری یاد کے لیے ۔ حبان بن ہلال نے کہا ، ہم سے ہمام نے بیان کیا ، کہا ہم سے قتادہ نے ، کہا ہم سے انس رضی اللہ عنہ نے ، انھوں نے آنحضرت صلی اللہ علیہ وسلم سے ، پھر ایسی ہی حدیث بیان کی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 105981,
        "last_updated": null
    },
    {
        "urduURN": 4005940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 598,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا کہ ہم سے یحییٰ بن سعید قطان نے ، کہا کہ ہم سے ہشام دستوائی نے حدیث بیان کی ، کہا کہ ہم سے یحییٰ نے جو ابی کثیر کے بیٹے ہیں حدیث بیان کی ابوسلمہ سے ، انھوں نے جابر رضی اللہ عنہ سے ، انھوں نے فرمایا کہ",
        "hadithText": "عمر رضی اللہ عنہ غزوہ خندق کے موقع پر ( ایک دن ) کفار کو برا بھلا کہنے لگے ۔ فرمایا کہ سورج غروب ہو گیا ، لیکن میں ( لڑائی کی وجہ سے ) نماز عصر نہ پڑھ سکا ۔ جابر رضی اللہ عنہ نے بیان کیا کہ پھر ہم وادی بطحان کی طرف گئے ۔ اور ( آپ صلی اللہ علیہ وسلم نے عصر کی نماز ) غروب شمس کے بعد پڑھی اس کے بعد مغرب پڑھی ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 106000,
        "last_updated": null
    },
    {
        "urduURN": 4005950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 599,
        "hadithSanad": "ہم سے مسدد بن مسرہد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید قطان نے ، کہا ہم سے عوف اعرابی نے ، کہا کہ ہم سے ابوالمنہال سیار بن سلامہ نے ، انھوں نے کہا کہ",
        "hadithText": "میں اپنے باپ سلامہ کے ساتھ ابوبرزہ اسلمی رضی اللہ عنہ کی خدمت میں حاضر ہوا ۔ ان سے میرے والد صاحب نے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم فرض نمازیں کس طرح ( یعنی کن کن اوقات میں ) پڑھتے تھے ۔ ہم سے اس کے بارے میں بیان فرمائیے ۔ انھوں نے فرمایا کہ آپ صلی اللہ علیہ وسلم «هجير» ( ظہر ) جسے تم صلوٰۃ اولیٰ کہتے ہو سورج ڈھلتے ہی پڑھتے تھے ۔ اور آپ صلی اللہ علیہ وسلم کے عصر پڑھنے کے بعد کوئی بھی شخص اپنے گھر واپس ہوتا اور وہ بھی مدینہ کے سب سے آخری کنارہ پر تو سورج ابھی صاف اور روشن ہوتا ۔ مغرب کے بارے میں آپ نے جو کچھ بتایا مجھے یاد نہیں رہا ۔ اور فرمایا کہ عشاء میں آپ صلی اللہ علیہ وسلم تاخیر پسند فرماتے تھے ۔ اس سے پہلے سونے کو اور اس کے بعد بات کرنے کو پسند نہیں کرتے تھے ۔ صبح کی نماز سے جب آپ صلی اللہ علیہ وسلم فارغ ہوتے تو ہم اپنے قریب بیٹھے ہوئے دوسرے شخص کو پہچان لیتے ۔ آپ صلی اللہ علیہ وسلم فجر میں ساٹھ سے سو تک آیتیں پڑھتے تھے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 106010,
        "last_updated": null
    },
    {
        "urduURN": 4005960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 600,
        "hadithSanad": "ہم سے عبداللہ بن صباح نے بیان کیا ، کہا ہم سے ابوعلی عبیداللہ حنفی نے ، کہا ہم سے قرہ بن خالد سدوسی نے ، انھوں نے کہا کہ",
        "hadithText": "ایک دن حضرت حسن بصری رحمہ اللہ نے بڑی دیر کی ۔ اور ہم آپ کا انتظار کرتے رہے ۔ جب ان کے اٹھنے کا وقت قریب ہو گیا تو آپ آئے اور ( بطور معذرت ) فرمایا کہ میرے ان پڑوسیوں نے مجھے بلا لیا تھا ( اس لیے دیر ہو گئی ) پھر بتلایا کہ انس بن مالک رضی اللہ عنہ نے کہا تھا کہ ہم ایک رات نبی کریم صلی اللہ علیہ وسلم کا انتظار کرتے رہے ۔ تقریباً آدھی رات ہو گئی تو آپ صلی اللہ علیہ وسلم تشریف لائے ، پھر ہمیں نماز پڑھائی ۔ اس کے بعد خطبہ دیا ۔ پس آپ نے فرمایا کہ دوسروں نے نماز پڑھ لی اور سو گئے ۔ لیکن تم لوگ جب تک نماز کے انتظار میں رہے ہو گویا نماز ہی کی حالت میں رہے ہو ۔ امام حسن بصری رحمہ اللہ نے فرمایا کہ اگر لوگ کسی خیر کے انتظار میں بیٹھے رہیں تو وہ بھی خیر کی حالت ہی میں ہیں ۔ قرہ بن خالد نے کہا کہ حسن کا یہ قول بھی حضرت انس رضی اللہ عنہ کی حدیث کا ہے جو انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ہے ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 106020,
        "last_updated": null
    },
    {
        "urduURN": 4005970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 601,
        "hadithSanad": "ہم سے ابوالیمان حکم بن نافع نے بیان کیا انھوں نے کہا کہ ہمیں شعیب بن ابی حمزہ نے زہری سے خبر دی ، کہا کہ مجھ سے سالم بن عبداللہ بن عمر رضی اللہ عنہما اور ابوبکر بن ابی حثمہ نے حدیث بیان کی کہ عبداللہ بن عمر رضی اللہ عنہما نے فرمایا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے عشاء کی نماز پڑھی اپنی زندگی کے آخری زمانے میں ۔ سلام پھیرنے کے بعد آپ کھڑے ہوئے اور فرمایا کہ اس رات کے متعلق تمہیں کچھ معلوم ہے ؟ آج اس روئے زمین پر جتنے انسان زندہ ہیں ۔ سو سال بعد ان میں سے کوئی بھی باقی نہیں رہے گا ۔ لوگوں نے آنحضور صلی اللہ علیہ وسلم کا کلام سمجھنے میں غلطی کی اور مختلف باتیں کرنے لگے ۔ ( ابومسعود رضی اللہ عنہ نے یہ سمجھا کہ سو برس بعد قیامت آئے گی ) حالانکہ آپ صلی اللہ علیہ وسلم کا مقصد صرف یہ تھا کہ جو لوگ آج ( اس گفتگو کے وقت ) زمین پر بستے ہیں ۔ ان میں سے کوئی بھی آج سے ایک صدی بعد باقی نہیں رہے گا ۔ آپ صلی اللہ علیہ وسلم کا مطلب یہ تھا کہ سو برس میں یہ قرن گزر جائے گا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 106030,
        "last_updated": null
    },
    {
        "urduURN": 4005980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 9,
        "bookName": "کتاب اوقات نماز کے بیان میں",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 602,
        "hadithSanad": "ہم سے ابوالنعمان محمد بن فضل نے بیان کیا ، کہا کہ ہم سے معتمر بن سلیمان نے بیان کیا ، ان سے ان کے باپ سلیمان بن طرخان نے ، کہا کہ ہم سے ابوعثمان نہدی نے عبدالرحمٰن بن ابی بکر رضی اللہ عنہما سے یہ حدیث بیان کی کہ",
        "hadithText": "اصحاب صفہ نادار مسکین لوگ تھے اور نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ جس کے گھر میں دو آدمیوں کا کھانا ہو تو وہ تیسرے ( اصحاب صفہ میں سے کسی ) کو اپنے ساتھ لیتا جائے ۔ اور جس کے ہاں چار آدمیوں کا کھانا ہے تو وہ پانچویں یا چھٹے آدمی کو سائبان والوں میں سے اپنے ساتھ لے جائے ۔ پس ابوبکر رضی اللہ عنہ تین آدمی اپنے ساتھ لائے ۔ اور نبی کریم صلی اللہ علیہ وسلم دس آدمیوں کو اپنے ساتھ لے گئے ۔ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ گھر کے افراد میں اس وقت باپ ، ماں اور میں تھا ۔ ابوعثمان راوی کا بیان ہے کہ مجھے یاد نہیں کہ عبدالرحمٰن بن ابی بکر نے یہ کہا یا نہیں کہ میری بیوی اور ایک خادم جو میرے اور ابوبکر رضی اللہ عنہ دونوں کے گھر کے لیے تھا یہ بھی تھے ۔ خیر ابوبکر رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے یہاں ٹھہر گئے ۔ ( اور غالباً کھانا بھی وہیں کھایا ۔ صورت یہ ہوئی کہ ) نماز عشاء تک وہیں رہے ۔ پھر ( مسجد سے ) نبی کریم صلی اللہ علیہ وسلم کے حجرہ مبارک میں آئے اور وہیں ٹھہرے رہے تاآنکہ نبی کریم صلی اللہ علیہ وسلم نے بھی کھانا کھا لیا ۔ اور رات کا ایک حصہ گزر جانے کے بعد جب اللہ تعالیٰ نے چاہا تو آپ گھر تشریف لائے تو ان کی بیوی ( ام رومان ) نے کہا کہ کیا بات پیش آئی کہ مہمانوں کی خبر بھی آپ نے نہ لی ، یا یہ کہ مہمان کی خبر نہ لی ۔ آپ نے پوچھا ، کیا تم نے ابھی انہیں رات کا کھانا نہیں کھلایا ۔ ام رومان نے کہا کہ میں کیا کروں آپ کے آنے تک انھوں نے کھانے سے انکار کیا ۔ کھانے کے لیے ان سے کہا گیا تھا لیکن وہ نہ مانے ۔ عبدالرحمٰن بن ابی بکر رضی اللہ عنہما نے بیان کیا کہ میں ڈر کر چھپ گیا ۔ ابوبکر رضی اللہ عنہ نے پکارا اے غنثر ! ( یعنی او پاجی ) آپ نے برا بھلا کہا اور کوسنے دئیے ۔ فرمایا کہ کھاؤ تمہیں مبارک نہ ہو ! خدا کی قسم ! میں اس کھانے کو کبھی نہیں کھاؤں گا ۔ ( آخر مہمانوں کو کھانا کھلایا گیا ) ( عبدالرحمٰن رضی اللہ عنہ نے کہا ) خدا گواہ ہے کہ ہم ادھر ایک لقمہ لیتے تھے اور نیچے سے پہلے سے بھی زیادہ کھانا ہو جاتا تھا ۔ بیان کیا کہ سب لوگ شکم سیر ہو گئے ۔ اور کھانا پہلے سے بھی زیادہ بچ گیا ۔ ابوبکر رضی اللہ عنہ نے دیکھا تو کھانا پہلے ہی اتنا یا اس سے بھی زیادہ تھا ۔ اپنی بیوی سے بولے ۔ بنوفراس کی بہن ! یہ کیا بات ہے ؟ انھوں نے کہا کہ میری آنکھ کی ٹھنڈک کی قسم ! یہ تو پہلے سے تین گنا ہے ۔ پھر ابوبکر رضی اللہ عنہ نے بھی وہ کھانا کھایا اور کہا کہ میرا قسم کھانا ایک شیطانی وسوسہ تھا ۔ پھر ایک لقمہ اس میں سے کھایا ۔ اور نبی کریم صلی اللہ علیہ وسلم کی خدمت میں بقیہ کھانا لے گئے اور آپ کی خدمت میں حاضر ہوئے ۔ وہ صبح تک آپ کے پاس رکھا رہا ۔ عبدالرحمٰن نے کہا کہ ہم مسلمانوں کا ایک دوسرے قبیلے کے لوگوں سے معاہدہ تھا ۔ اور معاہدہ کی مدت پوری ہو چکی تھی ۔ ( اس قبیلہ کا وفد معاہدہ سے متعلق بات چیت کرنے مدینہ میں آیا ہوا تھا ) ہم نے ان میں سے بارہ آدمی جدا کئے اور ہر ایک کے ساتھ کتنے آدمی تھے اللہ کو ہی معلوم ہے ان سب نے ان میں سے کھایا ۔ عبدالرحمٰن رضی اللہ عنہ نے کچھ ایسا ہی کہا ۔</b>",
        "bookID": "9.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 106040,
        "last_updated": null
    }
]