[
    {
        "urduURN": 4069520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7048,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، کہا ہم سے بشر بن سری نے بیان کیا ، کہا ہم سے نافع بن عمر نے بیان کیا ، ان سے ابن ابی ملیکہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ( قیامت کے دن ) میں حوض کوثر پر ہوں گا اور اپنے پاس آنے والوں کا انتظار کرتا رہوں گا پھر ( حوض کوثر ) پر کچھ لوگوں کو مجھ تک پہنچنے سے پہلے ہی گرفتار کر لیا جائے گا تو میں کہوں گا کہ یہ تو میری امت کے لوگ ہیں ۔ جواب ملے گا کہ آپ کو معلوم نہیں یہ لوگ الٹے پاؤں پھر گئے تھے ۔ ابن ابی ملیکہ اس حدیث کو روایت کرتے وقت دعا کرتے ” اے اللہ ! ہم تیری پناہ مانگتے ہیں کہ ہم الٹے پاؤں پھر جائیں یا فتنہ میں پڑ جائیں “ ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 161660,
        "last_updated": null
    },
    {
        "urduURN": 4069530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7049,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے ابوعوانہ نے ، ان سے ابووائل کے غلام مغیرہ ابن مقسم نے بیان کیا اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا حوض کوثر پر تم لوگوں کا پیش خیمہ ہوں گا اور تم میں سے کچھ لوگ میری طرف آئیں گے جب میں انہیں ( حوض کا پانی ) دینے کے لیے جھکوں گا تو انہیں میرے سامنے سے کھینچ لیا جائے گا ۔ میں کہوں گا اے میرے رب ! یہ تو میری امت کے لوگ ہیں ۔ اللہ تعالیٰ فرمائے گا آپ کو معلوم نہیں کہ انہوں نے آپ کے بعد دین میں کیا کیا نئی باتیں نکال لی تھیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 161670,
        "last_updated": null
    },
    {
        "urduURN": 4069540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے یعقوب بن عبدالرحمٰن نے بیان کیا ، ان سے ابوحازم سلمہ بن دینار نے بیان کیا ، کہا کہ میں نے سہل بن سعد سے سنا ، وہ کہتے تھے کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے کہ میں حوض کوثر پر تم سے پہلے رہوں گا جو وہاں پہنچے گا تو اس کا پانی پئے گا اور جو اس کا پانی پی لے گا وہ اس کے بعد کبھی پیاسا نہیں ہو گا ۔ میرے پاس ایسے لوگ بھی آئیں گے جنہیں میں پہچانتا ہوں گا اور وہ مجھے پہچانتے ہوں گے پھر میرے اور ان کے درمیان پردہ ڈال دیا جائے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 161680,
        "last_updated": null
    },
    {
        "urduURN": 4069550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7052,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن سعید نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے زید بن وہب نے بیان کیا ، انہوں نے عبداللہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے ہم سے فرمایا ، تم میرے بعد بعض کام ایسے دیکھو گے جو تم کو برے لگیں گے ۔ صحابہ نے عرض کیا یا رسول اللہ ! آپ اس سلسلے میں کیا حکم فرماتے ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا انہیں ان کا حق ادا کرو اور اپنا حق اللہ سے مانگو ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 161700,
        "last_updated": null
    },
    {
        "urduURN": 4069560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7053,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، ان سے عبدالوارث بن سعید نے بیان کیا ، ان سے جعد صیرفی نے ، ان سے ابورجاء عطاردی نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنے امیر میں کوئی ناپسند بات دیکھے تو صبر کرے ( خلیفہ ) کی اطاعت سے اگر کوئی بالشت بھر بھی باہر نکلا تو اس کی موت جاہلیت کی موت ہو گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 161710,
        "last_updated": null
    },
    {
        "urduURN": 4069570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7054,
        "hadithSanad": "ہم سے ابوالنعمان نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے جعد ابی عثمان نے بیان کیا ، ان سے ابورجاء العطاردی نے بیان کیا ، انہوں نے کہا کہ",
        "hadithText": "میں نے ابن عباس رضی اللہ عنہما سے سنا ، ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے اپنے امیر کی کوئی ناپسند چیز دیکھی تو اسے چاہے کہ صبر کرے اس لیے کہ جس نے جماعت سے ایک بالشت بھر جدائی اختیار کی اور اسی حال میں مرا تو وہ جاہلیت کی سی موت مرے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 161720,
        "last_updated": null
    },
    {
        "urduURN": 4069580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7055,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے عبداللہ بن وہب نے بیان کیا ، ان سے عمرو بن حارث نے ، ان سے بکیر بن عبداللہ نے ، ان سے بسر بن سعید نے ، ان سے جنادہ بن ابی امیہ نے بیان کیا کہ",
        "hadithText": "ہم عبادہ ابن صامت رضی اللہ عنہ کی خدمت میں پہنچے وہ مریض تھے اور ہم نے عرض کیا اللہ تعالیٰ آپ کو صحت عطا فرمائے ۔ کوئی حدیث بیان کیجئے جس کا نفع آپ کو اللہ تعالیٰ پہنچائے ۔ انہوں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے لیلۃالعقبہ میں سنا ہے کہ آپ نے ہمیں بلایا اور ہم نے آپ سے بیعت کی ۔ \n<span class=urdu_sanad>انہوں ( عبادہ بن صامت ) نے بیان کیا کہ</span> جن باتوں کا آنحضرت صلی اللہ علیہ وسلم نے ہم سے عہد لیا تھا ان میں یہ بھی تھا کہ خوشی و ناگواری ، تنگی اور کشادگی اور اپنی حق تلفی میں بھی اطاعت و فرمانبرداری کریں اور یہ بھی کہ حکمرانوں کے ساتھ حکومت کے بارے میں اس وقت تک جھگڑا نہ کریں جب تک ان کو اعلانیہ کفر کرتے نہ دیکھ لیں ۔ اگر وہ اعلانیہ کفر کریں تو تم کو اللہ کے پاس سے دلیل مل جائے گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 161731,
        "last_updated": null
    },
    {
        "urduURN": 4069600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7057,
        "hadithSanad": "ہم سے محمد بن عرعرہ نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے ، ان سے انس بن مالک رضی اللہ عنہ نے اور ان سے اسید بن حضیر رضی اللہ عنہ نے ،",
        "hadithText": "ایک صاحب ( خود اسید ) نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فلاں عمرو بن عاص کو حاکم بنا دیا اور مجھے نہیں بنایا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تم لوگ انصاری میرے بعد اپنی حق تلفی دیکھو گے تو قیامت تک صبر کرنا یہاں تک کہ تم مجھ سے آ ملو ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 161750,
        "last_updated": null
    },
    {
        "urduURN": 4069610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7058,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، انہوں نے کہا ہم سے عمرو بن یحییٰ بن سعید نے بیان کیا ، انہوں نے کہا کہ مجھے میرے دادا سعید نے خبر دی ، کہا کہ",
        "hadithText": "میں ابوہریرہ رضی اللہ عنہ کے پاس مدینہ منورہ میں نبی کریم صلی اللہ علیہ وسلم کی مسجد میں بیٹھا تھا اور ہمارے ساتھ مروان بھی تھا ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ میں نے صادق و مصدوق سے سنا ہے آپ نے فرمایا کہ میری امت کی تباہی قریش کے چند لڑکوں کے ہاتھ سے ہو گی ۔ مروان نے اس پر کہا ان پر اللہ کی لعنت ہو ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ اگر میں ان کے خاندان کے نام لے کر بتلانا چاہوں تو بتلا سکتا ہوں ۔ پھر جب بنی مروان شام کی حکومت پر قابض ہو گئے تو میں اپنے دادا کے ساتھ ان کی طرف جاتا تھا ۔ جب وہاں انہوں نے نوجوان لڑکوں کو دیکھا تو کہا کہ شاید یہ انہی میں سے ہوں ۔ ہم نے کہا کہ آپ کو زیادہ علم ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 161760,
        "last_updated": null
    },
    {
        "urduURN": 4069620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7059,
        "hadithSanad": "ہم سے مالک بن اسماعیل نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ انہوں نے زہری سے سنا ‘ انہوں نے عروہ سے ‘ انہوں نے زینب بنت ام سلمہ رضی اللہ عنہا سے ‘ انہوں نے ام حبیبہ رضی اللہ عنہا سے اور انہوں نے زینب بنت جحش رضی اللہ عنہا سے کہ",
        "hadithText": "انہوں نے بیان کیا نبی کریم صلی اللہ علیہ وسلم نیند سے بیدار ہوئے تو آپ کا چہرہ سرخ تھا اور آپ فرما رہے تھے اللہ کے سوا کوئی معبود نہیں ۔ عربوں کی تباہی اس بلا سے ہو گی جو قریب ہی آلگی ہے ۔ آج یاجوج ماجوج کی دیوار میں سے اتنا سوراخ ہو گیا اور سفیان نے نوے یا سو کے عدد کے لئے انگلی باندھی پوچھا گیا کیا ہم ا سکے باوجود ہلاک ہو جائیں گے کہ ہم میں صالحین بھی ہوں گے ؟ فرمایا ہاں جب برائی بڑھ جائے گی ( تو ایسا ہی ہو گا ) ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 161770,
        "last_updated": null
    },
    {
        "urduURN": 4069630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7060,
        "hadithSanad": "ہم سے ابونعیم فضل بن دکین نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے زہری نے ( دوسری سند ) امام بخاری نے کہا کہ اور مجھ سے محمود بن غیلان نے بیان کیا ‘ کہا ہم کو عبدالرزاق نے خبر دی ‘ انہیں معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں عروہ نے اور ان سے اسامہ بن زید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مدینہ کے ٹیلوں میں سے ایک ٹیلے پر چڑھے پھر فرمایا کہ میں جو کچھ دیکھتا ہوں تم بھی دیکھتے ہو ؟ لوگوں نے کہا کہ نہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں فتنوں کو دیکھتا ہوں کہ وہ بارش کے قطروں کی طرح تمہارے گھروں میں داخل ہو رہے ہیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 161780,
        "last_updated": null
    },
    {
        "urduURN": 4069640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7061,
        "hadithSanad": "ہم سے عیاش بن الولید نے بیان کیا ‘ انہوں نے کہا ہم کو عبد الاعلیٰ نے خبر دی ‘ انہوں نے کہا ہم سے معمر نے بیان کیا ‘ ان سے زہری نے ‘ان سے سوید بن مسیب نے بیان کیا ‘ ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا زمانہ قریب ہوتا جائے گا اور عمل کم ہوتا جائے گا اور لالچ دلوں میں ڈال دیا جائے گا اور فتنے ظاہر ہونے لگیں گے اور ہرج کی کثرت ہو جائے گی ۔ لوگوں نے سوال کیا یا رسول اللہ ! یہ ہرج کیا چیز ہے ؟ آنحضور صلی اللہ علیہ وسلم نے فرمایا کہ قتل ! قتل ! اور یونس اور لیث اور زہری کے بھتیجے نے بیان کیا ‘ ان سے زہری نے ‘ ان سے حمید نے ‘ ان سے ابوہریرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 161790,
        "last_updated": null
    },
    {
        "urduURN": 4069650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ‘ کہا ہم سے اعمش نے ‘ ان سے شقیق نے بیان کیا کہ میں عبداللہ بن مسعود اور ابوموسیٰ رضی اللہ عنہما کے ساتھ تھا ۔ ان دونوں حضرات نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت کے دن سے پہلے ایسے دن ہوں گے جن میں جہالت اترے پڑے گی اور علم اٹھا لیا جائے گا اور ہرج بڑھ جائے گا اور ہرج قتل ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 161810,
        "last_updated": null
    },
    {
        "urduURN": 4069660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7064,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ‘ انہوں نے کہا مجھ سے میرے والد نے بیان کیا ‘ انہوں نے کہا ہم سے اعمش نے بیان کیا ‘ ان سے شقیق نے بیان کیا کہ",
        "hadithText": "عبداللہ بن مسعود اور ابوموسیٰ رضی اللہ عنہما بیٹھے اور گفتگو کرتے رہے پھر ابوموسیٰ رضی اللہ عنہ نے کہا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت سے پہلے ایسے دن آئیں گے جن میں علم اٹھا لیا جائے گا اور جہالت اتر ے پڑے گی اور ہرج کی کثرت ہو جائے گی اور ہرج قتل ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 161820,
        "last_updated": null
    },
    {
        "urduURN": 4069670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7065,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ‘ انہوں نے کہا ہم سے جریر نے بیان کیا ‘ ان سے اعمش نے بیان کیا اور ان سے ابووائل نے بیان کیا کہ",
        "hadithText": "میں عبداللہ بن مسعود اور ابوموسیٰ رضی اللہ عنہما کے ساتھ بیٹھا ہوا تھا تو ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا اسی طرح ۔ حرج حبشہ کی زبان میں قتل کو کہتے ہیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 161830,
        "last_updated": null
    },
    {
        "urduURN": 4069680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7066,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے غندر نے ‘ کہا ہم سے شعبہ نے ‘ ان سے واصل نے ‘ ان سے ابووائل نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے اور میرا خیال ہے کہ",
        "hadithText": "اس حدیث کو انہوں نے مرفوعاً بیان کیا ‘ کہا کہ قیامت سے پہلے ہرج کے دن ہوں گے ‘ ان میں علم ختم ہو جائے گا اور جہالت غالب ہو گی ۔ ابوموسیٰ رضی اللہ عنہ نے بیان کیا کہ حبشی زبان میں ہرج بمعنی قتل ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 161840,
        "last_updated": null
    },
    {
        "urduURN": 4069690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7067,
        "hadithSanad": "اور ابو عوانہ نے بیان کیا ‘ ان سے عاصم نے ‘ ان سے ابووائل نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ انہوں نے عبداللہ رضی اللہ عنہ سے کہا ۔",
        "hadithText": "آپ وہ حدیث جانتے ہیں جو آنحضرت صلی اللہ علیہ وسلم نے ہرج کے دنوں وغیرہ کے متعلق بیان کی ۔ ابن مسعود رضی اللہ عنہما نے کہا کہ میں نے آپ کو یہ فرماتے سنا تھا کہ وہ بدبخت ترین لوگوں میں سے ہوں گے جن کی زندگی میں قیامت آئے گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 161850,
        "last_updated": null
    },
    {
        "urduURN": 4069700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7068,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ‘ کہا ہم سے سفیان نے ‘ ان سے زبیر بن عدی نے بیان کیا کہ ‘",
        "hadithText": "ہم انس بن مالک رضی اللہ عنہ کے پاس آئے اور ان سے حجاج کے طرز عمل کی شکایت کی ‘ انہوں نے کہا کہ صبر کرو کیونکہ تم پر جو دور بھی آتا ہے تو اس کے بعد آنے والا دور اس سے بھی برا ہو گا یہاں تک کہ تم اپنے رب سے جا ملو ۔ میں نے یہ تمہارے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 161860,
        "last_updated": null
    },
    {
        "urduURN": 4069710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7069,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ۔ ( دوسری سند امام بخاری نے کہا ) اور ہم سے اسماعیل نے بیان کیا ‘ ان سے ان کے بھائی نے بیان کیا ‘ ان سے سلیمان نے ‘ ان سے محمد بن عقیق نے ‘ ان سے ابن شہاب نے ‘ ان سے ہند بنت الحارث الفراسیہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ ام سلمہ رضی اللہ عنہا نے بیان کیا کہ ایک رات رسول اللہ صلی اللہ علیہ وسلم گھبرائے ہوئے بیدار ہوئے اور فرمایااللہ کی ذات پاک ہے ۔ اللہ تعالیٰ نے کیا خزانے نازل کئے ہیں اور کتنے فتنے اتارے ہیں ان حجرہ والیوں کو کوئی بیدار کیوں نہ کرے آپ کی مراد ازواج مطہرات سے تھی تاکہ یہ نماز پڑھیں ۔ بہت سے دنیا میں کپڑے باریک پہننے والیاں آخرت میں ننگی ہوں گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 161870,
        "last_updated": null
    },
    {
        "urduURN": 4069720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7070,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ‘ انہیں امام مالک نے خبر دی ‘ انہیں نافع نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس نے ہم مسلمانوں پر ہتھیار اٹھایا وہ ہم سے نہیں ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 161880,
        "last_updated": null
    },
    {
        "urduURN": 4069730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7071,
        "hadithSanad": "ہم سے محمد بن العلاء نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے برید نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جس نے ہم مسلمانوں پر ہتھیار اٹھایا وہ ہم سے نہیں ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 161890,
        "last_updated": null
    },
    {
        "urduURN": 4069740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7072,
        "hadithSanad": "ہم سے محمد بن یحییٰ ذہلی ( یا محمد بن رافع ) نے بیان کیا ‘ کہا ہم کو عبدالرزاق نے خبر دی ‘ انہیں معمر نے ‘ انہیں ہمام نے ‘ انہوں نے ابوہریرہ رضی اللہ عنہ سے سنا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ کوئی شخص اپنے کسی دینی بھائی کی طرف ہتھیار سے اشارہ نہ کرے ‘ کیونکہ وہ نہیں جانتا ممکن ہے شیطان اسے اس کے ہاتھ سے چھڑوا دے اور پھر وہ کسی مسلمان کو مار کر اس کی وجہ سے جہنم کے گڑھے میں گر پڑے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 161900,
        "last_updated": null
    },
    {
        "urduURN": 4069750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7073,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا کہ",
        "hadithText": "میں نے عمرو بن دینار سے کہا ابو محمد ! تم نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ہے کہ انہوں نے بیان کیا کہ ایک صاحب تیر لے کر مسجد میں سے گزرے تو ان سے رسول کریم صلی اللہ علیہ وسلم نے فرمایا کہ تیر کی نوک کا خیال رکھو ۔ عمرو نے کہا ہاں میں نے سنا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 161910,
        "last_updated": null
    },
    {
        "urduURN": 4069760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7074,
        "hadithSanad": "ہم سے ابو النعمان نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے عمرو بن دینار نے اور ان سے جابر رضی اللہ عنہ نے کہ",
        "hadithText": "ایک صاحب مسجد میں تیر لے کر گزرے جن کے پھل باہر کو نکلے ہوئے تھے تو انہیں حکم دیا گیا کہ ان کی نوک کا خیال رکھیں کہ وہ کسی مسلمان کو زخمی نہ کر دیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 161920,
        "last_updated": null
    },
    {
        "urduURN": 4069770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7075,
        "hadithSanad": "ہم سے محمد بن العلاء نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے برید نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تم میں سے کوئی ہماری مسجد میں یا ہمارے بازار میں گزرے اور اس کے پاس تیر ہوں تو اسے چاہئیے کہ اس کی نوک کا خیال رکھے یا آپ نے فرمایا کہ اپنے ہاتھ سے انہیں تھامے رہے ۔ کہیں کسی مسلمان کو اس سے کوئی تکلیف نہ پہنچے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 161930,
        "last_updated": null
    },
    {
        "urduURN": 4069780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7076,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ‘ کہا مجھ سے میرے والد نے بیان کیا ‘ کہا ہم سے اعمش نے بیان کیا ‘ ان سے شقیق نے بیان کیا ‘ کہا کہ عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مسلمان کو گالی دینا فسق ہے اور اس کو قتل کرنا کفرہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 161940,
        "last_updated": null
    },
    {
        "urduURN": 4069790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7077,
        "hadithSanad": "ہم سے حجاج بن منہال نے بیان کیا ‘ انہوں نے کہا ہم سے شعبہ نے بیان کیا ‘ کہا مجھ کو واقد نے خبر دی ‘ انہیں ان کے والد نے اور انہیں ابن عمر رضی اللہ عنہما نے ‘",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘آپ نے فرمایا کہ میرے بعد کفر کی طرف نہ لوٹ جانا کہ ایک دوسرے کی گردن مارنے لگو ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 161950,
        "last_updated": null
    },
    {
        "urduURN": 4069800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7078,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے یحییٰ قطان نے بیان کیا ‘ کہا ہم سے قرہ بن خالد نے بیان کیا ‘ کہا ہم سے ابن سیرین نے بیان کیا ‘ ان سے عبدالرحمٰن بن ابی بکرہ نے بیان کیا",
        "hadithText": "اور ایک دوسرے شخص ( حمید بن عبدالرحمٰن ) سے بھی سنا جو میری نظر میں عبدالرحمٰن بن ابی بکرہ سے اچھے ہیں اور ان سے ابو بکرہ رضی اللہ عنہ نے بیان کیا کہ رسول صلی اللہ علیہ وسلم نے لوگوں کو یوم النحر کو خطبہ دیا اور فرمایا تمہیں معلوم ہے یہ کون سا دن ہے ؟ لوگوں نے کہا کہ اللہ اور اس کے رسول کو زیادہ علم ہے ۔ بیان کیا کہ ( اس کے بعد آنحضرت صلی اللہ علیہ وسلم کی خاموشی سے ) ہم یہ سمجھے کہ آپ صلی اللہ علیہ وسلم اس کا کوئی اور نام رکھیں گے ۔ لیکن آپ نے فرمایا کیا یہ قربانی کا دن ( یوم النحر ) نہیں ہے ؟ ہم نے عرض کیا کیوں نہیں یا رسول اللہ ! آپ نے پھر پوچھا یہ کون سا شہر ہے ؟ کیا یہ البلدہ ( مکہ مکرمہ ) نہیں ہے ؟ ہم نے عرض کیا کیوں نہیں یا رسول اللہ ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا پھر تمہارا خون ‘ تمہارے مال ‘ تمہاری عزت اور تمہاری کھال تم پر اسی طرح حرمت والے ہیں جس طرح اس دن کی حرمت اس مہینے اور اس شہر میں ہے ۔ کیا میں نے پہنچا دیا ؟ ہم نے کہا جی ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! گواہ رہنا ۔ پس میرا یہ پیغام موجود لوگ غیر موجود لوگوں کو پہنچا دیں کیونکہ بہت سے پہنچانے والے اس پیغام کو اس تک پہنچائیں گے جو اس کو زیادہ محفوظ رکھنے والا ہو گا ۔ چنانچہ ایسا ہی ہوا اور آنحضرت صلی اللہ علیہ وسلم نے فرمایا میرے بعد کافر نہ ہو جانا کہ بعض بعض کی گردن مارنے لگو ۔ پھر جب وہ دن آیا جب عبداللہ عمرو بن حضرمی کو جاریہ بن قدامہ نے ایک مکان میں گھیر کر جلا دیا تو جاریہ نے اپنے لشکر والوں سے کہا ذار ابوبکرہ کو تو جھانکو وہ کس خیال میں ہے ۔ انہوں نے کہا یہ ابوبکرہ موجود ہیں تم کو دیکھ رہے ہیں ۔ عبدالرحمٰن بن ابی بکرہ کہتے ہیں مجھ سے میری والدہ ہالہ بنت غلیظ نے کہا کہ ابوبکرہ نے کہا اگر یہ لوگ ( تین جاریہ کے لشکر والے ) میرے گھر میں بھی گھس آئیں اور مجھ کو مارنے لگیں تو میں ان پر ایک بانس کی چھڑی بھی نہیں چلاؤں گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 161960,
        "last_updated": null
    },
    {
        "urduURN": 4069810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7079,
        "hadithSanad": "ہم سے احمد بن اشکاب نے بیان کیا ‘ انہوں نے کہا ہم سے محمد بن فضیل نے بیان کیا ‘ ان سے ان کے والد نے بیان کیا ‘ ان سے عکرمہ نے بیان کیا اور ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ میرے بعد کافر نہ ہو جانا کہ تم میں بعض بعض کی گردن مارنے لگے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 161970,
        "last_updated": null
    },
    {
        "urduURN": 4069820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7080,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ‘ انہوں نے کہا ہم سے شعبہ نے بیان کیا ‘ انہوں نے کہا ہم سے علی بن مدرک نے بیان کیا ‘ کہا میں نے ابو زرعہ بن عمرو بن جریر سے سنا ‘ ان سے ان کے دادا جریر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے حجۃ الوداع کے موقع پر فرمایا لوگوں کو خاموش کر دو ۔ پھر آپ نے فرمایا میرے بعد کافر نہ ہو جانا کہ تم ایک دوسرے کی گردن مارنے لگ جاؤ ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 161980,
        "last_updated": null
    },
    {
        "urduURN": 4069830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7081,
        "hadithSanad": "ہم سے محمد بن عبیداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ان کے والد نے ‘ ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ ابراہیم بن سعد نے کہا کہ مجھ سے صالح بن کیسان نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے سعید بن المسیب نے اور ان سے حضرت ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عنقریب ایسے فتنے برپا ہوں گے جن میں بیٹھنے والا کھڑے ہونے والے سے بہتر ہو گا اور کھڑا ہونے والا ان میں چلنے والے سے بہتر ہو گا اور چلنے والا ان میں دوڑنے والے سے بہتر ہو گا ‘ جو دور سے ان کی طرف جھانک کر بھی دیکھے گا تو وہ ان کو بھی سمیٹ لیں گے ۔ اس وقت جس کسی کو کوئی پناہ کی جگہ مل جائے یا بچاؤ کامقام مل سکے وہ اس میں چلا جائے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 161990,
        "last_updated": null
    },
    {
        "urduURN": 4069840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7082,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابوسلمہ بن عبدالرحمٰن نے خبر دی اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ایسے فتنے برپا ہوں گے کہ ان میں بیٹھنے والا کھڑے ہونے والے سے بہتر ہو گا اور کھڑا ہونے والا چلنے والے سے بہتر ہو گا اور چلنے والا دوڑنے والے سے بہتر ہو گا ۔ اگر کوئی ان کی طرف دور سے بھی جھانک کر دیکھے گا تو وہ اسے بھی سمیٹ لیں گے ایسے وقت جو کوئی اس سے کوئی پناہ کی جگہ پا لے اسے اس کی پناہ لے لینی چاہئیے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 162000,
        "last_updated": null
    },
    {
        "urduURN": 4069850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7083,
        "hadithSanad": "ہم سے عبداللہ بن عبدالوہاب نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے ایک شخص نے جس کا نام نہیں بتایا ‘ ان سے امام حسن بصری نے بیان کیا کہ",
        "hadithText": "میں ایک مرتبہ باہمی فسادات کے دنوں میں اپنے ہتھیار لگا کر نکلا تو ابوبکرہ رضی اللہ عنہ سے راستے میں ملاقات ہو گئی ۔ انہوں نے پوچھا کہاں جانے کا ارادہ ہے ؟ میں نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے چچا کے لڑکے کی ( جنگ جمل وصفین میں ) مدد کرنی چاہتا ہوں ۔ انہوں نے کہا لوٹ جاؤ ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہے کہ جب دو مسلمان اپنی تلواروں کو لے کر آمنے سامنے مقابلہ پر آ جائیں تو دونوں دوزخی ہیں ۔ پوچھا گیا یہ تو قاتل تھا ‘ مقتول نے کیا کیا ( کہ وہ بھی ناری ہو گیا ) فرمایا کہ وہ بھی اپنے مقابل کو قتل کرنے کا ارادہ کئے ہوئے تھا ۔ حماد بن زید نے کہا کہ پھر میں نے یہ حدیث ایوب اور یونس بن عبید سے ذکر کی ‘ میرا مقصد تھا کہ یہ دونوں بھی مجھ سے یہ حدیث بیان کریں ‘ ان دونوں نے کہا کہ اس حدیث کی روایت حسن بصری نے احنف بن قیس سے اور انہوں نے ابوبکر رضی اللہ عنہ سے کی ۔ ہم سے سلیمان بن حرب نے بیان کیا کہا ہم سے حماد بن زید نے یہی حدیث بیان کی اور مؤمل بن ہشام نے کہا کہ ہم سے حماد بن زید نے بیان کیا ‘کہا ہم سے ایوب ‘ یونس ‘ ہشام اور معلی بن زیاد نے امام حسن بصری سے بیان کیا ‘ ان سے احنف بن قیس اور ان سے ابوبکرہ رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اور اس کی روایت معمر نے بھی ایوب سے کی ہے اور اس کی روایت بکار بن عبد العزیز نے اپنے باپ سے کی اور ان سے ابو بکرہ رضی اللہ عنہ نے اور غندر نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے منصور نے ‘ ان سے ربعی بن حراش نے ‘ ان سے ابوبکرہ رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ۔ اور سفیان ثوری نے بھی اس حدیث کو منصور بن معتمر سے روایت کیا ‘ پھر یہ روایت مرفوعہ نہیں ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 162010,
        "last_updated": null
    },
    {
        "urduURN": 4069860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7084,
        "hadithSanad": "ہم سے محمد بن مثنیٰ نے بیان کیا ‘انہوں نے کہا ہم سے ولید بن مسلم نے بیان کیا ‘ انہوں نے کہا ہم سے ابن جابر نے بیان کیا ‘ ان سے بسر بن عبیداللہ الخصرمی نے بیان کیا ‘ انہوں نے ابو ادریس خولانی سے سنا ‘ انہوں نے حذیفہ بن الیمان رضی اللہ عنہ سے سنا ‘انہوں نے بیان کیا کہ",
        "hadithText": "لوگ رسول اللہ صلی اللہ علیہ وسلم سے خیر کے بارے میں پوچھا کرتے تھے لیکن میں شر کے بارے میں پوچھتا تھا ۔ اس خوف سے کہ کہیں میری زندگی میں ہی شر نہ پیدا ہو جائے ۔ میں نے پوچھا یا رسول اللہ ! ہم جاہلیت اور شر کے دور میں تھے پھر اللہ تعالیٰ نے ہمیں اس خیر سے نوازا تو کیا اس خیر کے بعد پھر شر کا زمانہ ہو گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ۔ میں نے پوچھا کیا اس شر کے بعد پھر خیر کا زمانہ آئے گا ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ہاں لیکن اس خیر میں کمزوری ہو گی ۔ میں نے پوچھا کہ کمزوری کیا ہو گی ؟ فرمایا کہ کچھ لوگ ہوں گے جو میرے طریقے کے خلاف چلیں گے ‘ ان کی بعض باتیں اچھی ہوں گی لیکن بعض میں تم برائی دیکھو گے ۔ میں نے پوچھا کیا پھر دور خیر کے بعد دور شر آئے گا ؟ فرمایا کہ ہاں جہنم کی طرف سے بلانے والے دوزخ کے دروازوں پر کھڑے ہوں گے ‘ جو ان کی بات مان لے گا وہ اس میں انہیں جھٹک دیں گے ۔ میں نے کہا یا رسول اللہ ! ان کی کچھ صفت بیان کیجئے ۔ فرمایا کہ وہ ہمارے ہی جیسے ہوں گے اور ہماری ہی زبان عربی بولیں گے ۔ میں نے پوچھا پھر اگر میں نے وہ زمانہ پایا تو آپ مجھے ان کے بارے میں کیا حکم دیتے ہیں ؟ فرمایا کہ مسلمانوں کی جماعت اور ان کے امام کے ساتھ رہنا ۔ میں نے کہا کہ اگر مسلمانوں کی جماعت نہ ہو اور نہ ان کا کوئی امام ہو ؟ فرمایا کہ پھر ان تمام لوگوں سے الگ ہو کر خواہ تمہیں جنگل میں جا کر درختوں کی جڑیں چبانی پڑیں یہاں تک کہ اسی حالت میں تمہاری موت آ جائے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 162040,
        "last_updated": null
    },
    {
        "urduURN": 4069870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7085,
        "hadithSanad": "ہم سے عبداللہ بن یزید نے بیان کیا ، کہا ہم سے حیوہ بن شریح وغیرہ نے بیان کیا کہ ہم سے ابوالاسود نے بیان کیا ، یا لیث نے ابوالاسود سے بیان کیا کہ",
        "hadithText": "اہل مدینہ کا ایک لشکر تیار کیا گیا ( یعنی عبداللہ بن زبیر رضی اللہ عنہما کے زمانہ میں شام والوں سے مقابلہ کرنے کے لیے ) اور میرا نام اس میں لکھ دیا گیا ۔ پھر میں عکرمہ سے ملا اور میں نے انہیں خبر دی تو انہوں نے مجھے شرکت سے سختی کے ساتھ منع کیا ۔ پھر کہا کہ ابن عباس رضی اللہ عنہما نے مجھے خبر دی ہے کہ کچھ مسلمان جو مشرکین کے ساتھ رہتے تھے وہ رسول کریم صلی اللہ علیہ وسلم کے خلاف ( غزوات ) میں مشرکین کی جماعت کی زیادتی کا باعث بنتے ۔ پھر کوئی تیر آتا اور ان میں سے کسی کو لگ جاتا اور قتل کر دیتا یا انہیں کوئی تلوار سے قتل کر دیتا ، پھر اللہ تعالیٰ نے یہ آیت نازل کی ” بلا شک وہ لوگ جن کو فرشتے فوت کرتے ہیں اس حال میں کہ وہ اپنی جانوں پر ظلم کرنے والے ہوتے ہیں ۔ “</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 162050,
        "last_updated": null
    },
    {
        "urduURN": 4069880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7086,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ، کہا ہم کو سفیان نے خبر دی ، کہا ہم سے اعمش نے بیان کیا ، ان سے زید بن وہب نے بیان کیا ، ان سے حذیفہ نے بیان کیا ، کہا",
        "hadithText": "ہم سے رسول اللہ صلی اللہ علیہ وسلم نے دو احادیث فرمائی تھیں جن میں سے ایک تو میں نے دیکھ لی دوسری کا انتظار ہے ۔ ہم سے آپ نے فرمایا تھا کہ امانت لوگوں کے دلوں کی جڑوں میں نازل ہوئی تھی پھر لوگوں نے اسے قرآن سے سیکھا ، پھر سنت سے سیکھا اور آنحضرت صلی اللہ علیہ وسلم نے ہم سے امانت کے اٹھ جانے کے متعلق فرمایا تھا کہ ایک شخص ایک نیند سوئے گا اور امانت اس کے دل سے نکال دی جائے گی اور اس کا نشان ایک دھبے جتنا باقی رہ جائے گا ، پھر وہ ایک نیند سوئے گا اور پھر امانت نکالی جائے گی تو اس کے دل میں آبلے کی طرح اس کا نشان باقی رہ جائے گا ، جیسے تم نے کوئی چنگاری اپنے پاؤں پر گرالی ہو اور اس کی وجہ سے آبلہ پڑ جائے ، تم اس میں سو جن دیکھوگے لیکن اندر کچھ نہیں ہو گا اور لوگ خریدوفروخت کریں گے لیکن کوئی امانت ادا کرنے والا نہیں ہو گا ۔ پھر کہا جائے گا کہ فلاں قبیلے میں ایک امانت دار آدمی ہے اور کسی کے متعلق کہا جائے گا کہ وہ کس قدر عقلمند ، کتنا خوش طبع ، کتنا دلاور آدمی ہے حالانکہ اس کے دل میں رائی کے دانے کے برابر بھی ایمان نہ ہو گا اور مجھ پر ایک زمانہ گزر گیا اور میں اس کی پروا نہیں کرتا تھا کہ تم میں سے کس کے ساتھ میں لین دین کرتا ہوں اگر وہ مسلمان ہوتا تو اس کا اسلام اسے میرے حق کے ادا کرنے پر مجبور کرتا اور اگر وہ نصرانی ہوتا تو اس کے حاکم لوگ اس کو دباتے ایمانداری پر مجبور کرتے ۔ لیکن آج کل تو میں صرف فلاں فلاں لوگوں سے ہی لین دین کرتا ہوں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 162060,
        "last_updated": null
    },
    {
        "urduURN": 4069890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7087,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، انہوں نے کہا ہم سے حاتم نے بیان کیا ، ان سے یزید بن ابی عبید نے بیان کیا ، ان سے سلمہ بن الاکوع رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "وہ حجاج کے یہاں گئے تو اس نے کہا کہ اے ابن الاکوع ! تم گاؤں میں رہنے لگے ہو کیا الٹے پاؤں پھر گئے ؟ کہا کہ نہیں بلکہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے جنگل میں رہنے کی اجازت دی تھی ۔ اور یزید بن ابی عبید سے روایت ہے ، انہوں نے کہا کہ جب حضرت عثمان بن عفان رضی اللہ عنہ شہید کئے گئے تو سلمہ بن الاکوع رضی اللہ عنہ ربذہ چلے گئے اور وہاں ایک عورت سے شادی کر لی اور وہاں ان کے بچے بھی پیدا ہوئے ۔ وہ برابر وہیں پر رہے ، یہاں تک کہ وفات سے چند دن پہلے مدینہ آ گئے تھے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 162070,
        "last_updated": null
    },
    {
        "urduURN": 4069900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7088,
        "hadithSanad": "ہم سے عبداللہ بن یوسف نے بیان کیا ، کہا ہم کو مالک نے خبر دی ، انہیں عبدالرحمٰن بن عبداللہ بن ابی صعصعہ نے ، انہیں ان کے والد نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا وہ وقت قریب ہے کہ مسلمان کا بہترین مال وہ بکریاں ہوں گی جنہیں وہ لے کر پہاڑی کی چوٹیوں اور بارش برسنے کی جگہوں پر چلا جائے گا ۔ وہ فتنوں سے اپنے دین کی حفاظت کے لیے وہاں بھاگ کر آ جائے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 162080,
        "last_updated": null
    },
    {
        "urduURN": 4069910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7089,
        "hadithSanad": "ہم سے معاذ بن فضالہ نے بیان کیا ، کہا ہم سے ہشام نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے لوگوں سے سوالات کئے آخر جب لوگ باربار سوال کرنے لگے تو آنحضرت صلی اللہ علیہ وسلم منبر پر ایک دن چڑھے اور فرمایا کہ آج تم مجھ سے جو سوال بھی کرو گے میں تمہیں اس کا جواب دوں گا ۔ انس رضی اللہ عنہ نے بیان کیا کہ پھر میں دائیں بائیں دیکھنے لگا تو ہر شخص کا سراس کے کپڑے میں چھپا ہوا تھا اور وہ رورہا تھا ۔ آخر ایک شخص نے خاموشی توڑی ۔ اس کا جب کسی سے جھگڑا ہوتا تو انہیں ان کے باپ کے سوا دوسرے باپ کی طرف پکارا جاتا ۔ انہوں نے کہا یا رسول اللہ ! میرے والد کون ہیں ؟ فرمایا تمہارے والد حذافہ ہیں ۔ پھر عمر رضی اللہ عنہ سامنے آئے اور عرض کیا ہم اللہ سے کہ وہ رب ہے ، اسلام سے کہ وہ دین ہے ، محمد صلی اللہ علیہ وسلم سے کہ وہ سول ہیں راضی ہیں اور آزمائش کی برائی سے ہم اللہ کی پناہ مانگتے ہیں ۔ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے خیروشر آج جیسا دیکھا کبھی نہیں دیکھا تھا ۔ میرے سامنے جنت و دوزخ کی صورت پیش کی گئی اور میں نے انہیں دیوار کے قریب دیکھا ۔ قتادہ نے بیان کیا کہ یہ بات اس آیت کے ساتھ ذکر کی جاتی ہے کہ ” اے لوگو ! جو ایمان لائے ہو ایسی چیزوں کے بارے میں سوال نہ کرو اگر وہ ظاہر کر دی جائیں تو تمہیں بری معلوم ہوں “ ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 162090,
        "last_updated": null
    },
    {
        "urduURN": 4069920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7090,
        "hadithSanad": "اور عباس النرسی نے بیان کیا ، ان سے یزید بن زریع نے بیان کیا ، ان سے سعید نے بیان کیا ، ان سے قتادہ نے بیان کیا اور ان سے انس رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث بیان کی",
        "hadithText": "اور انس رضی اللہ عنہ نے کہا ہر شخص کپڑے میں اپنا سر لپیٹے ہوئے رورہا تھا اور فتنے سے اللہ کی پناہ مانگ رہا تھا یا یوں کہہ رہا تھا کہ میں اللہ سے فتنہ کی برائی سے پناہ مانگتا ہوں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 162100,
        "last_updated": null
    },
    {
        "urduURN": 4069930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7091,
        "hadithSanad": "اور مجھ سے خلیفہ بن خیاط نے بیان کیا ، ان سے یزید بن زریع نے بیان کیا ، ان سے سعید و معتمر کے والد نے قتادہ سے اور ان سے انس رضی اللہ عنہ نے بیان کیا ،",
        "hadithText": "پھر یہی حدیث آنحضرت صلی اللہ علیہ وسلم سے نقل کی ، اس میں بجائے سوء کے شر کا لفظ ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 162110,
        "last_updated": null
    },
    {
        "urduURN": 4069940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7092,
        "hadithSanad": "ہم سے عبداللہ بن محمد مسندی نے بیان کیا ، انہوں نے کہا ہم سے ہشام بن یوسف نے بیان کیا ، انہوں نے کہا ان سے معمر نے بیان کیا ، ان سے زہری نے بیان کیا ، ان سے سالم نے ، ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم منبر کے ایک طرف کھڑے ہوئے اور فرمایا فتنہ ادھر ہے ، فتنہ ادھر ہے جدھر سے شیطان کا سینگ طلوع ہوتا ہے یا ” سورج کا سینگ “ فرمایا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 162120,
        "last_updated": null
    },
    {
        "urduURN": 4069950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7093,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے لیث نے بیان کیا ، ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ آنحضرت صلی اللہ علیہ وسلم مشرق کی طرف رخ کئے ہوئے تھے اور فرما رہے تھے آگاہ ہو جاؤ ، فتنہ اس طرف ہے جدھر سے شیطان کا سینگ طلوع ہوتا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 162130,
        "last_updated": null
    },
    {
        "urduURN": 4069960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7094,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ، انہوں نے کہا ہم سے ازہر بن سعد نے بیان کیا ، ان سے ابن عون نے بیان کیا ، ان سے نافع نے بیان کیا ، ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! ہمارے ملک شام میں ہمیں برکت دے ، ہمارے یمن میں ہمیں برکت دے ۔ صحابہ نے عرض کیا اور ہمارے نجد میں ؟ آنحضرت صلی اللہ علیہ وسلم نے پھر فرمایا اے اللہ ہمارے شام میں برکت دے ، ہمیں ہمارے یمن میں برکت دے ۔ صحابہ نے عرض کی اور ہمارے نجد میں ؟ میرا گمان ہے کہ آنحضرت صلی اللہ علیہ وسلم نے تیسری مرتبہ فرمایا وہاں زلزلے اور فتنے ہیں اور وہاں شیطان کا سینگ طلوع ہو گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 162140,
        "last_updated": null
    },
    {
        "urduURN": 4069970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7095,
        "hadithSanad": "ہم سے اسحاق بن شاہین واسطی نے بیان کیا ، کہا ہم سے خلف بن عبداللہ طحان نے بیان کیا ، ان سے بیان ابن بصیر نے ، ان سے وبرہ بن عبدالرحمٰن نے ، ان سے سعید بن جبیر نے بیان کیا کہ",
        "hadithText": "عبداللہ بن عمر رضی اللہ عنہما ہمارے پاس آئے تو ہم نے امید کی کہ وہ ہم سے کوئی اچھی بات کریں گے ۔ اتنے میں ایک صاحب حکیم نامی ہم سے پہلے ان کے پاس پہنچ گئے اور پوچھا اے ابوعبدالرحمن ! ہم سے زمانہ فتنہ میں قتال کے متعلق حدیث بیان کیجئے ۔ اللہ تعالیٰ فرماتا ہے تم ان سے جنگ کرو یہاں تک کہ فتنہ باقی نہ رہے ۔ ابن عمر رضی اللہ عنہما نے کہا تمہیں معلوم بھی ہے کہ فتنہ کیا ہے ؟ تمہاری ماں تمہیں روئے ۔ محمد صلی اللہ علیہ وسلم فتنہ رفع کرنے کے لیے مشرکین سے جنگ کرتے تھے ، شرک میں پڑنا یہ فتنہ ہے ۔ کیا آنحضرت صلی اللہ علیہ وسلم کی لڑائی تم لوگوں کی طرح بادشاہت حاصل کرنے کے لیے ہوتی تھی ؟</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 162150,
        "last_updated": null
    },
    {
        "urduURN": 4069980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7096,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ، کہا ہم سے ہمارے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے شقیق نے بیان کیا ، انہوں نے حذیفہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ہم حضرت عمر رضی اللہ عنہ کی خدمت میں بیٹھے ہوئے تھے کہ انہوں نے پوچھا تم میں سے کسے فتنہ کے بارے میں نبی کریم صلی اللہ علیہ وسلم کا فرمان یاد ہے ؟ حذیفہ رضی اللہ عنہ نے کہا کہ انسان کا فتنہ ( آزمائش ) اس کی بیوی ، اس کے مال ، اس کے بچے اور پڑوسی کے معاملات میں ہوتا ہے جس کا کفارہ نماز ، صدقہ ، امربالمعروف اور نہی عن المنکر کر دیتا ہے ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ میں اس کے متعلق نہیں پوچھتا بلکہ اس فتنہ کے بارے میں پوچھتا ہوں جو دریا کی طرح ٹھاٹھیں مارے گا ۔ حذیفہ رضی اللہ عنہ نے بیان کیا کہ امیرالمؤمنین تم پر اس کا کوئی خطرہ نہیں اس کے اور تمہارے درمیان ایک بند دروازہ رکاوٹ ہے ۔ عمر رضی اللہ عنہ نے پوچھا کیا وہ دروازہ توڑ دیا جائے گا یا کھولا جائے گا ؟ بیان کیا توڑ دیا جائے گا ۔ عمر رضی اللہ عنہ نے اس پر کہا کہ پھر تو وہ کبھی بند نہ ہو سکے گا ۔ میں نے کہا جی ہاں ۔ ہم نے حذیفہ رضی اللہ عنہ سے پوچھا کیا عمر رضی اللہ عنہ اس دروازہ کے متعلق جانتے تھے ؟ فرمایا کہ ہاں ، جس طرح میں جانتا ہوں کہ کل سے پہلے رات آئے گی کیونکہ میں نے ایسی بات بیان کی تھی جو بے بنیاد نہیں تھی ۔ ہمیں ان سے یہ پوچھتے ہوئے ڈر لگا کہ وہ دروازہ کون تھے ۔ چنانچہ ہم نے مسروق سے کہا ( کہ وہ پوچھیں ) جب انہوں نے پوچھا کہ وہ دروازہ کون تھے ؟ تو انہوں نے کہا کہ وہ دروازہ حضرت عمر رضی اللہ عنہ تھے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 162160,
        "last_updated": null
    },
    {
        "urduURN": 4069990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7097,
        "hadithSanad": "ہم سے سعید بن ابی مریم نے بیان کیا ، کہا ہم کو محمد بن جعفر نے خبر دی ، انہیں شریک بن عبداللہ نے ، انہیں سعید بن مسیب نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم مدینہ کے باغات میں کسی باغ کی طرف اپنی کسی ضرورت کے لئے گئے ، میں بھی آپ کے پیچھے پیچھے گیا ۔ جب آنحضرت صلی اللہ علیہ وسلم باغ میں داخل ہوئے تو میں اس کے دروازے پر بیٹھ گیا اور اپنے دل میں کہا کہ آج میں حضرت کا دربان بنوں گا حالانکہ آپ نے مجھے اس کا حکم نہیں دیا تھا ۔ آپ اندر چلے گئے اور اپنی حاجت پوری کی ۔ پھر آپ کنوئیں کی منڈیر پر بیٹھ گئے اور اپنی دونوں پنڈلیوں کو کھول کر انہیں کنوئیں میں لٹکا لیا ۔ پھر ابوبکر رضی اللہ عنہ آئے اور اندر جانے کی اجازت چاہی ۔ میں نے ان سے کہا کہ آپ یہیں رہیں ، میں آپ کے لیے اجازت لے کر آتا ہوں ۔ چنانچہ وہ کھڑے رہے اور میں نے آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو کر عرض کیا یا نبی اللہ ! ابوبکر رضی اللہ عنہ آپ کے پاس آنے کی اجازت چاہتے ہیں ۔ فرمایا کہ انہیں اجازت دے دو اور انہیں جنت کی بشارت سنا دو ۔ چنانچہ وہ اندر آ گئے اور آنحضرت صلی اللہ علیہ وسلم کی دائیں جانب آ کر انہوں نے بھی اپنی پنڈلیوں کو کھول کر کنوئیں میں لٹکا لیا ۔ اتنے میں عمر رضی اللہ عنہ آئے ۔ میں نے کہا ٹھہرو میں آنحضرت صلی اللہ علیہ وسلم سے اجازت لے لوں ( اور میں نے اندر جا کر آپ سے عرض کیا ) آپ صلی اللہ علیہ وسلم نے فرمایا ان کو بھی اجازت دے اور بہشت کی خوشخبری بھی ۔ خیر وہ بھی آئے اور اسی کنوئیں کی منڈیر پر آنحضرت صلی اللہ علیہ وسلم کے بائیں جانب بیٹھے اور اپنی پنڈلیاں کھول کر کنوئیں میں لٹکا دیں ۔ اور کنوئیں کی منڈیر بھر گئی اور وہاں جگہ نہ رہی ۔ پھر عثمان رضی اللہ عنہ آئے اور میں نے ان سے بھی کہا کہ یہیں رہئے یہاں تک کہ آپ کے لیے آنحضرت صلی اللہ علیہ وسلم سے اجازت مانگ لوں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دو اور جنت کی بشارت دے دو اور اس کے ساتھ ایک آزمائش ہے جو انہیں پہنچے گی ۔ پھر وہ بھی داخل ہوئے ، ان کے ساتھ بیٹھنے کے لیے کوئی جگہ نہ تھی ۔ چنانچہ وہ گھوم کر ان کے سامنے کنوئیں کے کنارے پر آ گئے پھر انہوں نے اپنی پنڈلیاں کھول کر کنوئیں میں پاؤں لٹکالیے ، پھر میرے دل میں بھائی ( غالباً ابوبردہ یا ابورہم ) کی تمنا پیدا ہوئی اور میں دعا کرنے لگا کہ وہ بھی آ جاتے ، ابن المسیب نے بیان کیا کہ میں نے اس سے ان حضرت کی قبروں کی تعبیرلی کہ سب کی قبریں ایک جگہ ہوں گی لیکن عثمان رضی اللہ عنہ کی الگ بقیع غرقد میں ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 162170,
        "last_updated": null
    },
    {
        "urduURN": 4070000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7098,
        "hadithSanad": "ہم سے بشر بن خالد نے بیان کیا ، کہا ہم کو جعفر نے خبر دی ، انہیں شعبہ نے ، انہیں سلیمان نے کہ میں نے ابووائل سے سنا ، انہوں نے کہا کہ",
        "hadithText": "اسامہ رضی اللہ عنہ سے کہا گیا کہ آپ ( عثمان بن عفان رضی اللہ عنہ ) سے گفتگو کیوں نہیں کرتے ( کہ عام مسلمانوں کی شکایات کا خیال رکھیں ) انہوں نے کہا کہ میں نے ( خلوت میں ) ان سے گفتگو کی ہے لیکن ( فتنہ کے ) دروازہ کو کھولے بغیر کہ اس طرح میں سب سے پہلے اس دروازہ کو کھولنے والا ہوں گا میں ایسا آدمی نہیں ہوں کہ کسی شخص سے جب وہ دو آدمیوں پر امیر بنا دیا جائے یہ کہوں کہ تو سب سے بہتر ہے ۔ جبکہ میں رسول اللہ صلی اللہ علیہ وسلم سے سن چکا ہوں ۔ آپ نے فرمایا کہ ایک شخص کو ( قیامت کے دن ) لایا جائے گا اور اسے آگ میں ڈال دیا جائے گا ۔ پھر وہ اس میں اس طرح چکی پیسے گا جیسے گدھا پیستا ہے ۔ پھر دوزخ کے لوگ اس کے چاروں طرف جمع ہو جائیں گے اور کہیں گے ، اے فلاں ! کیا تم نیکیوں کا حکم کرتے اور برائیوں سے روکا نہیں کرتے تھے ؟ وہ شخص کہے گا کہ میں اچھی بات کے لیے کہتا تو ضرور تھا لیکن خود نہیں کرتا تھا اور بری بات سے روکتا بھی تھا لیکن خود کرتا تھا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 162180,
        "last_updated": null
    },
    {
        "urduURN": 4070010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7099,
        "hadithSanad": "ہم سے عثمان بن ہیثم نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، کہا ان سے حسن نے اور ان سے ابوبکرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جنگ جمل کے زمانہ میں مجھے ایک کلمہ نے فائدہ پہنچایا جب نبی کریم صلی اللہ علیہ وسلم کو معلوم ہوا کہ فارس کی سلطنت والوں نے بوران نامی کسریٰ کی بیٹی کو بادشاہ بنا لیا ہے تو آپ نے فرمایا کہ وہ قوم کبھی فلاح نہیں پائے گی جس کی حکومت ایک عورت کے ہاتھ میں ہو ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 162190,
        "last_updated": null
    },
    {
        "urduURN": 4070020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7100,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ، انہوں نے کہا ہم سے یحییٰ بن آدم نے بیان کیا ، انہوں نے کہا ہم سے ابوبکر بن عیاش نے بیان کیا ، انہوں نے کہا ہم سے ابوحصین نے بیان کیا ، انہوں نے کہا ہم سے ابومریم عبداللہ بن زیاد الاسدی نے بیان کیا کہ",
        "hadithText": "جب طلحہ ، زبیر اور عائشہ رضی اللہ عنہم بصرہ کی طرف روانہ ہوئے تو علی رضی اللہ عنہ نے عمار بن یاسر اور حسن بن علی رضی اللہ عنہما کو بھیجا ۔ یہ دونوں بزرگ ہمارے پاس کوفہ آئے اور منبر پر چڑھے ۔ حسن بن علی رضی اللہ عنہما منبر کے اوپر سب سے اونچی جگہ تھے اور عمار بن یاسر رضی اللہ عنہما ان سے نیچے تھے ۔ پھر ہم ان کے پاس جمع ہو گئے اور میں نے عمار رضی اللہ عنہ کو یہ کہتے سنا کہ عائشہ رضی اللہ عنہا بصرہ گئی ہیں اور خدا کی قسم وہ دنیا و آخرت میں تمہارے نبی کریم صلی اللہ علیہ وسلم کی پاک بیوی ہیں لیکن اللہ تبارک و تعالیٰ نے تمہیں آزمایا ہے تاکہ جان لے کہ تم اس اللہ کی اطاعت کرتے ہو یا عائشہ رضی اللہ عنہا کی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 162200,
        "last_updated": null
    },
    {
        "urduURN": 4070030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7101,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ، انہوں نے کہا ہم سے ابن ابی غنیہ نے بیان کیا ، ان سے حکم نے بیان کیا اور ان سے ابووائل نے بیان کیا کہ",
        "hadithText": "کوفہ میں عمار رضی اللہ عنہ منبر پر کھڑے ہوئے اور عائشہ رضی اللہ عنہا اور ان کی روانگی کا ذکر کیا اور کہا کہ بلاشبہ وہ دنیا و آخرت میں تمہارے نبی کریم صلی اللہ علیہ وسلم کی زوجہ ہیں لیکن تم ان کے بارے میں آزمائے گئے ہو ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 162210,
        "last_updated": null
    },
    {
        "urduURN": 4070040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے بدل بن محبر نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، کہا کہ مجھ کو عمرو نے خبر دی کہ میں نے ابووائل سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "ابوموسیٰ اور ابومسعود رضی اللہ عنہما دونوں عمار بن یاسر رضی اللہ عنہ کے پاس گئے جب انہیں علی رضی اللہ عنہ نے اہل کوفہ کے پاس اس لیے بھیجا تھا کہ لوگوں کو لڑنے کے لیے تیار کریں ۔ ابوموسیٰ اور ابومسعود رضی اللہ عنہما دونوں عمار رضی اللہ عنہ سے کہنے لگے جب سے تم مسلمانوں ہوئے ہو ہم نے کوئی بات اس سے زیادہ بری نہیں دیکھی جو تم اس کام میں جلدی کر رہے ہو ۔ عمار رضی اللہ عنہ نے جواب دیا میں نے بھی جب سے تم دونوں مسلمان ہوئے ہو تمہاری کوئی بات اس سے بری نہیں دیکھی جو تم اس کام میں دیر کر رہے ہو ۔ ابومسعود رضی اللہ عنہ نے عمار رضی اللہ عنہ اور ابوموسیٰ رضی اللہ عنہ دونوں کو ایک ایک کپڑے کا نیا جوڑا پہنایا پھر تینوں مل کر مسجد میں تشریف لے گئے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 162220,
        "last_updated": null
    },
    {
        "urduURN": 4070050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ، ان سے ابوحمزہ نے بیان کیا ، ان سے اعمش نے ، ان سے شقیق بن سلمہ نے کہ",
        "hadithText": "میں ابومسعود ، ابوموسیٰ اور عمار رضی اللہ عنہم کے ساتھ بیٹھا ہوا تھا ۔ ابومسعود رضی اللہ عنہ نے عمار رضی اللہ عنہ سے کہا ہمارے ساتھ والے جتنے لوگ ہیں میں اگر چاہوں تو تمہارے سوا ان میں سے ہر ایک کا کچھ نہ کچھ عیب بیان کر سکتا ہوں ۔ ( لیکن تم ایک بے عیب ہو ) اور جب سے تم نے آنحضرت صلی اللہ علیہ وسلم کی صحبت اختیار کی ، میں نے کوئی عیب کا کام تمہارا نہیں دیکھا ۔ ایک یہی عیب کا کام دیکھتا ہوں ، تم اس دور میں یعنی لوگوں کو جنگ کے لیے اٹھانے میں جلدی کرہے ہو ۔ عمار رضی اللہ عنہ نے کہا ابومسعود رضی اللہ عنہ تم سے اور تمہارے ساتھی ابوموسیٰ اشعری سے جب سے تم دونوں نے آنحضرت صلی اللہ علیہ وسلم کی صحبت اختیار کی ہے میں نے کوئی عیب کا کام اس سے زیادہ نہیں دیکھا جو تم دونوں اس کام میں دیر کر رہے ہو ۔ اس پر ابومسعود رضی اللہ عنہ نے کہا اور وہ مالدار آدمی تھے کہ غلام ! دو حلے لاؤ ۔ چنانچہ انہوں نے ایک حلہ ابوموسیٰ رضی اللہ عنہ کو دیا اور دوسرا عمار رضی اللہ عنہ کو اور کہا کہ آپ دونوں بھائی کپڑے پہن کر جمعہ پڑھنے چلیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 162230,
        "last_updated": null
    },
    {
        "urduURN": 4070060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7108,
        "hadithSanad": "ہم سے عبداللہ بن عثمان نے بیان کیا ، انہوں نے کہا ہم کو عبداللہ بن مبارک نے خبر دی ، انہیں یونس نے خبر دی ، انہیں زہری نے ، انہیں حمزہ بن عبداللہ بن عمر رضی اللہ عنہما نے خبر دی اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جب اللہ کسی قوم پر عذاب نازل کرتا ہے تو عذاب ان سب لوگوں پر آتا ہے جو اس قوم میں ہوتے ہیں پھر انہیں ان کے اعمال کے مطابق اٹھایا جائے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 162240,
        "last_updated": null
    },
    {
        "urduURN": 4070070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7109,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے بیان کیا ، کہا ہم سے اسرائیل ابوموسیٰ نے بیان کیا",
        "hadithText": "اور میری ان سے ملاقات کوفہ میں ہوئی تھی ۔ وہ ابن شبرمہ کے پاس آئے اور کہا کہ مجھے عیسیٰ ( منصور کے بھائی اور کوفہ کے والی ) کے پاس لے چلو تاکہ میں اسے نصیحت کروں ۔ غالباً ابن شبرمہ نے خوف محسوس کیا اور نہیں لے گئے ۔ انہوں نے اس پر بیان کیا کہ ہم سے حسن بصری نے بیان کیا کہ جب حسن بن علی امیر معاویہ رضی اللہ عنہم کے خلاف لشکر لے کر نکلے تو عمرو بن عاص نے امیر معاویہ رضی اللہ عنہ سے کہا کہ میں ایسا لشکر دیکھتا ہوں جو اس وقت تک واپس نہیں جا سکتا جب تک اپنے مقابل کو بھگا نہ لے ۔ پھر امیر معاویہ رضی اللہ عنہ نے کہا کہ مسلمانوں کے اہل و عیال کا کون کفیل ہو گا ؟ جواب دیا کہ میں ۔ پھر عبداللہ بن عامر اور عبدالرحمٰن بن سمرہ نے کہا کہ ہم امیرمعاویہ رضی اللہ عنہ سے ملتے ہیں ( اور ان سے صلح کے لیے کہتے ہیں ) حسن بصری نے کہا کہ میں نے ابوبکرہ رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ حسن رضی اللہ عنہ آئے تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرا یہ بیٹا سید ہے اور امید ہے کہ اس کے ذریعہ اللہ مسلمانوں کی دو جماعتوں میں صلح کرا دے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 162250,
        "last_updated": null
    },
    {
        "urduURN": 4070080,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7110,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا کہ عمرو نے بیان کیا ، انہیں محمد بن علی نے خبر دی ، انہیں اسامہ رضی اللہ عنہ کے غلام حرملہ نے خبر دی ۔ عمرو نے بیان کیا کہ",
        "hadithText": "میں نے حرملہ کو دیکھا تھا ۔ حرملہ نے بیان کیا کہ مجھے اسامہ نے علی رضی اللہ عنہ کے پاس بھیجا اور مجھ سے کہا ، اس وقت تم سے علی رضی اللہ عنہ پوچھیں گے کہ تمہارے ساتھی ( اسامہ رضی اللہ عنہ ) جنگ جمل و صفین سے کیوں پیچھے رہ گئے تھے تو ان سے کہنا کہ انہوں نے آپ سے کہا ہے کہ اگر آپ شیر کے منہ میں ہوں تب بھی میں اس میں بھی آپ کے ساتھ رہوں لیکن یہ معاملہ ہی ایسا ہے یعنی مسلمانوں کی آپس کی جنگ تو ( اس میں شرکت صحیح ) نہیں معلوم ہوئی ( حرملہ کہتے ہیں کہ ) چنانچہ انہوں نے کوئی چیز نہیں دی ۔ پھر میں حسن ، حسین اور عبداللہ بن جعفر رضی اللہ عنہم کے پاس گیا تو انہوں نے میری سواری پر اتنا مال لدوا دیا جتنا کہ اونٹ اٹھا نہ سکتا تھا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 162260,
        "last_updated": null
    },
    {
        "urduURN": 4070090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7111,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، انہوں نے کہا ہم سے حماد بن زید نے بیان کیا ، ان سے ایوب نے ، ان سے نافع نے کہ",
        "hadithText": "جب اہل مدینہ نے یزید بن معاویہ کی بیعت سے انکار کیا تو عبداللہ بن عمر رضی اللہ عنہما نے اپنے خادموں اور لڑکوں کو جمع کیا اور کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔ آپ نے فرمایا کہ ہر غدر کرنے والے کے لیے قیامت کے دن ایک جھنڈا کھڑا کیا جائے گا اور ہم نے اس شخص ( یزید ) کی بیعت ، اللہ اور اس کے رسول کے نام پر کی ہے اور میرے علم میں کوئی غدر اس سے بڑھ کر نہیں ہے کہ کسی شخص سے اللہ اور اس کے رسول کے نام پر بیعت کی جائے اور پھر اس سے جنگ کی جائے اور دیکھو مدینہ والو ! تم میں سے جو کوئی یزید کی بیعت کو توڑے اور دوسرے کسی سے بیعت کرے تو مجھ میں اور اس میں کوئی تعلق نہیں رہا ، میں اس سے الگ ہوں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 162270,
        "last_updated": null
    },
    {
        "urduURN": 4070100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7112,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ‘ انہوں نے کہا ہم سے شہاب نے بیان کیا ان سے جوف نے بیان کیا ‘ ان سے ابومنہال نے بیان کیا کہ",
        "hadithText": "جب عبداللہ بن زیاد اور مروان شام میں تھے اور ابن زبیر رضی اللہ عنہ نے مکہ میں اور خوارج نے بصرہ میں قبضہ کر لیا تھا تو میں اپنے والد کے ساتھ حضرت ابوبرزہ اسلمی رضی اللہ عنہ کے پاس گیا ۔ جب ہم ان کے گھر میں ایک کمرہ کے سایہ میں بیٹھے ہوئے تھے جو بانس کا بنا ہوا تھا ‘ ہم ان کے پاس بیٹھ گئے اور میرے والد ان سے بات کرنے لگے اور کہا اے ابوبرزہ ! آپ نہیں دیکھتے لوگ کن باتوں میں آفت اور اختلاف میں الجھ گئے ہیں ۔ میں نے ان کی زبان سے سب سے پہلی بات یہ سنی کہ میں جو ان قریش کے لوگوں سے ناراض ہوں تو محض اللہ کی رضامندی کے لیے ‘ اللہ میرا اجر دینے والا ہے ۔ عرب کے لوگو ! تم جانتے ہو پہلے تمہارا کیا حال تھا تم گمراہی میں گرفتار تھے ‘ اللہ نے اسلام کے ذریعہ اور حضرت محمد صلی اللہ علیہ وسلم کے ذریعہ تم کو اس بری حالت سے نجات دی ۔ یہاں تک کہ تم اس رتبہ کو پہنچے ۔ ( دنیا کے حاکم اور سردار بن گئے ) پھر اسی دنیا نے تم کو خراب کر دیا ۔ دیکھو ! یہ شخص جو شام میں حاکم بن بیٹھا ہے یعنی مروان دنیا کے لئے لڑ رہا ہے ۔ یہ لوگ جو تمہارے سامنے ہیں ۔ ( خوارج ) واللہ ! یہ لوگ صرف دنیا کے لیے لڑرہے ہیں اور وہ جو مکہ میں ہے عبداللہ بن زبیر رضی اللہ عنہما واللہ ! وہ بھی صرف دنیا کے لیے لڑ رہا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 162280,
        "last_updated": null
    },
    {
        "urduURN": 4070110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7113,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ ان سے واصل احدب نے ‘ ان سے ابووائل نے اور ان سے حذیفہ بن الیمان نے بیان کیا کہ",
        "hadithText": "آج کل کے منافق نبی کریم صلی اللہ علیہ وسلم کے زمانے کے منافقین سے بد تر ہیں ۔ اس وقت چھپاتے تھے اور آج اس کا کھلم کھلا اظہار کر رہے ہیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 162290,
        "last_updated": null
    },
    {
        "urduURN": 4070120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7114,
        "hadithSanad": "ہم سے خلاد نے بیان کیا ‘ انہوں نے کہا ہم سے مسعر نے بیان کیا ‘ ان سے حبیب بن ابی ثابت نے بیان کیا ‘ ان سے ابوالشعثاء نے بیان کیا اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانہ میں نفاق تھا آج تو ایمان کے بعد کفر اختیار کرنا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 162300,
        "last_updated": null
    },
    {
        "urduURN": 4070130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7115,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت قائم نہ ہو گی یہاں تک کہ ایک شخص دوسرے کی قبر کے پاس سے گزرے گا اور کہے گا کاش ! میں اسی کی جگہ ہوتا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 162310,
        "last_updated": null
    },
    {
        "urduURN": 4070140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7116,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا ہم کو شعیب نے خبر دی ‘ ان سے زہری نے بیان کیا ‘ ان سے سعید بن مسیب نے بیان کیا اور انہیں حضرت ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت قائم نہیں ہو گی یہاں تک کہ قبیلہ دوس کی عورتوں کا ذوالخلصہ کا ( طواف کرتے ہوئے ) چوتڑ سے چوتڑ چھلے گا اور ذوالخلصہ قبیلہ دوس کا بت تھا جس کو وہ زمانہ جاہلیت میں پوجا کرتے تھے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 162320,
        "last_updated": null
    },
    {
        "urduURN": 4070150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7117,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے سلیمان نے بیان کیا ‘ ان سے ابو الغیث نے اور ان سے ابوہریرہ رضی اللہ عنہ نے",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا قیامت اس وقت تک قائم نہ ہو گی یہاں تک کہ قحطان کا ایک شخص ( بادشاہ بن کر ) نکلے گا اور لوگوں کو اپنے ڈنڈے سے ہانکے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 162330,
        "last_updated": null
    },
    {
        "urduURN": 4070160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7118,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا شعیب نے خبر دی ‘ انہوں نے کہا ہمیں زہری نے خبر دی کہ سعید بن مسیب نے بیان کیا کہ مجھے ابوہریرہ رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت قائم نہ ہو گی یہاں تک کہ سرزمین حجاز سے ایک آگ نکلے گی اور بصریٰ میں اونٹوں کی گردنوں کو روشن کر دے گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 162340,
        "last_updated": null
    },
    {
        "urduURN": 4070170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7119,
        "hadithSanad": "ہم سے عبداللہ بن سعید الکندی نے بیان کیا ‘ انہوں نے کہا ہم سے عقبہ بن خالد نے بیان کیا ‘ انہوں نے کہا ہم سے عبیداللہ نے بیان کیا ‘ ان سے خبیب بن عبدالرحمٰن نے بیان کیا ‘ان سے ان کے دادا حفص بن عاصم نے بیان کیا ‘ ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا عنقریب دریائے فرات سے سونے کا ایک خزانہ نکلے گا پس جو کوئی وہاں موجود ہو وہ اس میں سے کچھ نہ لے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 162350,
        "last_updated": null
    },
    {
        "urduURN": 4070180,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7120,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ بن ابی کثیر نے بیان کیا ، ان سے شعبہ نے ، ان سے معبد نے بیان کیا ، انہوں نے حارثہ بن وہب رضی اللہ عنہ سے سنا ، انہوں نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ صدقہ کرو کیونکہ عنقریب لوگوں پر ایک ایسا زمانہ آ : ے گا جب ایک شخص اپنا صدقہ لے کر پھرے گا اور کوئی اسے لینے والا نہیں ملے گا ۔ مسدد نے بیان کیا کہ حارثہ عبیداللہ بن عمر کے ماں شریک بھائی تھے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 162370,
        "last_updated": null
    },
    {
        "urduURN": 4070190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7121,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کوشعیب نے خبر دی ، کہا ہم سے ابوالزنادنے بیان کیا ، ان سے عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت اس وقت تک قائم نہ ہو گی جب تک دو عظیم جماعتیں جنگ نہ کریں گی ۔ ان دونوں جماعتوں کے درمیان بڑی خونریزی ہو گی ۔ حالانکہ دونوں کا دعویٰ ایک ہی ہو گا اور یہاں تک کہ بہت سے جھوٹے دجال بھیجے جائیں گے ۔ تقریباً تین دجال ۔ ان میں سے ہر ایک دعویٰ کرے گا کہ وہ اللہ کا رسول ہے اور یہاں تک کہ علم اٹھا لیا جائے گا اور زلزلوں کی کثرت ہو گی اور زمانہ قریب ہو جائے گا اور فتنے ظاہر ہو جائیں گے اور ہرج بڑھ جائے گا اور ہرج سے مراد قتل ہے اور یہاں تک کہ تمہارے پاس مال کی کثرت ہو جائے گی بلکہ بہہ پڑے گا اور یہاں تک کہ صاحب مال کو اس کا فکر دامن گیر ہو گا کہ اس کا صدقہ قبول کون کرے اور یہاں تک کہ وہ پیش کرے گا لیکن جس کے سامنے پیش کرے گا وہ کہے گا کہ مجھے اس کی ضرورت نہیں ہے اور یہاں تک کہ لوگ بڑی بڑی عمارتوں پر آپس میں فخر کریں گے ۔ ایک سے ایک بڑھ چڑھ کر عمارات بنائیں گے اور یہاں تک کہ ایک شخص دوسرے کی قبر سے گزرے گا اور کہے گا کہ کاش میں بھی اسی جگہ ہوتا اور یہاں تک کہ سورج مغرب سے نکلے گا ۔ پس جب وہ اس طرح طلوع ہو گا اور لوگ دیکھ لیں گے تو سب ایمان لے آئیں گے لیکن یہ وہ وقت ہو گا جب کسی ایسے شخص کو اس کا ایمان لانا فائدہ نہ پہنچائے گا جو پہلے سے ایمان نہ لایا ہو یا اس نے اپنے ایمان کے ساتھ اچھے کام نہ کئے ہوں اور قیامت اچانک اس طرح قائم ہو جائے گی کہ دو آدمیوں نے اپنے درمیان کپڑا پھیلا رکھا ہو گا اور اسے ابھی بیچ نہ پائے ہوں گے نہ لپیٹ پائے ہوں گے اور قیامت اس طرح برپا ہو جائے گی کہ ایک شخص اپنی اونٹنی کا دودھ نکال کر واپس ہوا ہو گا کہ اسے کھا بھی نہ پایا ہو گا اور قیامت اس طرح قائم ہو جائے گی کہ وہ اپنے حوض کو درست کر رہا ہو گا اور اس میں سے پانی بھی نہ پیا ہو گا اور قیامت اس طرح قائم ہو جائے گی کہ اس نے اپنالقمہ منہ کی طرف اٹھایا ہو گا اور ابھی اسے کھایا بھی نہ ہو گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 162380,
        "last_updated": null
    },
    {
        "urduURN": 4070200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7122,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ، کہا ہم سے یحییٰ نے بیان کیا ، کہا مجھ سے اسماعیل نے بیان کیا ، ان سے قیس نے بیان کیا ، کہ مجھ سے مغیرہ بن شعبہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "دجال کے بارے میں نبی کریم صلی اللہ علیہ وسلم سے جتنا میں نے پوچھا اتنا کسی نے نہیں پوچھا اور آنحضرت صلی اللہ علیہ وسلم نے مجھ سے فرمایا تھا کہ اس سے تمہیں کیا نقصان پہنچے گا ۔ میں نے عرض کیا کہ لوگ کہتے ہیں کہ اس کے ساتھ روٹی کا پہاڑ اور پانی کی نہر ہو گی ۔ فرمایا کہ وہ اللہ پر اس سے بھی زیادہ آسان ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 162390,
        "last_updated": null
    },
    {
        "urduURN": 4070210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7123,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا کہا ہم سے وہیب نے کہا ہم سے ایوب سختیانی نے انہوں نے نافع سے انہوں نے ابن عمر رضی اللہ عنہما سے امام بخاری رحمہ اللہ نے کہا میں سمجھتا ہوں کہ",
        "hadithText": "ابن عمر رضی اللہ عنہما نے آنحضرت صلی اللہ علیہ وسلم سے روایت کی آپ نے فرمایاد جال داہنی آنکھ سے کانا ہو گا اس کی آنکھ کیا ہے گویا پھولا ہوا انگور ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 162400,
        "last_updated": null
    },
    {
        "urduURN": 4070220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7124,
        "hadithSanad": "ہم سے سعد بن حفص نے بیان کیا ، انہوں نے کہا ہم سے شیبان نے بیان کیا ، ان سے یحییٰ نے بیان کیا ، ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا دجال آئے گا اور مدینہ کے ایک کنارے قیام کرے گا ۔ پھر مدینہ تین مرتبہ کانپے گا اور اس کے نتیجے میں ہر کافر اور منافق نکل کر اس کی طرف چلا جائے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 162410,
        "last_updated": null
    },
    {
        "urduURN": 4070230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7125,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ اویسی نے بیان کیا ، کہا ہم سے ابراہیم بن عبدالرحمٰن بن عوف کے دادا نے بیان کیا ، انہوں نے ابوبکرہ سے انہوں نے آنحضرت صلی اللہ علیہ وسلم سے",
        "hadithText": "آپ نے فرمایا مدینہ والوں پر دجال کا رعب نہیں پڑے گا اس دن مدینہ کے سات دروازے ہوں گے ہر دروازے پر دو فرشتے ( پہرہ دیتے ) ہوں گے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 162420,
        "last_updated": null
    },
    {
        "urduURN": 4070240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7126,
        "hadithSanad": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے محمد بن بشر نے بیان کیا ، کہا ہم سے مسعر نے بیان کیا ، ان سے سعد بن ابراہیم نے بیان کیا ، ان سے ان کے والد نے اور ان سے ابوبکرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ پر مسیح دجال کا رعب نہیں پڑے گا ۔ اس وقت اس کے سات دروازے ہوں گے اور ہر دروازے پر پہرہ دار دو فرشتے ہوں گے ۔ علی بن عبداللہ نے کہا کہ محمد بن اسحاق نے صالح بن ابراہیم سے روایت کیا ، ان سے ان کے والد ابراہیم بن عبدالرحمٰن بن عوف نے بیان کیا کہ میں بصرہ گیا تو مجھ سے ابوبکرہ رضی اللہ عنہ نے یہی حدیث بیان کی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 162430,
        "last_updated": null
    },
    {
        "urduURN": 4070250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7127,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انہوں نے کہا ہم سے ابرہیم نے بیان کیا ، ان سے صالح نے بیان کیا ، ان سے ابن شہاب نے بیان کیا ، ان سے سالم بن عبداللہ نے بیان کیا اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم لوگوں میں کھڑے ہوئے اور اللہ کی تعریف اس کی شان کے مطابق بیان کی ۔ پھر دجال کا ذکر فرمایا کہ میں تمہیں اس سے ڈراتا ہوں اور کوئی نبی ایسا نہیں گزرا جس نے اپنی قوم کو اس سے نہ ڈرایا ہو ، البتہ میں تمہیں اس کے بارے میں ایک بات بتاتا ہوں جو کسی نبی نے اپنی قوم کو نہیں بتائی تھی اور وہ یہ کہ وہ کانا ہو گا اور اللہ تعالیٰ کانا نہیں ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 162450,
        "last_updated": null
    },
    {
        "urduURN": 4070260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7128,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ، کہا ہم سے لیث بن سعد نے بیان کیا ، ان سے عقیل نے ، ان سے ابن شہاب نے ، ان سے سالم نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا میں سویا ہوا ( خواب میں ) کعبہ کا طواف کر رہا تھا کہ ایک صاحب جو گندم گوں تھے اور ان کے سر کے بال سیدھے تھے اور سر سے پانی ٹپک رہا تھا ( پر میری نظر پڑی ) میں نے پوچھا یہ کون ہیں ؟ میرے ساتھ کے لوگوں نے بتایا کہ یہ حضرت عیسیٰ ابن مریم علیہما السلام ہیں پھر میں نے مڑ کر دیکھا تو موٹے شخص پر نظر پڑی جو سرخ تھا اس کے بال گھونگھریالے تھے ، ایک آنکھ کا کانا تھا ، اس کی ایک آنکھ انگور کی طرح اٹھی ہوئی تھی ۔ لوگوں نے بتایا کہ یہ دجال ہے ۔ اس کی صورت عبدالعزیٰ بن قطن سے بہت ملتی تھی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 162460,
        "last_updated": null
    },
    {
        "urduURN": 4070270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7129,
        "hadithSanad": "ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، کہا ہم سے ابراہیم بن سعد نے بیان کیا ، ان سے صالح نے ، ان سے ابن شہاب نے ، ان سے عروہ نے اور ان سے حضرت عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ اپنی نماز میں دجال کے فتنے سے پناہ مانگتے تھے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 162470,
        "last_updated": null
    },
    {
        "urduURN": 4070280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7130,
        "hadithSanad": "ہم سے عبدان نے بیان کیا کہ مجھے میرے والد نے خبر دی ، انہیں شعبہ نے ، انہیں عبدالملک نے ، انہیں ربعی نے اور ان سے حذیفہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے دجال کے بارے میں فرمایا کہ اس کے ساتھ پانی اور آگ ہو گی اور اس کی آگ ٹھنڈا پانی ہو گی اور پانی آگ ہو گا ۔ ابومسعود رضی اللہ عنہ نے بیان کیا کہ میں نے بھی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 162480,
        "last_updated": null
    },
    {
        "urduURN": 4070290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7131,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، ان سے قتادہ نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جو نبی بھی مبعوث کیا گیا تو انہوں نے اپنی قوم کو کانے جھوٹے سے ڈرایا ۔ آگاہ رہو کہ وہ کانا ہے اور تمہارا رب کانا نہیں ہے ۔ اور اس کی دونوں آنکھوں کے درمیان ” کافر “ لکھا ہوا ہے ۔ اس باب میں ابوہریرہ رضی اللہ عنہ اور ابن عباس رضی اللہ عنہما نے بھی نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث روایت کی ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 162490,
        "last_updated": null
    },
    {
        "urduURN": 4070300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7132,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، انہیں عبیداللہ بن عبداللہ بن عتبہ بن مسعود نے خبر دی ، ان سے ابوسعید رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ایک دن رسول کریم صلی اللہ علیہ وسلم نے ہم سے دجال کے متعلق ایک طویل حدیث بیان کی ۔ آنحضرت صلی اللہ علیہ وسلم کے ارشادات میں یہ بھی تھا کہ آپ نے فرمایا دجال آئے گا اور اس کے لیے ناممکن ہو گا کہ مدینہ کی گھاٹیوں میں داخل ہو ۔ چنانچہ وہ مدینہ منورہ کے قریب کسی شور والی زمین پر قیام کرے گا ۔ پھر اس دن اس کے پاس ایک مرد مومن جائے گا اور وہ افضل ترین لوگوں میں سے ہو گا ۔ اور اس سے کہے گا کہ میں گواہی دیتا ہوں اس بات کی جو رسول کریم صلی اللہ علیہ وسلم نے ہم سے بیان فرمایا تھا ۔ اس پر دجال کہے گا کیا تم دیکھتے ہو اگر میں اسے قتل کر دوں اور پھر زندہ کروں تو کیا تمہیں میرے معاملہ میں شک و شبہ باقی رہےگا ؟ اس کے پاس والے لوگ کہیں گے کہ نہیں چنانچہ وہ اس صاحب کو قتل کر دے گا اور پھر اسے زندہ کر دے گا ۔ اب وہ صاحب کہیں گے کہ واللہ ! آج سے زیادہ مجھے تیرے معاملے میں پہلے اتنی بصیرت حاصل نہ تھی ۔ اس پر دجال پھر انہیں قتل کرنا چاہے گا لیکن اس مرتبہ اسے مار نہ سکے گا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 162500,
        "last_updated": null
    },
    {
        "urduURN": 4070310,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7133,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، ان سے امام مالک نے بیان کیا ، ان سے نعیم بن عبداللہ بن المجمر نے بیان کیا ، اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول کریم صلی اللہ علیہ وسلم نے فرمایا مدینہ منورہ کے راستوں پر فرشتے پہرہ دیتے ہیں نہ یہاں طاعون آ سکتی ہے اور نہ دجال آ سکتا ہے ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 162510,
        "last_updated": null
    },
    {
        "urduURN": 4070320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7134,
        "hadithSanad": "مجھ سے یحییٰ بن موسیٰ نے بیان کیا ، انہوں نے کہا ہم سے یزید بن ہارون نے بیان کیا ، انہوں نے کہا ہم کو شعبہ نے خبر دی ، انہیں قتادہ نے ، انہیں انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا دجال مدینہ تک آئے گا تو یہاں فرشتوں کو اس کی حفاظت کرتے ہوئے پائے گا ۔ چنانچہ نہ دجال اس کے قریب آ سکتا ہے اور نہ طاعون ، انشاءاللہ ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 162520,
        "last_updated": null
    },
    {
        "urduURN": 4070330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7135,
        "hadithSanad": "ہم سے ابوالیمان نے بیان کیا ، کہا ہم کو شعیب نے خبر دی ، انہیں زہری نے ، ( دوسری سند ) اور امام بخاری نے کہا کہ ہم سے اسماعیل بن ابی اویس نے بیان کیا ، کہا مجھ سے میرے بھائی عبدالحمید نے ، ان سے سلیمان بن بلال نے ، ان سے محمد بن ابی عتیق نے ، ان سے ابن شہاب نے ، ان سے عروہ بن زبیر نے ، ان سے زینب بنت ابی سلمہ نے بیان کیا ، ان سے ام حبیبہ بنت ابی سفیان رضی اللہ عنہم نے اور ان سے زینب بنت جحش رضی اللہ عنہا نے کہ",
        "hadithText": "ایک دن رسول کریم صلی اللہ علیہ وسلم ان کے پاس گھبرائے ہوئے داخل ہوئے ، آپ فرما رہے تھے کہ تباہی ہے ۔ عربوں کے لیے اس برائی سے جو قریب آ چکی ہے ۔ آج یاجوج و ماجوج کی دیوار سے اتنا کھل گیا ہے اور آپ نے اپنے انگوٹھے اور اس کی قریب والی انگلی کو ملا کر ایک حلقہ بنایا ۔ اتنا سن کر زینب بن جحش رضی اللہ عنہا نے بیان کیا کہ میں نے عرض کیا یا رسول اللہ ! تو کیا ہم اس کے باوجود ہلاک ہو جائیں گے کہ ہم میں نیک صالح لوگ بھی زندہ ہوں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں جب برائی بہت بڑھ جائے گی ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 162530,
        "last_updated": null
    },
    {
        "urduURN": 4070340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7136,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ، کہا ہم سے وہیب بن خالد نے بیان کیا ، ان سے عبداللہ بن طاؤس نے بیان کیا ، ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ” سد “ یعنی یاجوج و ماجوج کی دیوار اتنی کھل گئی ہے ۔ وہیب نے نوے کا اشارہ کر کے بتلایا ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 162540,
        "last_updated": null
    },
    {
        "urduURN": 4069545,
        "collection": "bukhari",
        "volumeNumber": 1,
        "bookNumber": 92,
        "bookName": "a",
        "babNumber": 0,
        "babName": "0",
        "hadithNumber": 7051,
        "hadithSanad": "",
        "hadithText": "ابوحازم نے بیان کیا کہ نعمان بن ابی عیاش نے بھی سنا کہ میں ان سے یہ حدیث بیان کر رہا ہوں تو انہوں نے کہا کہ کیا تو نے سہل رضی اللہ عنہ سے اسی طرح یہ حدیث سنی تھی ؟ میں نے کہا کہ ہاں ۔ انہوں نے کہا کہ میں گواہی دیتا ہوں کہ میں نے ابو سعید خدری رضی اللہ عنہ سے یہ حدیث اسی طرح سنی تھی ۔ ابوسعید اس میں اتنا بڑھاتے تھے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ یہ لوگ مجھ میں سے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم سے اس وقت کہا جائے گا کہ آپ کو معلوم نہیں کہ آپ کے بعد انہوں نے کیا تبدیلیاں کر دی تھیں ؟ میں کہوں گا کہ دوری ہو دوری ہو ان کے لیے جنہوں نے میرے بعد دین میں تبدیلیاں کر دی تھیں ۔</b>",
        "bookID": "92.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 161690,
        "last_updated": null
    }
]