[
    {
        "urduURN": 4071600,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7268,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے مسعر بن کدام اور ان کے علاوہ ( سفیان ثوری ) نے ‘ ان سے قیس بن مسلم نے ‘ ان سے طارق بن شہاب نے بیان کیا کہ",
        "hadithText": "ایک یہودی ( کعب احبار اسلام لانے سے پہلے ) نے حضرت عمر رضی اللہ عنہ سے کہا ‘ اے امیرالمؤمنین ! اگر ہمارے یہاں سورۃ المائدہ کی یہ آیت نازل ہوتی کہ ” آج میں نے تمہارے لیے تمہارے دین کو مکمل کردیااور تم پر اپنی نعمت کو پورا کر دیا اور تمہارے لیے اسلام کو بطور دین کے پسند کر لیا ۔ “ تو ہم اس دن کو عید ( خوشی ) کا دن بنا لیتے ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ میں جانتا ہوں کہ یہ آیت کس دن نازل ہوئی تھی ۔ عرفہ کے دن نازل ہوئی اور جمعہ کا دن تھا ۔ امام بخاری نے کہا یہ روایت سفیان نے مسعر سے سنی ۔ مسعر نے قیس سے سنا اور قیس نے طارق سے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 1,
        "matchingArabicURN": 163850,
        "last_updated": null
    },
    {
        "urduURN": 4071610,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7269,
        "hadithSanad": "ہم سے یحییٰ بن بکیر نے بیان کیا ‘کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل بن خالد نے ‘ ان سے ابن شہاب نے اور انہیں انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "انہوں نے عمر رضی اللہ عنہ سے وہ خطبہ سنا جو انہوں نے وفات نبوی کے دوسرے دن پڑھا تھا ۔ جس دن مسلمانوں نے ابوبکر رضی اللہ عنہ سے بیعت کی تھی ۔ حضرت عمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے منبر پر چڑھے اور ابوبکر رضی اللہ عنہ سے پہلے خطبہ پڑھا پھر کہا ‘ امابعد ! اللہ تعالیٰ نے اپنے رسول کے لیے وہ چیز ( آخرت ) پسند کی جو اس کے پاس تھی اس کے بجائے جو تمہارے تھی یعنی دنیا اور یہ کتاب اللہ موجود ہے جس کے ذریعہ اللہ تعالیٰ نے تمہارے رسول کو دین وسیدھا راستہ بتلا یا پس اسے تم تھامے رہو تو ہدایت یاب رہو گے ۔ یعنی اس راستے پر رہو گے جو اللہ نے اپنے پیغمبر کو بتلایا تھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 2,
        "matchingArabicURN": 163860,
        "last_updated": null
    },
    {
        "urduURN": 4071620,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7270,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے وہیب بن خالد نے بیان کیا ‘ ان سے خالد حذاء نے ‘ ان سے عکرمہ نے ‘ ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مجھے اپنے سینے سے لگا یا اور فرمایا اے اللہ ! اسے قرآن کا علم سکھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 3,
        "matchingArabicURN": 163870,
        "last_updated": null
    },
    {
        "urduURN": 4071630,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7271,
        "hadithSanad": "ہم سے عبداللہ بن صباح نے بیان کیا ‘ کہا ہم سے معتمربن سلیمان نے بیان کیا ‘ کہا کہ میں نے عوف اعرابی سے سنا‘ان سے ابو المنہال نے بیان کیا ‘ انہوں نے ابوبرزہ رضی اللہ عنہ سے سنا ‘ انہوں نے کہا کہ",
        "hadithText": "اللہ تعالیٰ نے تمہیں اسلام اور محمد صلی اللہ علیہ وسلم کے ذریعہ غنی کر دیا ہے یا بلند درجہ کر دیا ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 4,
        "matchingArabicURN": 163880,
        "last_updated": null
    },
    {
        "urduURN": 4071640,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7272,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے عبداللہ بن دینار نے کہ عبداللہ بن عمر رضی اللہ عنہما نے عبدالملک بن مروان کو خط لکھا کہ",
        "hadithText": "وہ اس کی بیعت قبول کرتے ہیں اور یہ لکھا کہ میں تیرا حکم سنوں گا اور مانوں گا بشرطیکہ اللہ کی شریعت اور اس کے رسول کی سنت کے موافق ہو جہاں تک مجھ سے ممکن ہو گا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 5,
        "matchingArabicURN": 163890,
        "last_updated": null
    },
    {
        "urduURN": 4071650,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7273,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے سعید بن مسیب نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا مجھے جوامع الکلم ( مختصر الفاظ میں بہت سے معانی کو سمو دینا ) کے ساتھ بھیجا گیا ہے اور میری مدد رعب کے ذریعہ کی گئی اور میں سویا ہوا تھا کہ میں نے خواب میں دیکھا کہ میرے اس زمین کے خزانوں کی کنجیاں رکھ دی گئیں ۔ ابوہریرہ رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم تو چلے گئے اور تم مزے کر رہے ہو یا اسی جیسا کوئی کلمہ کہا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 6,
        "matchingArabicURN": 163900,
        "last_updated": null
    },
    {
        "urduURN": 4071660,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7274,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے سعید بن ابی سعید نے ‘ ان سے ان کے والد نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا انبیاء میں سے کوئی نبی ایسا نہیں جن کو کچھ نشانیاں ( یعنی معجزات ) نہ دئیے گئے ہوں جن کے مطابق ان پر ایمان لایا گیا ( آپ نے فرمایا کہ ) انسان ایمان لائے اور مجھے جو بڑا معجزہ دیا گیا وہ قرآن مجید ہے جو اللہ نے میری طرف بھیجا ۔ پس میں امید کرتا ہوں کہ قیامت کے دن شمار میں تمام انبیاء سے زیادہ پیروی کرنے والے میرے ہوں گے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 7,
        "matchingArabicURN": 163910,
        "last_updated": null
    },
    {
        "urduURN": 4071670,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7275,
        "hadithSanad": "ہم سے عمرو بن عباس نے بیان کیا ‘ کہا ہم سے عبدالرحمٰن بن مہدی نے ‘ کہا ہم سے سفیان ثوری نے ‘ ان سے واصل نے ‘ ان سے ابووائل نے بیان کیا کہ",
        "hadithText": "اس مسجد ( خانہ کعبہ ) میں ‘ میں شیبہ بن عثمان حجبی ( جو کعبہ کے کلیدبردار تھے ) کے پاس بیٹھا تو انہوں نے کہا کہ جہاں تم بیٹھے ہو ‘ وہیں عمر رضی اللہ عنہ بھی میرے پاس بیٹھے تھے اور انہوں نے کہا تھا کہ میرا ارادہ ہے کہ کعبہ میں کسی طرح کا سونا چاندی نہ چھوڑوں اور سب مسلمانوں میں تقسیم کر دوں جو نذر اللہ کعبہ میں جمع ہے ۔ میں نے کہا کہ آپ ایسا نہیں کر سکتے ۔ کہاں کیوں ؟ میں نے کہا کہ آپ کے دونوں ساتھیوں ( رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ ) نے ایسا نہیں کیا تھا ۔ اس پر انہوں نے کہا کہ وہ دونوں بزرگ ایسے ہی تھے جن کی اقتداء کرنی ہی چاہیے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 8,
        "matchingArabicURN": 163920,
        "last_updated": null
    },
    {
        "urduURN": 4071680,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7276,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ کہا کہ میں نے اعمش سے پوچھا تو انہوں نے زید بن وہب سے بیان کیا کہ میں نے حذیفہ بن یمان رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ امانت داری آسمان سے بعض لوگوں کے دلوں کی جڑوں میں اتری ۔ ( یعنی ان کی فطرت میں داخل ہے ) اور قرآن مجید نازل ہوا تو انہوں نے قرآن مجید کا مطلب سمجھا اور سنت کا علم حاصل کیا تو قرآن و حدیث دونوں سے اس ایمانداری کو جو فطرتی تھی پوری قوت مل گئی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 9,
        "matchingArabicURN": 163930,
        "last_updated": null
    },
    {
        "urduURN": 4071690,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7277,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ‘ کہا ہم سے شعبہ نے بیان کیا ‘ کہا ہم کو عمرو بن مرہ نے خبر دی ‘ کہا میں نے مرۃ الہمدانی سے سنا ‘ بیان کیا کہ",
        "hadithText": "عبداللہ بن مسعود رضی اللہ عنہما نے کہا ‘ سب سے اچھی بات کتاب اللہ اور سب سے اچھا طریقہ صلی اللہ علیہ وسلم کا طریقہ ہے اور سب سے بری نئی بات ( بدعت ) پیدا کرنا ہے ( دین میں ) اور بلاشبہ جس کا تم سے وعدہ کیا جاتا ہے وہ آ کر رہے گی اور تم پر وردگار سے بچ کر کہیں نہیں جا سکتے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 10,
        "matchingArabicURN": 163940,
        "last_updated": null
    },
    {
        "urduURN": 4071700,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے زہری نے ‘ ان سے عبیداللہ نے اور ان سے ابوہریرہ اور زید بن خالد رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں موجود تھے آپ نے فرمایا یقیناً میں تمہارے درمیان کتاب اللہ سے فیصلہ کروں گا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 11,
        "matchingArabicURN": 163950,
        "last_updated": null
    },
    {
        "urduURN": 4071710,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7280,
        "hadithSanad": "ہم سے محمد بن سنان نے بیان کیا ‘ ان سے فلیح بن سلیمان نے بیان کیا ‘ ان سے ہلال بن علی نے بیان کیا ‘ ان سے عطاء بن یسار نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ساری امت جنت میں جائے گی سوائے ان کے جنہوں نے انکار کیا ۔ صحابہ نے عرض کیا یا رسول اللہ ! انکار کون کرے گا ؟ فرمایا کہ جو میری اطاعت کرے گا وہ جنت میں داخل ہو گا اور جو میری نافرمانی کرے گا اس نے انکار کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 12,
        "matchingArabicURN": 163960,
        "last_updated": null
    },
    {
        "urduURN": 4071720,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7281,
        "hadithSanad": "ہم سے محمد بن عبادہ نے بیان کیا ‘ کہا ہم کو یزید بن ہاروں نے خبر دی ‘ کہا ہم سے سلیم بن حیان نے بیان کیا اور یزید بن ہارون نے ان کی تعریف کی ‘ کہا ہم سے سعید بن میناء نے بیان کیا ‘ انہوں نے کہا کہ میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "فرشتے نبی کریم صلی اللہ علیہ وسلم کے پاس آئے ( جبرائیل ومیکائیل ) اور آپ سوئے ہوئے تھے ۔ ایک نے کہا کہ یہ سوئے ہوئے ہیں ‘ دوسرے نے کہا کہ ان کی آنکھیں سو رہی ہیں لیکن ان کا دل بیدار ہے ۔ انہوں نے کہا کہ تمہارے ان صاحب ( آنحضرت صلی اللہ علیہ وسلم ) کی ایک مثال ہے پس ان کی مثال بیان کرو ۔ تو ان میں سے ایک کہا کہ یہ سو رہے ہیں ۔ دوسرے نے کہا کہ آنکھ سو رہی ہے اور دل بیدار ہے ۔ انہوں نے کہا کہ ان کی مثال اس شخص جیسی ہے جس نے ایک گھر بنایا اور وہاں کھانے کی دعوت کی اور بلانے والے کو بھیجا ‘ پس جس نے بلانے والے کی دعوت قبول کر لی وہ گھر میں داخل ہو گیا اور دسترخوان سے کھایا اور جس نے بلانے والے کی دعوت قبول نہیں کی وہ گھر میں داخل نہیں ہوا اور دسترخوان سے کھانا نہیں کھا یا‘پھر انہوں نے کہا کہ اس کی ان کے لیے تفسیر کر دو تاکہ یہ سمجھ جائیں ۔ بعض نے کہا کہ یہ تو سوئے ہوئے ہیں لیکن بعض نے کہا کہ آنکھیں گو سو رہی ہیں لیکن دل بیدار ہے ۔ پھر انہوں نے کہا کہ گھر تو جنت ہے اور بلانے والے محمد صلی اللہ علیہ وسلم ہیں ۔ پس جو ان کی اطاعت کرے گا وہ اللہ کی اطاعت کرے گا اور جو ان کی نافرمانی کرے گا وہ اللہ کی نافرمانی کرے گا اور محمد صلی اللہ علیہ وسلم اچھے اور برے لوگوں کے درمیانی فرق کرنے والے ہیں ۔ محمد بن عبادہ کے ساتھ اس حدیث کو قتیبہ بن سعید نے بھی لیث سے روایت کیا ‘ انہوں نے خالد بن یزید مصری سے ‘ انہوں نے سعید بن ابی ہلال سے ‘ انہوں نے جابر سے کہ آنحضرت صلی اللہ علیہ وسلم ہم پر بیدار ہوئے ‘ پھر یہی حدیث نقل کی اسے ترمذی نے وصل کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 13,
        "matchingArabicURN": 163971,
        "last_updated": null
    },
    {
        "urduURN": 4071730,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7282,
        "hadithSanad": "ہم سے ابونعیم فاضل بن دکین نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابراہیمی نے ‘ ان سے ہمام نے اور ان سے حذیفہ رضی اللہ عنہ نے کہا کہ",
        "hadithText": "اے قرآن و حدیث پڑھنے والو ! تم اگر قرآن و حدیث پر نہ جمو گے ‘ اھر ادھر دائیں بائیں راستہ لو گے تو بھی گمراہ ہو گے بہت ہی بڑے گمراہ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 14,
        "matchingArabicURN": 163990,
        "last_updated": null
    },
    {
        "urduURN": 4071740,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7283,
        "hadithSanad": "ہم سے ابو کریب محمد بن علاء نے بیان کیا ‘ کہا ہم سے اسامہ نے بیان کیا ‘ ان سے برید نے ‘ ان سے ان کے دادا ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا میری اور جس دعوت کے ساتھ مجھے اللہ تعالیٰ نے بھیجا ہے اس کی مثال ایک ایسے شخص جیسی ہے جو کسی قوم کے پاس آئے اور کہے اے قوم ! میں نے ایک لشکر اپنی آنکھوں سے دیکھا ہے اور میں ننگ دھڑنگ تو کو ڈرانے والا ہوں ‘ پس بچاؤ کی صورت کرو تو اس قوم کے ایک گروہ نے بات مان لی اور رات کے شروع ہی میں نکل بھاگے اور حفاظت کی جگہ چلے گئے ۔ اس لیے نجات پا گئے لیکن ان کی دوسری جماعت نے جھٹلایا اور اپنی جگہ ہی پر موجود رہے ‘ پھر صبح سویرے ہی دشمن کے لشکر نے انہیں آ لیا اور انہیں ما را اور ان کو برباد کر دیا ۔ توبہ مثال ہے اس کی جو میری اعطاعت کریں اور جو دعوت میں لایا ہوں اس کی پیروی کریں اور اس کی مثال ہے جو میری نافرمانی کریں اور جو حق میں لے کر آیا ہوں اسے جھٹلائیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 15,
        "matchingArabicURN": 164000,
        "last_updated": null
    },
    {
        "urduURN": 4071750,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ کہا ہم سے لیث بن سعد نے بیان کیا ‘ ان سے عقیل نے ‘ ان سے زہری نے ‘ انہیں عبیداللہ بن عبداللہ بن عتبہ نے خبر دی ‘ ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "جب نبی کریم صلی اللہ علیہ وسلم کی وفات ہوئی اور آپ کے بعد ابوبکر رضی اللہ عنہ کو خلیفہ بنایا گیا اور عرب کے کئی قبائل پھر گئے ۔ ابوبکر رضی اللہ عنہ نے ان سے لڑنا چاہا تو عمر رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے کہا کہ آپ لوگوں سے کس بنیاد پر جنگ کریں گے جب کہ آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا تھا کہ مجھے حکم دیا گیا ہے کہ لوگوں سے اس وقت تک جنگ کروں جب تک وہ کلمہ لا الہٰ الا اللہ کا اقرار نہ کر لیں پس جو شخص اقرار کر لے کہ لا الہٰ الا اللہ تو میری طرف سے اس کا مال اور اس کی جان محفوظ ہے ۔ البتہ کسی حق کے بدل ہو تو وہ اور بات ہے ( مثلاً کسی کا مال مار لے یا کسی کا خون کرے ) اب اس کے باقی اعمال کا حساب اللہ کے حوالے ہے لیکن ابوبکر رضی اللہ عنہ نے کہا کہ واللہ ! میں تو اس شخص سے جنگ کروں گا جس نے نماز اور زکوٰۃ میں فرق کیا ہے کیونکہ زکوٰۃ مال کا حق ہے ‘ واللہ اگر وہ مجھے ایک رسی بھی دینے سے رکیں گے جو وہ رسول اللہ صلی اللہ علیہ وسلم کو دیتے تھے تو میں ان سے ان کے انکارپر بھی جنگ کروں گا ۔ عمر رضی اللہ عنہ نے کہا پھر جو میں نے غور کیا مجھے یقین ہو گیا کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کے دل میں لڑائی کی تجویز ڈالی ہے تو میں نے جان لیا کہ وہ حق پر ہیں ۔ ابو بکیر اور عبداللہ بن صالح نے لیث سے ” عنا قا “ ( بجائے عقلاً کہا یعنی بکری کا بچہ اور یہی زیادہ صحیح ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 16,
        "matchingArabicURN": 164011,
        "last_updated": null
    },
    {
        "urduURN": 4071760,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7286,
        "hadithSanad": "مجھ سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے عبداللہ بن وہب نے بیان کیا ‘ ان سے یونس بن یزید ایلی نے ‘ ان سے ابن شہاب نے ‘ ان سے عبیداللہ بن عبداللہ بن عتبہ نے ‘ ان سے عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "عیینہ بن حذیفہ بن بدر مدینہ آئے اور اپنے بھتیجے الحر بن قیس بن حصن کے یہاں قیام کیا ۔ الحر بن قیس ان لوگوں میں سے تھے جنہیں عمر رضی اللہ عنہ اپنے قریب رکھتے تھے ۔ قرآن مجید کے علماء عمر رضی اللہ عنہ کے شریک مجلس و مشورہ رہتے تھے ‘خواہ وہ بوڑھے ہوں یا جوان ۔ پھر عیینہ نے اپنے بھتیجے حر سے کہا ‘ بھتیجے ! کیا امیر المؤ منین کے یہاں کچھ رسوخ حاصل ہے کہ تم میرے لیے ان کے یہاں حاضری کی اجازت لے دو ؟ انہوں نے کہا کہ میں آپ کے لیے اجازت مانگوں گا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر انہوں نے عیینہ کے لیے اجازت چاہی ( اور آپ نے اجازت دی ) پھر جب عیینہ مجلس میں پہنچے تو کہا کہ اے ابن خطاب ! واللہ ! تم ہمیں بہت زیادہ نہیں دیتے اور نہ ہمارے درمیان انصاف کے ساتھ فیصلہ کرتے ہو ۔ اس پر عمر رضی اللہ عنہ غصہ ہو گئے ‘ یہاں تک کہ آپ نے انہیں سزا دینے کا ارادہ کر لیا ۔ اتنے میں حضرت الحر نے کہا ‘ امیر المؤ منین ! اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم سے فرمایا کہ ” معاف کرنے کا طریقہ اختیار کرو اور بھلائی کا حکم دو اور جاہلوں سے اعراض کرو “ اور یہ شخص جاہلوں میں سے ہے ۔ پس واللہ ! عمر رضی اللہ عنہ کے سامنے جب یہ آیت انہوں نے تلاوت کی تو آپ ٹھنڈے ہو گئے اور عمر رضی اللہ عنہ کی عادت تھی کہ اللہ کی کتاب پر فوراً عمل کرتے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 17,
        "matchingArabicURN": 164030,
        "last_updated": null
    },
    {
        "urduURN": 4071770,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7287,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ قعنبی نے بیان کیا ‘ ان سے مالک نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے فاطمہ بنت منذر نے ‘ ان سے اسماء بنت ابی بکر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "میں عائشہ رضی اللہ عنہا کے یہاں گئی ۔ جب سورج گرہن ہوا تھا اور لوگ نماز پڑھ رہے تھے عائشہ رضی اللہ عنہا بھی کھڑی نماز پڑھ رہی تھیں ۔ میں نے کہا لوگوں کو کیا ہو گیا ہے ( کہ بے وقت نماز پڑھ رہے ہیں ) تو انہوں نے ہاتھ سے آسمان کی طرف اشارہ کیا اور کہا سبحان اللہ ! میں نے کہا کوئی نشانی ہے ؟ انہوں نے سر سے اشارہ کیا کہ ہاں ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم نماز سے فارغ ہوئے تو آپ نے اللہ کی حمد و ثنا کے بعد فرمایا ‘ کوئی چیز ایسی نہیں لیکن میں نے آج اس جگہ سے اسے دیکھ لیا ‘ یہاں تک کہ جنت ودوزخ بھی اور مجھے وحی کی گئی ہے کہ تم لوگ قبروں میں بھی آزمائے جاؤ گے ‘ دجال کے فتنے کے قریب قریب پس مومن یا مسلم مجھے یقین نہیں کہ اسماء رضی اللہ عنہا نے ان میں سے کون سا لفظ کہا تھا تو وہ ( قبر میں فرشتوں کے سوال پر کہے گا ) محمد صلی اللہ علیہ وسلم ہمارے پاس روشن نشانات لے کر آئیں اور ہم نے ان کی دعوت قبول کی اور ایمان لائے ۔ اس سے کہا جائے گا کہ آرام سے سو رہو ‘ ہمیں معلوم تھا کہ تم مومن ہو اور منافق یا شک میں مبتلا مجھے یقین نہیں کہ ان میں سے کون سا لفظ اسماء رضی اللہ عنہا نے کہا تھا ‘ تو وہ کہے گا ( آنحضرت صلی اللہ علیہ وسلم کے متعلق سوال پر کہ مجھے معلوم نہیں ‘ میں نے لوگوں کو جو کہتے سنا وہی میں نے بھی بک دیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 18,
        "matchingArabicURN": 164040,
        "last_updated": null
    },
    {
        "urduURN": 4071780,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7288,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے ابوالزناد نے ‘ ان سے اعرج نے ‘ ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا جب تک میں تم سے یکسو رہوں تم بھی مجھے چھوڑ دو ( اور سوالات وغیرہ نہ کرو ) کیونکہ تم سے پہلے کی امتیں اپنے ( غیر ضروری ) سوال اور انبیاء کے سامنے اختلاف کی وجہ سے تباہ ہو گئیں ۔ پس جب میں تمہیں کسی چیز سے روکوں تو تم بھی اس سے پرہیز کرو اور جب میں تمہیں کسی بات کا حکم دوں تو بجا لاؤ جس حد تک تم میں طاقت ہو ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 19,
        "matchingArabicURN": 164050,
        "last_updated": null
    },
    {
        "urduURN": 4071790,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7289,
        "hadithSanad": "ہم سے عبداللہ بن یزید المقری نے بیان کیا ‘ کہا ہم سے سعید بن ابی ایوب نے بیان کیا ‘ کہا مجھ سے عقیل بن خالد نے بیان کیا ‘ ان سے ابن شہاب نے ‘ ان سے عامر بن سعد بن ابی وقاص نے ‘ ان سے ان کے والد نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ سب سے بڑا مجرم وہ مسلمان ہے جس نے کسی ایسی چیز کے متلعق پوچھا جو حرام نہیں تھی اور اس کے سوال کی وجہ سے وہ حرام کر دی گئی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 20,
        "matchingArabicURN": 164060,
        "last_updated": null
    },
    {
        "urduURN": 4071800,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7290,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ‘ انہوں نے کہا ہم کو عفان بن مسلم نے خبر دی ‘ انہوں نے کہا ہم سے وہیب نے بیان کیا ‘ کہا ہم سے موسیٰ ابن عقبہ نے بیان کیا ‘ کہا میں نے ابو النضر سے سنا ‘ انہوں نے بسر بن سعید سے بیان کیا ‘ ان سے زید بن ثابت رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے مسجدنبوی میں چٹائی سے گھیر کر ایک حجرہ بنا لیا اور رمضان کی راتوں میں اس کے اندر نماز پڑھنے لگے پھر اور لوگ بھی جمع ہو گئے تو ایک رات آنحضرت کی آواز نہیں آئی ۔ لوگوں نے سمجھا کہ آنحضرت صلی اللہ علیہ وسلم سو گئے ہیں ۔ اس لیے ان میں سے بعض کھنگار نے لگے تاکہ آپ باہر تشریف لائے ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تم لوگوں کے کام سے واقف ہوں ‘ یہاں تک کہ مجھے ڈر ہوا کہ کہیں تم پر یہ نماز تراویح فرض نہ کر دی جائے اور اگر فرض کر دی جائے تو تم اسے قائم نہیں رکھ سکو گے ۔ پس اے لوگو ! اپنے گھروں میں یہ نماز پڑھو کیونکہ فرض نماز کے سوا انسان کی سب سے افضل نماز اس کے گھر میں ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 21,
        "matchingArabicURN": 164070,
        "last_updated": null
    },
    {
        "urduURN": 4071810,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7291,
        "hadithSanad": "ہم سے یوسف بن موسیٰ نے بیان کیا ‘ کہا ہم سے ابواسامہ حماد بن اسامہ نے بیان کیا ‘ ان سے برید بن ابی بردہ نے ‘ ان سے ابوبردہ نے اور ان سے ابوموسیٰ اشعری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم سے کچھ چیزوں کے متعلق پوچھا گیا جنہیں آپ نے ناپسند کیا جب لوگوں نے بہت زیادہ پوچھنا شروع کر دیا تو آپ ناراض ہوئے اور فرمایا پوچھو ! اس پر ایک صحابی کھڑا ہوا اور پوچھا یا رسول اللہ ! میرے والد کون ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ تمہارے والد حذافہ ہیں ۔ پھر دوسرا صحابی کھڑا ہوا اور پوچھا میرے والد کون ہیں ؟ فرمایا کہ تمہارے والد شیبہ کے مولیٰ سالم ہیں ۔ پھر جب عمر رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کے چہرہ پر غصہ کے آثار محسوس کئے تو عرض کیا ہم اللہ عزوجل کی بار گاہ میں آپ کو غصہ دلانے سے توبہ کرتے ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 22,
        "matchingArabicURN": 164080,
        "last_updated": null
    },
    {
        "urduURN": 4071820,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7292,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ کہا ہم سے عبدالملک بن عمیر کوفی نے بیان کیا ‘ ان سے مغیرہ رضی اللہ عنہ کے کاتب وراد نے بیان کیا کہ",
        "hadithText": "معاویہ رضی اللہ عنہ نے مغیرہ رضی اللہ عنہ کو لکھا کہ جو تم نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے وہ مجھے لکھئے تو انہوں نے انہیں لکھا کہ نبی کریم صلی اللہ علیہ وسلم ہر نماز کے بعد کہتے تھے ” تنہا اللہ کے سوا کوئی معبود نہیں ‘ اس کا کوئی شریک نہیں ‘ ملک اسی کا ہے اور تمام تعریف اسی کے لیے ہیں اور وہ ہر چیز پر قادر ہے ! اے اللہ جو تو عطا کرے اسے کوئی روکنے والا نہیں اور جسے تو روکے اسے کوئی دینے والا نہیں اور کسی نصیبہ تیرے مقابلہ میں اسے نفع نہیں پہنچا سکے گا اور انہیں یہ بھی لکھا کہ آنحضرت صلی اللہ علیہ وسلم بےفائدہ بہت سوال کرنے سے منع کرتے تھے اور مال ضائع کرنے سے اور آپ ماؤں کی نافرمانی کرنے سے منع کرتے تھے اور لڑکیوں کو زندہ درگور کرنے سے اور اپنا حق محفوظ رکھنے اور دوسروں کا حق ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 23,
        "matchingArabicURN": 164090,
        "last_updated": null
    },
    {
        "urduURN": 4071830,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7293,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد بن زید نے بیان کیا ‘ ان سے ثابت نے اور ان سے انس رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم عمر رضی اللہ عنہ کے پاس تھے تو آپ نے فرمایا کہ ہمیں تکلف اختیار کرنے سے منع کیا گیا ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 24,
        "matchingArabicURN": 164100,
        "last_updated": null
    },
    {
        "urduURN": 4071840,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7294,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ انہوں نے کہا ہم سے شعیب نے خبر دی ‘ انہیں زہری نے ( دوسری سند ) امام بخاری رحمہ اللہ نے کہا اور مجھ سے محمود نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالرزاق نے بیان کیا ‘ انہوں نے کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہوں نے کہا مجھ کو انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم سورج ڈھلنے کے بعد باہر تشریف لائے اور ظہر کی نماز پڑھی ‘ پھر سلام پھیرنے کے بعد آپ منبر پر کھڑے ہوئے اور قیامت کا ذکر کیا اور آپ صلی اللہ علیہ وسلم نے ذکر کیا کہ اس سے پہلے بڑے بڑے واقعات ہوں گے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے جو شخص کسی چیز کے متعلق سوال کرنا چاہے تو سوال کرے ۔ آج مجھ سے جو سوال بھی کرو گے میں اس کا جواب دوں گا جب تک میں اپنی جگہ سے پر ہوں ۔ انس رضی اللہ عنہ نے بیان کیا کہ اس پر لوگ بہت زیادہ رونے لگے اور آنحضرت صلی اللہ علیہ وسلم باربار وہی فرماتے تھے کہ مجھ سے پوچھو ۔ انہوں نے بیان کیا کہ پھر ایک صحابی کھڑا ہوا اور پوچھا ‘ میری جگہ کہاں ہے ۔ ( جنت یا جہنم میں ) یا رسول اللہ ! آنحضرت صلی اللہ علیہ وسلم نے بیان کیا کہ جہنم میں ۔ پھر عبداللہ بن حذافہ رضی اللہ عنہ کھڑے ہوئے اور کہا میرے والد کون ہیں یا رسول اللہ ؟ فرمایا کہ تمہارے والد حذافہ ہیں ۔ بیان کیا کہ پھر آپ مسلسل کہتے رہے کہ مجھ سے پوچھو ‘ مجھ سے پوچھو ‘ آخر میں عمر رضی اللہ عنہ نے اپنے گھٹنوں کے بل بیٹھ کر کہا ‘ ہم اللہ سے رب کی حیثیت سے ‘ اسلام سے دین کی حیثیت سے ‘ محمد صلی اللہ علیہ وسلم سے رسول کی حیثیت سے راضی و خوش ہیں ۔ عمر رضی اللہ عنہ نے یہ کلمات کہے تو آنحضرت صلی اللہ علیہ وسلم خاموش ہو گئے ‘ پھر آپ نے فرمایا اس ذات کی قسم جس کی ہاتھ میں میری جان ہے ‘ ابھی مجھ پر جنت اور دوزخ اس دیوار کی چوڑائی میں میرے سامنے کی گئی تھی ( یعنی ان کی تصویریں ) جب میں نماز پڑھ رہا تھا ‘ آج کی طرح میں نے خیرو شر کو نہیں دیکھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 25,
        "matchingArabicURN": 164110,
        "last_updated": null
    },
    {
        "urduURN": 4071850,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7295,
        "hadithSanad": "ہم سے محمد بن عبد الرحیم نے بیان کیا ‘ کہا ہم کو روح بن عبادہ نے خبر دی ‘ کہا ہم سے شعبہ نے بیان کیا ‘ کہا مجھ کو موسیٰ بن انس نے خبر دی کہ میں نے انس بن مالک رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "ایک صاحب نے کہا یا نبی اللہ ! میرے والد کون ہیں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ” تمہارے والد فلاں ہیں “ ۔ اور یہ آیت نازل ہوئی ” اے لوگو ! ایسی چیزیں نہ پوچھو “ الآیہ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 26,
        "matchingArabicURN": 164120,
        "last_updated": null
    },
    {
        "urduURN": 4071860,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7296,
        "hadithSanad": "ہم سے حسن بن صباح نے بیان کیا ‘انہوں نے کہا ہم سے شبابہ نے بیان کیا ‘ انہوں نے کہا ہم سے ورقاء نے بیان کیا ان سے عبداللہ بن عبدالرحمٰن نے بیان کیا ‘ انہوں نے انس بن مالک رضی اللہ عنہ سے سنا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا انسان برابر سوال کرتا رہے گا ۔ یہاں تک کہ سوال کرے گا کہ یہ تو اللہ ہے ‘ ہر چیز کا پیدا کرنے والا لیکن اللہ کو کس نے پیدا کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 27,
        "matchingArabicURN": 164130,
        "last_updated": null
    },
    {
        "urduURN": 4071870,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7297,
        "hadithSanad": "ہم سے محمد بن عبید بن میمون نے بیان کیا ‘ کہا ہم سے عیسیٰ بن یونس نے بیان کیا ‘ ان سے اعمش نے ‘ ان سے ابراہیم نے ‘ ان سے علقمہ نے ‘ ان سے ابن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے نبی کریم صلی اللہ علیہ وسلم کے ساتھ مدینہ کے ایک کھیت میں تھا ۔ آنحضرت صلی اللہ علیہ وسلم کھجور کی ایک شاخ پر ٹیک لگائے ہوئے تھے کہ یہودی ادھر سے گزرے تو ان میں سے بعض نے کہا کہ ان سے روح کے بارے میں پوچھو ۔ لیکن دوسروں نے کہا کہ ان سے نہ پوچھو ۔ کہیں ایسی بات نہ سنا دیں جو تمہیں ناپسند ہے ۔ آخر آپ کے پاس وہ لوگ آئے اور کہا ‘ ابوالقاسم ! روح کے بارے میں ہمیں بتائیے ؟ پھر آنحضرت صلی اللہ علیہ وسلم تھوڑی دیر کھڑے دیکھتے رہے میں سمجھ گیا کہ آپ پر وحی نازل ہو رہی ہے ۔ میں تھوڑی دور ہٹ گیا ‘ یہاں تک کہ وحی کا نزول پورا ہو گیا ‘ پھر آپ نے یہ آیت پڑھی ” اور آپ روح کے بارے میں پوچھتے ہیں ۔ کہئے کہ روح میرے رب کے حکم میں سے ہے ۔ “</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 28,
        "matchingArabicURN": 164140,
        "last_updated": null
    },
    {
        "urduURN": 4071880,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7298,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے سونے کی ایک انگوٹھی بنوائی تو دوسرے لوگوں نے بھی سونے کی انگوٹھیاں بنوالیں‘پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں نے سونے کی ایک انگوٹھی بنوائی تھی ‘ پھر آپ صلی اللہ علیہ وسلم نے پھینک دی اور فرمایا کہ میں اسے کبھی نہیں پہنوں گا اور لوگوں نے بھی اپنی انگوٹھیاں پھینک دیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 29,
        "matchingArabicURN": 164150,
        "last_updated": null
    },
    {
        "urduURN": 4071890,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7299,
        "hadithSanad": "ہم سے عبداللہ بن محمد نے بیان کیا ‘ کہا ہم سے ہشام نے ‘ کہا ہم کو معمر نے خبر دی ‘ انہیں زہری نے ‘ انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ تم صوم وصال ( افطار وسحر کے بغیر کئی دن کے روزے ) نہ رکھا کرو ۔ صحابہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم تو صوم وصال رکھتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میں تم جیسا نہیں ہوں ۔ میں رات گزارتا ہوں اورمیرا رب مجھے کھلاتا پلاتا ہے لیکن لوگ صوم وصال سے نہیں رکے ۔ بیان کیا کہ پھر آنحضرت صلی اللہ علیہ وسلم نے ان کے ساتھ دو دن یا دو راتوں میں صوم وصال کیا ‘ پھر لوگوں نے چاند دیکھ لیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اگر چاند نہ نظر آتا تو میں اور وصال کرتا ۔ آنحضرت صلی اللہ علیہ وسلم کا مقصد انہیں سرزنش کرنا تھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 30,
        "matchingArabicURN": 164160,
        "last_updated": null
    },
    {
        "urduURN": 4071900,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7300,
        "hadithSanad": "ہم سے عمر بن حفص بن غیاث نے بیان کیا ‘ کہا ہم سے ہمارے والد نے ‘ کہا ہم سے اعمش نے بیان کیا ‘ کہا مجھ سے ابراہیم تیمی نے بیان کیا ‘کہا مجھ سے میرے والد نے بیان کیا ‘ کہا کہ",
        "hadithText": "علی رضی اللہ عنہ نے ہمیں اینٹ کے بنے ہوئے منبر کر کھڑا ہو کر خطبہ دیا ۔ آپ تلوار لیے ہوئے تھے جس میں ایک صحیفہ لٹکا ہوا تھا ۔ آپ نے فرمایا واللہ ! ہمارے پاس کتاب اللہ کے سوا کوئی اور کتاب نہیں جسے پڑھا جائے اور سوا اس صحیفہ کے ۔ پھر انہوں نے اسے کھو لا تو اس میں دیت میں دئیے جانے والے اونٹوں کی عمروں کا بیان تھا ۔ ( کہ دیت میں اتنی اتنی عمر کے اونٹ دئیے جائیں ) اور اس میں یہ بھی تھا کہ مدینہ طیبہ کی زمین عیر پہاڑی سے ثور پہاڑی تک حرم ہے ۔ پس اس میں جو کوئی نئی بات ( بدعت ) نکالے گا اس پر اللہ کی لغت ہے اور فرشتوں کی اور تمام لوگوں کی ۔ اللہ اس سے کسی فرض یا نفل عبادت کو قبول کرے گا اور اس میں یہ بھی تھا کہ مسلمانوں کی ذمہ داری ( عہد یا امان ) ایک اس کے ذمہ دار ان میں سب سے ادنیٰ مسلمان بھی ہو سکتا ہے پس جس نے کسی مسلمان کا ذمہ توڑا ‘ اس پر اللہ کی لعنت ہے اور فرشتوں کی اور تمام لوگوں کی ۔ اللہ اس کی نہ فرض عبادت قبول کرے گا اور نہ نفل عبادت اور اس میں یہ بھی تھا کہ جس نے کسی سے اپنی والیوں کی اجازت کے بغیر ولاء کا رشتہ قائم کیا اس پر اور فرشتوں اور تمام انسانوں کی لعنت ہے ‘ اللہ نہ اس کی فرض نماز قبول کرے گا نہ نفل ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 31,
        "matchingArabicURN": 164170,
        "last_updated": null
    },
    {
        "urduURN": 4071910,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7301,
        "hadithSanad": "ہم سے عمر بن حفص نے بیان کیا ، کہا مجھ سے میرے والد نے بیان کیا ، کہا ہم سے اعمش نے بیان کیا ، ان سے مسلم نے ، ان سے مسروق نے ، ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے کوئی کام کیا جس سے بعض لوگوں نے پرہیز کرنا اختیار کیا ۔ جب آنحضرت صلی اللہ علیہ وسلم کو اس کی خبر پہنچی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان لوگوں کا کیا حال ہو گا جو ایسی چیز سے پرہیز کرتے ہیں جو میں کرتا ہوں ۔ واللہ میں ان سے زیادہ اللہ کے متعلق علم رکھتا ہوں اور ان سے زیادہ خشیت رکھتا ہوں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 32,
        "matchingArabicURN": 164180,
        "last_updated": null
    },
    {
        "urduURN": 4071920,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7302,
        "hadithSanad": "ہم سے محمد بن مقاتل ابوالحسن مروزی نے بیان کیا ، کہا ہم کو وکیع نے خبر نے دی ، انہیں نافع بن عمر نے ، ان سے ابن ابی ملکیہ نے بیان کیا کہ",
        "hadithText": "امت کے دوبہترین انسان قریب تھا کہ ہلاک ہو جاتے ( یعنی ابوبکر وعمر رضی اللہ عنہما ) جس وقت نبی کریم صلی اللہ علیہ وسلم کے پاس بنی تمیم کا وفد آیا تو ان میں سے ایک صاحب ( عمر رضی اللہ عنہ ) نے بنی مجاشع میں سے اقرع بن حابس حنظلی رضی اللہ عنہ کو ان کا سردار بنائے جانے کا مشورہ دیا ( تو انہوں نے یہ درخواست کی کہ کسی کو ہمارا سردار بنا دیجئیے ) اور دوسرے صاحب ( ابوبکر رضی اللہ عنہ ) نے دوسرے ( قعقاع بن سعید بن زرارہ ) کو بنائے جانے کا مشورہ دیا ۔ اس پر ابوبکرنے عمر سے کہا کہ آپ کا مقصد صرف میری مخالفت کرنا ہے ۔ عمر رضی اللہ عنہ نے کہا کہ میری نیت آپ کی مخالفت کرنا نہیں ہے اور نبی کریم صلی اللہ علیہ وسلم کی موجودگی میں دونوں بزرگوں کی آوازبلند ہو گئی ۔ چنانچہ یہ آیت نازل ہوئی ” اے لوگوں ! جو ایمان لے آئے ہو اپنی آواز کو بلند نہ کرو “ ارشاد خداوندی ” عظیم “ تک ابن ابی ملکیہ نے بیان کیا کہ ابن زبیر رضی اللہ عنہا کہتے تھے کہ عمر رضی اللہ نے اس آیت کے اترنے کے بعد یہ طریقہ اختیار کیا اور ابن زبیر نے ابوبکر رضی اللہ عنہ اپنے ناناکا ذکر کیا وہ جب آنحضرت صلی اللہ علیہ وسلم سے کچھ عرض کرتے تو اتنی آہستگی سے جیسے کوئی کان میں بات کرتا ہے حتیٰ کہ آنحضرت صلی اللہ علیہ وسلم کو بات سنائی نہ دیتی تو آپ دوبارہ پوچھتے کیا کہا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 33,
        "matchingArabicURN": 164190,
        "last_updated": null
    },
    {
        "urduURN": 4071930,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7303,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ، انہوں نے کہا مجھ سے امام مالک نے بیان کیا ، ان سے ہشام بن عروہ نے بیان کیا ، ان سے ان کے والد نے بیان کیا اور ان سے ام المؤمنین عائشہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیماری میں فرمایا ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں حضرت عائشہ نے کہا کہ میں نے جواباً عرض کیا کہ ابوبکر رضی اللہ عنہ اگر آپ صلی اللہ علیہ وسلم کی جگہ کھڑے ہوں گے تو رونے کی شدت کی وجہ سے اپنی آواز لوگوں کو نہیں سنا سکیں گے اس لئے آپ صلی اللہ علیہ وسلم عمر رضی اللہ عنہ کو حکم دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں نے حفصہ رضی اللہ عنہا سے کہا کہ تم کہو کہ ابوبکر رضی اللہ عنہ آپ کی جگہ کھڑے ہوں گے تو شدت بکاء کی وجہ سے لوگوں کو سنا نہیں سکیں گے ، اس لیے آپ صلی اللہ علیہ وسلم عمر رضی اللہ عنہ کو نماز پڑھانے کا حکم دیں ۔ حفصہ رضی اللہ عنہا نے ایسا ہی کیا ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ بلاشبہ تم یوسف پیغمبر کی ساتھ والیاں ہو ؟ ابوبکر سے کہو کہ لوگوں کو نماز پڑھائیں ۔ بعد میں حفصہ رضی اللہ عنہا نے عائشہ رضی اللہ عنہا سے کہا کہ میں نے تم سے کبھی کچھ بھلائی نہیں دیکھی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 34,
        "matchingArabicURN": 164200,
        "last_updated": null
    },
    {
        "urduURN": 4071940,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7304,
        "hadithSanad": "ہم سے آدم بن ابی ایاس نے بیان کیا ، کہا ہم سے ابن ابی ذئب نے کہا ، ہم سے زہری نے ، ان سے سہل بن سعد ساعدی رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "عویمر عجلانی عاصم بن عدی کے پاس آیا اور کہا اس شخص کے بارے میں آپ کا کیا خیال ہے جو اپنی بیوی کے ساتھ کسی دوسرے مرد کو پائے اور اسے قتل کر دے ، کیا آپ لوگ مقتول کے بدلہ میں اسے قتل کر دیں گے ؟ عاصم ! میرے لیے آپ رسول اللہ صلی اللہ علیہ وسلم سے اس کے متلعق پوچھ دیجئیے ۔ چنانچہ انہوں نے آنحضرت صلی اللہ علیہ وسلم سے پوچھا لیکن آپ نے اس طرح کے سوال کو ناپسند کیا اور معیوب جانا ۔ عاصم رضی اللہ عنہ نے واپس آ کر انہیں بتایا کہ آنحضرت صلی اللہ علیہ وسلم نے اس طرح کے سوال کو ناپسند کیا ہے ۔ اس پر عویمر رضی اللہ عنہ بولے کہ واللہ ! میں خود آنحضرت صلی اللہ علیہ وسلم کے پاس جاؤں گا خیر عویمر آپ کے پاس آئے اور عاصم کے لوٹ جانے کے بعد اللہ تعالیٰ نے قرآن مجید کی آیت آپ صلی اللہ علیہ وسلم پر نازل کی ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے ان سے کہا کہ تمہارے بارے میں اللہ تعالیٰ نے قرآن نازل کیا ہے ، پھر آپ نے دونوں ( میاں بیوی ) کو بلایا ۔ دونوں آگے بڑھے اور لعان کیا ۔ پھر عویمر نے کہا کہ یا رسول اللہ ! اگر میں اسے اب بھی اپنے پاس رکھتا ہوں تو اس کا مطلب یہ ہے کہ میں جھوٹا ہوں چنانچہ اس نے فوری اپنی بیوی کو جدا کر دیا ۔ آنحضرت صلی اللہ علیہ وسلم نے جدا کرنے کا حکم نہیں دیا تھا ۔ پھر لعان کرنے والوں میں یہی طریقہ رائج ہو گیا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ دیکھتے رہو اس کا بچہ لال لال پست قد بامنی کی طرح کا پیدا ہو تو میں سمجھتا ہوں کہ وہ عویمر ہی کا بچہ ہے ۔ عویمر نے عورت پر جھوٹا طوفان باندھا اور اور اگر سانولے رنگ کا بڑی آنکھ والا بڑے بڑے چوتڑ والا پیدا ہو ، جب میں سمجھوں گا کہ عویمر سچا ہے پھر اس عورت کا بچہ اس مکروہ صورت کا یعنی جس مرد سے وہ بدنام ہوئی تھی ، اسی صورت کا پیدا ہوا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 35,
        "matchingArabicURN": 164210,
        "last_updated": null
    },
    {
        "urduURN": 4071950,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7305,
        "hadithSanad": "ہم سے عبداللہ بن یوسف تنیسی نے بیان کیا ، کہا ہم سے لیث بن سعد نے ، ان سے عقیل نے ، ان سے ابن شہاب نے ، انہیں مالک بن اوس نضری نے خبر دی کہ",
        "hadithText": "محمد بن جبیر بن مطعم نے مجھ سے اس سلسلہ میں ذکر کیا تھا ، پھر میں مالک کے پاس گیا اور ان سے اس حدیث کے متعلق پوچھا ۔ انہوں نے بیان کیا کہ میں روانہ ہوا اور عمر رضی اللہ عنہ کی خدمت میں حاضر ہوا ۔ اتنے میں ان کے دربان یرفاء آئے اور کہا کہ عثمان ، عبدالرحمٰن ، زبیر اور سعد رضی اللہ عنہم اندر آنے کی اجازت چاہتے ہیں ، کیا انہیں اجازت دی جائے ؟ عمر رضی اللہ عنہ نے کہا کہ ہاں ۔ چنانچہ سب لوگ اندر آ گئے اور سلام کیا اور بیٹھ گئے ، پھر یرفاء نے آکرپوچھا کہ کیا علی اور عباس کو اجازت دی جائے ؟ ان حضرات کو بھی اندر بلایا ۔ عباس رضی اللہ عنہ نے کہا کہ امیرالمؤمنین ! میرے اور ظالم کے درمیان فیصلہ کر دیجئیے ۔ آپس میں دونوں نے سخت کلامی کی ۔ اس پر عثمان رضی اللہ عنہ اور ان کے ساتھیوں کی جماعت نے کہا کہ امیرالمؤمنین ! ان کے درمیان فیصلہ کردیئجے تاکہ دونوں کو آرام حاصل ہو ۔ عمر رضی اللہ عنہ نے کہا کہ صبر کرو میں تمہیں اللہ کی قسم دیتا ہوں جس کی اجازت سے آسمان و زمین قائم ہیں ۔ کیا آپ لوگوں کو معلوم ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا تھا کہ ہماری میراث تقسیم نہیں ہوتی ، ہم جو کچھ چھوڑیں وہ صدقہ ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے اس سے خود اپنی ذات مراد لی تھی ۔ جماعت نے کہا کہ ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا تھا ، پھر آپ علی اور عباس کی طرف متوجہ ہوئے اور کہا کہ میں آپ لوگوں کو اللہ کی قسم دیتا ہوں ۔ کیا آپ لوگوں کو معلوم ہے کہ آنحضرت صلی اللہ علیہ وسلم نے یہ فرمایا ؟ انہوں نے بھی کہا کہ ہاں ۔ عمر رضی اللہ عنہ نے اس کے بعد کہا کہ پھر میں آپ لوگوں سے اس بارے میں گفتگو کرتا ہوں ۔ اللہ تعالیٰ نے اپنے رسول کا اس مال میں سے ایک حصہ مخصوص کیا تھا جو اس نے آپ کے سوا کسی کو نہیں دیا ۔ اس لیے کہ اللہ تعالیٰ فرماتا ہے کہ ما أفاء الله على رسوله منهم فما أوجفتم‏ ( الآیہ ) تو یہ مال خاص آنحضرت صلی اللہ علیہ وسلم کے لئے تھا ، پھر واللہ ! آنحضرت صلی اللہ علیہ وسلم نے اسے اپنے لوگوں کو نظرانداز کر کے اپنے لیے جمع نہیں کیا اور نہ اسے اپنی ذاتی جائیداد بنایا ۔ آنحضرت صلی اللہ علیہ وسلم نے اسے آپ لوگوں کو بھی دیا اور سب میں تقسیم کیا ‘ یہاں تک اس میں سے یہ مال باقی رہ گیا تو آنحضرت صلی اللہ علیہ وسلم اس میں سے اپنے گھر والوں کا سالانہ خرچ دیتے تھے ‘ پھر باقی اپنے قبضے میں لے لیتے تھے اور اسے بیت المال میں رکھ کر عام مسلمانوں کے ضروریات میں خرچ کرتے تھے ۔ آنحضرت صلی اللہ علیہ وسلم نے زندگی بھر اس کے مطابق عمل کیا ۔ میں آپ لوگوں کو اللہ کی قسم دیتا ہوں کیا آپ کو اس کا علم ہے ؟ صحابہ نے کہا کہ ہاں پھر آپ نے علی اور عباس رضی اللہ عنہما سے کہا ‘ میں آپ دونوں حضرات کو بھی اللہ کی قسم دیتا ہوں کیا آپ لوگوں کو اس کا علم ہے ؟ انہوں نے بھی کہا کہ ہاں ۔ پھر اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم کو وفات دی اور ابوبکر رضی اللہ عنہ نے آنحضرت صلی اللہ علیہ وسلم کے ولی ہونے کی حیثیت سے اس پر قبضہ کیا اور اس میں اسی طرح عمل کیا جیسا کہ آنحضرت صلی اللہ علیہ وسلم کرتے تھے ۔ آپ دونوں حضرات بھی یہیں موجود تھے ۔ آپ نے علی اور عباس رضی اللہ عنہ کی طرف متوجہ ہو کر یہ بات کہی اور آپ لوگوں کا خیال تھا کہ ابوبکر رضی اللہ عنہ اس معاملے میں خطاکار ہیں اور اللہ خوب جانتا ہے کہ وہ اس معاملے میں سچے اور نیک اور سب سے زیادہ حق کی پیروی کرنے والے تھے ‘ پھر اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو وفات دی اور میں نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر صلی اللہ علیہ وسلم کا ولی ہوں اس طرح میں نے بھی اس جائیداد کو اپنے قبضے میں دو سال تک رکھا اور اس میں اسی کے مطابق عمل کرتا رہا جیسا کہ آنحضرت صلی اللہ علیہ وسلم اور ابوبکر صدیق رضی اللہ عنہ نے کیا تھا ‘ پھر آپ دونوں حضرات میرے پاس آئے اور آپ لوگوں کا معاملہ ایک ہی تھا ۔ کوئی اختلاف نہیں تھا ۔ آپ ( عباس رضی اللہ عنہ ! ) آئے اپنے بھائی کے لڑکے کی طرف سے اپنی میراث لینے آئے اور یہ ( علی رضی اللہ عنہ ) اپنی بیوی کی طرف سے ان کے والد کی میراث کا مطالبہ کرنے آئے ۔ میں نے تم سے کہا کہ یہ جائیداد تقسیم تو نہیں ہو سکتی لیکن تم لوگ چاہو تو میں اہتمام کے طور پر آپ کو یہ جائیداد دے دوں لیکن شرط یہ ہے کہ آپ لوگوں پر اللہ کا عہد اور اس کی میثاق ہے کہ اس کو اسی طرح خرچ کرو گے جس طرح رسول اللہ صلی اللہ علیہ وسلم نے کیا تھا اور جس طرح ابوبکر رضی اللہ عنہ نے کیا تھا اور جس طرح میں نے اپنے زمانہ ولایت میں کیا اگر یہ منظور نہ ہو تو پھر مجھ سے اس معاملہ میں بات نہ کریں ۔ آپ دونوں حضرات نے کہا کہ اس شرط کے ساتھ ہمارے حوالہ جائیداد کر دیں ۔ چنانچہ میں نے اس شرط کے ساتھ آپ کے حوالہ جائیداد کر دی تھی ۔ میں آپ لوگوں کو اللہ کی قسم دیتا ہوں ۔ کیا میں نے ان لوگوں کو اس شرط کے ساتھ جائیداد دی تھی ۔ جماعت نے کہا کہ ہا ں ‘ پھر آپ نے علی اور عباس رضی اللہ عنہ کی طرف متوجہ ہوئے اور کہا میں آپ لوگوں کو اللہ کی قسم دیتا ہوں ۔ کیا میں نے جائیداد آپ لوگووں کو اس شرط کے ساتھ حوالہ کی تھی ؟ انہوں نے کہا کہ ہاں ۔ پھر آپ نے کہا ‘ کیا آپ لوگ مجھ سے اس کے سوا کوئی اور فیصلہ چاہتے ہیں ۔ پس اس ذات کی قسم جس کے حکم سے آسمان و زمین قائم ہیں ‘ اس میں ‘ اس کے سوا کوئی فیصلہ نہیں کر سکتا یہاں تک کہ قیامت آ جائے ۔ اگر آپ لوگ اس کا انتظام نہیں کر سکتے تو پھر میرے حوالہ کر دو میں اس کا بھی انتظام کر لوں گا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 36,
        "matchingArabicURN": 164220,
        "last_updated": null
    },
    {
        "urduURN": 4071960,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7306,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے عبد الواحد نے بیان کیا ‘ کہا ہم سے عاصم نے بیان کیا ‘ کہا کہ",
        "hadithText": "میں نے انس رضی اللہ عنہ سے پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم نے مدینہ منورہ کو حرمت والا شہر قرار دیا ہے ؟ فرمایا کہ ہاں فلاں جگہ عیر سے فلاں جگہ ( ثور ) تک ۔ اس علاقہ کا درخت نہیں کاٹا جائے گا جس نے اس حدود میں کوئی نئی بات پیدا کی ‘ اس پر اللہ کی ‘ فرشتوں کی اور تمام انسانوں کی لعنت ہے ۔ عاصم نے بیان کیا کہ پھر مجھے موسیٰ بن انس نے خبر دی کہ انس رضی اللہ عنہ نے یہ بھی بیان کیا تھا کہ ” یا کسی نے دین میں بدعت پیدا کرنے والے کو پناہ دی “ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 37,
        "matchingArabicURN": 164230,
        "last_updated": null
    },
    {
        "urduURN": 4071970,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7307,
        "hadithSanad": "ہم سے سعید بن تلید نے بیان کیا ‘ کہا مجھ سے عبداللہ بن وہب نے ‘ کہا مجھ سے عبدالرحمٰن بن شریح اور ان کے علاوہ ابن لیعہ نے بیان کیا ‘ ان سے ابوالاسود نے اور ان سے عروہ نے بیان کیا کہ",
        "hadithText": "عبداللہ بن عمرو بن عاص رضی اللہ عنہ نے ہمیں لے کر حج کیا تو میں نے انہیں یہ کہتے سنا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ نے فرمایا کہ اللہ تعالیٰ علم کو ‘ اس کے بعد کہ تمہیں دیا ہے ایک دم سے نہیں اٹھا لے گا بلکہ اسے اس طرح ختم کرے گا کہ علماء کو ان کے علم کے ساتھ اٹھا لے گا پھر کچھ جاہل لوگ باقی رہ جائیں گے ‘ ان سے فتویٰ پوچھا جائے گا اور وہ فتویٰ اپنی رائے کے مطابق دیں گے ۔ پس وہ لوگوں کو گمراہ کریں گے اور وہ خود بھی گمراہ ہوں گے ۔ پھر میں نے یہ حدیث آنحضرت صلی اللہ علیہ وسلم کی زوجہ مطہرہ عائشہ رضی اللہ عنہا سے بیان کی ۔ ان کے بعد عبداللہ بن عمر رضی اللہ عنہما نے دوبارہ حج کیا تو ام المؤمنین نے مجھ سے کہا کہ بھانجے عبداللہ کے پاس جاؤ اور میرے لیے اس حدیث کو سن کر خوب مضبوط کر لو جو حدیث تم نے مجھ سے ان کا واسطہ سے بیان کی تھی ۔ چنانچہ میں اس کے پاس آیا اور میں نے ان سے پوچھا تو انہوں نے مجھ سے وہ حدیث بیان کی ‘ اسی طرح جیسا کہ وہ پہلے مجھ سے بیان کر چکے تھے ‘ پھر میں عائشہ رضی اللہ عنہا کے پاس آیا اور انہیں اس کی خبر دی تو انہیں تعجب ہوا اور بولیں کہ واللہ عبداللہ بن عمرو نے خوب یاد رکھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 38,
        "matchingArabicURN": 164240,
        "last_updated": null
    },
    {
        "urduURN": 4071980,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7308,
        "hadithSanad": "ہم سے عبدان نے بیان کیا ‘ کہا ہم کو ابوحمزہ نے خبر دی ‘ کہا میں نے اعمش سے سنا ‘ کہا کہ",
        "hadithText": "میں نے ابووائل سے پوچھا تم صفین کی لڑائی میں شریک تھے ؟ کہا کہ ہاں ‘ پھر میں نے سہل بن حنیف کو کہتے سنا ( دوسری سند ) امام بخاری نے کہا اور ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے اعمش نے ، ان سے ابووائل نے بیان کیا کہ سہل بن حنیف رضی اللہ عنہ نے ( جنگ صفین کے موقع پر ) کہا کہ لوگوں ! اپنے دین کے مقابلہ میں اپنی رائے کو بےحقیقت سمجھو میں نے اپنے آپ کو ابو جندل رضی اللہ عنہ کے واقعہ کے دن ( صلح حدیبیہ کے موقع پر ) دیکھا کہ اگر میرے اندر رسول اللہ صلی اللہ علیہ وسلم کے حکم سے ہٹنے کی طاقت ہوتی تو میں اس دن آپ سے انحراف کرتا ( اور کفار قریش کے ساتھ ان شرائط کو قبول نہ کرتا ) اور ہم نے جب کسی مہم پر اپنی تلواریں کاندھوں پر رکھیں ( لڑائی شروع کی ) تو ان تلواروں کی بدولت ہم کو ایک آسانی مل گئی جسے ہم پہچانتے تھے مگر اس مہم میں ( یعنی جنگ صفین میں مشکل میں گرفتار ہیں دونوں طرف والے اپنے اپنے دلائل پیش کرتے ہیں ) ابو اعمش نے کہا کہ ابووائل نے بتایا کہ میں صفین میں موجود تھا اور صفین کی لڑائی بھی کیا بری لڑائی تھی جس میں مسلمان آپس میں کٹ مرے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 39,
        "matchingArabicURN": 164250,
        "last_updated": null
    },
    {
        "urduURN": 4071990,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7309,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ کہا میں نے محمد بن المنکدر سے سنا ‘ بیان کیا کہ میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "میں بیمار پڑا تو رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ عیادت کے لیے تشریف لائے ۔ یہ دونوں بزرگ پیدل چل کر آئے تھے ‘ پھر آنحضرت صلی اللہ علیہ وسلم پہنچے تو مجھ پر بے ہوشی طاری تھی ۔ آنحضرت صلی اللہ علیہ وسلم نے وضو کیا اور وضو کا پانی مجھ پر چھڑکا ‘ اس سے مجھے افاقہ ہوا تو میں نے عرض کیا یا رسول اللہ ! اور بعض اوقات سفیان نے یہ الفاظ بیان کئے کہ میں نے کہا یا رسول اللہ ! میں اپنے مال کے بارے میں کس طرح فیصلہ کروں ‘ میں اپنے مال کا کیا کروں ؟ بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا ۔ یہاں تک کہ میراث کی آیت نازل ہوئی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 40,
        "matchingArabicURN": 164260,
        "last_updated": null
    },
    {
        "urduURN": 4072000,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7310,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے عبدالرحمٰن بن الاصبہانی نے ‘ ان سے ابوصالح ذکوان نے اور ان سے ابوسعید رضی اللہ عنہ نے کہ",
        "hadithText": "ایک خاتون نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور کہا یا رسول اللہ ! آپ کی تمام احادیث مرد لے گئے ‘ ہمارے لیے بھی آپ کوئی دن اپنی طرف سے مخصوص کر دیں جس میں ہم آپ صلی اللہ علیہ وسلم کے پاس آئیں اور آپ صلی اللہ علیہ وسلم ہمیں وہ تعلیمات دیں جو اللہ نے آپ صلی اللہ علیہ وسلم کو سکھائی ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ فلاں فلاں دن فلاں فلاں جگہ جمع ہو جاؤ ۔ چنانچہ عورتیں جمع ہوئیں اور آنحضرت صلی اللہ علیہ وسلم ان کے پاس آئے اور انہیں اس کی تعلیم دی جو اللہ نے آپ صلی اللہ علیہ وسلم کو سکھا یا تھا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا ‘ تم میں سے جو عورت بھی اپنی زندگی میں اپنے تین بچے آگے بھیج دے گی ۔ ( یعنی ان کی وفات ہو جائے گی ) تو وہ اس کے لیے دوزخ سے رکاوٹ بن جائیں گے ۔ اس پر ان میں سے ایک خاتون نے کہا ‘ یا رسول اللہ ! دو ؟ انہوں نے اس کلمہ کو دو مرتب دہرایا ‘ پھر آنحضرت صلی اللہ علیہ وسلم نے فرمایا ‘ ہاں دو ‘ دو ‘ دو بھی یہی درجہ رکھتے ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 41,
        "matchingArabicURN": 164270,
        "last_updated": null
    },
    {
        "urduURN": 4072010,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7311,
        "hadithSanad": "ہم سے عبیداللہ بن موسیٰ نے بیان کیا ‘ ان سے اسماعیل نے ‘ ان سے قیس نے ‘ ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میری امت کا ایک گروہ ہمیشہ غالب رہے گا ( اس میں علمی و دینی غلبہ بھی داخل ہے ) یہاں تک کہ قیامت آ جائے گی اور وہ غالب ہی رہیں گے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 42,
        "matchingArabicURN": 164280,
        "last_updated": null
    },
    {
        "urduURN": 4072020,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7312,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا ہم سے عبداللہ بن وہب نے بیان کیا ‘ ان سے یونس نے ‘ ان سے ابن شہاب نے انہیں حمید نے خبر دی ‘ کہا کہ",
        "hadithText": "میں نے معاویہ بن ابی سفیان رضی اللہ عنہ سے سنا ‘ وہ خطبہ دے رہے تھے ‘ انہوں نے کہا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اللہ جس کے ساتھ خیر کا ارادہ کرتا ہے اسے دین کی سمجھ عطا فرما دیتا ہے اور میں تو صرف تقسیم کرنے والا ہوں اور دیتا اللہ ہے اور اس امت کا معاملہ ہمیشہ درست رہے گا ‘ یہاں تک کہ قیامت ہو جائے یا ( آپ صلی اللہ علیہ وسلم نے یوں فرمایا کہ ) یہاں تک کہ اللہ کا حکم آ پہنچے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 43,
        "matchingArabicURN": 164290,
        "last_updated": null
    },
    {
        "urduURN": 4072030,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7313,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان نے بیان کیا ‘ ان سے عمر بن دینار نے بیان کیا کہ میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "جب رسول اللہ صلی اللہ علیہ وسلم پر یہ آیت نازل ہوئی کہ ” کہو کہ وہ اس پر قادر ہے کہ تم پر تمہارے اوپر سے عذاب بھیجے ۔ ” تو آنحضرت صلی اللہ علیہ وسلم نے کہا کہ میں تیرے با عظمت و بزرگ منہ کی پناہ مانگتا ہوں ” تمہارے پاؤں کے نیچے سے “ ( عذاب بھیجے ) تو اس پر پھر آنحضرت صلی اللہ علیہ وسلم نے کہا کہ میں تیرے مبارک منہ کی پناہ مانگتا ہوں ‘ پھر جب یہ آیت نازل ہوئی کہ ” یا تمہیں فرقوں میں تقسیم کر دے اور تم میں سے بعض کو بعض کا خوف چکھائے “ تو آپ نے فرمایا کہ یہ دونوں آسان و سہل ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 44,
        "matchingArabicURN": 164300,
        "last_updated": null
    },
    {
        "urduURN": 4072040,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7314,
        "hadithSanad": "ہم سے اصبغ بن الفرج نے بیان کیا ‘ کہا مجھ سے عبداللہ بن وہب نے بیان کیا ‘ ان سے یونس بن یزید نے ‘ ان سے ابن شہاب نے ‘ ان سے ابوسلمہ بن عبدالرحمٰن نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "ایک اعرابی نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور کہا کہ میری بیوی کے یہاں لڑکا پیدا ہوا ہے جس کو میں اپنا نہیں سمجھتا ۔ آنحضرت صلی اللہ علیہ وسلم نے ان سے فرمایا کہ تمہارے پاس اونٹ ہیں ؟ انہوں نے کہا کہ ہیں ۔ دریافت کیا کہ ان کے رنگ کیسے ہیں ؟ کہا کہ سرخ ہیں ۔ پوچھا کہ ان میں کوئی خاکی بھی ہے ؟ انہوں نے کہ ہاں ان میں خاکی بھی ہیں ۔ اس پر آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ پھر کس طرح تم سمجھتے ہو کہ اس رنگ کا پیدا ہوا ؟ انہوں نے کہا کہ یا رسول اللہ ! کسی رگ نے یہ رنگ کھینچ لیا ہو گا ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ممکن ہے اس بچے کا رنگ بھی کسی رگ نے کھینچ لیا ہو ؟ اور آنحضرت صلی اللہ علیہ وسلم نے ان کو بچے کے انکار کرنے کی اجازت نہیں دی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 45,
        "matchingArabicURN": 164310,
        "last_updated": null
    },
    {
        "urduURN": 4072050,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7315,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے ابو بشر نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں اور عرض کیا کہ میری والدہ نے حج کرنے کی نذر مانی تھی اور وہ ( ادائےگی سے پہلے ہی ) وفات پاگئیں ۔ کیا میں ان کی طرف سے حج کر لو ں ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ہاں ان کی طرف سے حج کر لو ۔ تمہارا کیا خیال ہے ‘ اگر تمہاری والدہ پر قرض ہوتا تو تم اسے پورا کرتیں ؟ انہوں نے کہا کہ ہاں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ پھر اس قرض کو بھی پورا کر جو اللہ تعالیٰ کا ہے کیونکہ اس قرض کا پورا کرنا زیادہ ضروری ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 46,
        "matchingArabicURN": 164320,
        "last_updated": null
    },
    {
        "urduURN": 4072060,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7316,
        "hadithSanad": "ہم سے شہاب بن عباد نے بیان کیا ، کہا ہم سے ابراہیم بن حمید نے بیان کیا ، ان سے اسماعیل بن ابی خالد نے ، ان سے قیس بن ابی حازم نے ، ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، رشک دو ہی آدمیوں پر ہو سکتا ہے ، ایک وہ جیسے اللہ نے مال دیا اور اسے ( مال کو ) راہ حق میں لٹانے کی پوری طرح توفیق ملی ہوتی ہے اور دوسراوہ جسے اللہ نے حکمت دی ہے اور اس کے ذریعہ فیصلہ کرتا ہے اور اس کی تعلیم دیتا ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 47,
        "matchingArabicURN": 164330,
        "last_updated": null
    },
    {
        "urduURN": 4072070,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7317,
        "hadithSanad": "ہم سے محمد بن سلام نے بیان کیا ‘ کہا ہم کو ابومعاویہ نے خبر دی ‘ کہا ہم سے ہشام نے ‘ ان سے ان کے والد نے اور ان سے مغیرہ بن شعبہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "عمر بن خطاب رضی اللہ عنہ نے عورت کے املاص کے متعلق ( صحابہ سے ) پوچھا ۔ یہ اس عورت کو کہتے ہیں جس کے پیٹ پر ( جبکہ وہ حاملہ ہو ) مار دیا گیا ہو اور اس کا ناتمام ( ادھورا ) بچہ گر گیا ہو ۔ عمر رضی اللہ عنہ نے پوچھا آپ لوگوں میں سے کسی نے نبی کریم صلی اللہ علیہ وسلم سے اس کے بارے میں کوئی حدیث سنی ہے ؟ میں نے کہا کہ میں نے سنی ہے ۔ پوچھا کیا حدیث ہے ؟ میں نے بیان کیا کہ میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ہے کہ ایسی صورت میں ایک غلام یا باندی تاوان کے طور پر ہے ۔ عمر رضی اللہ عنہ نے کہا کہ تم اب چھوٹ نہیں سکتے یہاں تک کہ تم نے جو حدیث بیان کی ہے اس سلسلے میں نجات کا کوئی ذریعہ ( یعنی کوئی شہادت کہ واقعی آنحضرت صلی اللہ علیہ وسلم نے یہ حدیث فرمائی تھی ) لاؤ ۔ \n<span class=urdu_sanad>پھر میں نکلا تو محمد بن مسلمہ رضی اللہ عنہ مل گئے اور میں نے انہیں لایا اور انہوں نے میرے ساتھ گواہیت دی کہ</span> انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ اس میں ایک غلام یا باندی کی تاوان ہے ۔ ہشام بن عروہ کے ساتھ اس حدیث کو ابن ابی الزناد نے بھی اپنے باپ سے ‘ انہوں نے عروہ سے ‘ انہوں نے مغیرہ سے روایت کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 48,
        "matchingArabicURN": 164344,
        "last_updated": null
    },
    {
        "urduURN": 4072090,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7319,
        "hadithSanad": "ہم سے احمد بن یونس نے بیان کیا ‘ کہا ہم سے ابن ابی ذئب نے بیان کیا ‘ ان سے مقبری نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ قیامت اس وقت تک قائم نہیں ہو گی جب تک میری امت اس طرح پچھلی امتوں کے مطابق نہیں ہو جائے گی جیسے بالشت بالشت کے اور ہاتھ ہاتھ کے برابر ہوتا ہے ۔ پوچھا گیا یا رسول اللہ ! اگلی امتوں سے کون مراد ہیں ‘ پارسی اور نصرانی ؟ آپ نے فرمایا پھر اور کون ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 49,
        "matchingArabicURN": 164360,
        "last_updated": null
    },
    {
        "urduURN": 4072100,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7320,
        "hadithSanad": "ہم سے محمد بن عبد العزیز نے بیان کیا ‘ کہا ہم سے یمن کے ابو عمر صنعانی بیان کیا ‘ ان سے زید بن اسلم نے ‘ ان سے عطاء بن یسار نے اور ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا تم اپنے سے پہلی امتوں کی ایک ایک بالشت اور ایک ایک گز میں اتباع کرو گے ۔ یہاں تک کہ اگر وہ کسی گوہ کے سوراخ میں داخل ہوئے ہوں گے تو تم اس میں بھی ان کی اتباع کرو گے ۔ ہم نے پوچھا یا رسول اللہ ! کیا یہود و نصاریٰ مراد ہیں ؟ فرمایا پھر اور کون ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 50,
        "matchingArabicURN": 164370,
        "last_updated": null
    },
    {
        "urduURN": 4072110,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7321,
        "hadithSanad": "ہم سے عبداللہ بن زبیر حمیدی نے بیان کیا ‘ کہا ہم سے سفیان نے ‘ کہا ہم سے اعمش نے ‘ ان سے عبداللہ بن مروہ نے ‘ ان سے مسروق نے اور ان سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے فرمایا ‘ جو شخص بھی ظلم کے ساتھ قتل کیا جائے گا اس کے ( گناہ کا ) ایک حصہ آدم علیہ السلام کے پہلے بیٹے ( قابیل ) پر بھی پڑے گا ۔ بعض اوقات سفیان نے اس طرح بیان کیا کہ ” اس کے خون کا “ ۔ کیونکہ اسی نے سب سے پہلے ناحق خون کی بری رسم قائم کی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 51,
        "matchingArabicURN": 164380,
        "last_updated": null
    },
    {
        "urduURN": 4072120,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7322,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ انہوں نے کہا مجھ سے امام مالک نے بیان کیا ‘ انہوں نے محمد بن منکدر سے ‘ انہوں نے جابر بن عبداللہ انصاری رضی اللہ عنہ سے کہ",
        "hadithText": "ایک گنوار ( قیس بن ابی حازم یا قیس بن حاز م یا اور کوئی ) نے آنحضرت صلی اللہ علیہ وسلم سے اسلام پر بیعت کی ‘ پھر مدینہ میں اس کو تپ آنے لگی ۔ وہ آنحضرت صلی اللہ علیہ وسلم کے پاس آیا ۔ کہنے لگا یا رسول اللہ ! میری بیعت فسخ کر دیجئیے ۔ آنحضرت صلی اللہ علیہ وسلم نے پھر انکار کیا ۔ اس کے بعد وہ مدینہ سے نکل کر اپنے جنگل کو چلا گیا تو آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مدینہ لوہار کی بھٹی کی طرح ہے جو اپنی میل کچیل کو دور کر دیتی ہے اور کھرے پاکیزہ مال کو رکھ لیتی ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 52,
        "matchingArabicURN": 164390,
        "last_updated": null
    },
    {
        "urduURN": 4072130,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7323,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے عبد الواحد بن زیاد نے بیان کیا ‘ کہا ہم سے معمربن راشد نے بیان کیا ‘ ان سے زہری نے ‘ ان سے عبیداللہ بن عبداللہ نے ‘ ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں عبدالرحمٰن بن عوف رضی اللہ عنہ کو ( قرآن مجید ) پڑھا یا کرتا تھا ۔ جب وہ آخری حج آیا جو عمر رضی اللہ عنہ نے کیا تھا تو عبدالرحمٰن نے منیٰ میں مجھ سے کہا کاش تم امیرالمؤمنین کو آج دیکھتے جب ان کے پاس ایک شخص آیا اور کہا کہ فلاں شخص کہتا ہے کہ اگر امیرالمؤمنین کا انتقال ہو جائے تو ہم فلاں سے بیعت کر لیں گے ۔ یہ سن کر عمر رضی اللہ عنہ نے کہا کہ میں آج سہ پہر کو کھڑے ہو کر لوگوں کو خطبہ سناؤں گا اور ان کو ڈراؤں کا جو ( عام مسلمانوں کے حق کو ) غصب کرنا چاہتے ہیں اور خود اپنی رائے سے امیر منتخب کرنے کا ارادہ رکھتے ہیں ۔ میں نے عرض کیا کہ آپ ایسا نہ کریں کیونکہ موسم حج میں ہر طرح کے ناواقف اور معمولی لوگ جمع ہو جاتے ہیں ۔ یہ سب کثرت سے آپ کی مجلس میں جمع ہو جائیں گے اور مجھے ڈر ہے کہ وہ آپ کی بات کا صحیح مطلب نہ سمجھ کر کچھ اور معنیٰ نہ کر لیں اور اسے منہ در منہ اڑاتے پھریں ۔ اس لیے ابھی توقف کیجئے ۔ جب آپ مدینے پہنچیں جو دار الہجرت اور دار السنہ ہے تو وہاں آپ کے مخاطب رسول اللہ صلی اللہ علیہ وسلم کے صحابہ ‘ مہاجرین و انصار خالص ایسے ہی لوگ ملیں گے وہ آپ کی بات کو یاد رکھیں گے اور اس کا مطلب بھی ٹھیک بیان کریں گے ۔ اس پر امیرالمؤمنین نے کہا کہ واللہ ! میں مدینہ پہنچ کر جو پہلا خطبہ دوں گا اس میں اس کا بیان کروں گا ۔ ابن عباس رضی اللہ عنہما نے بیان کیا کہ پھر ہم مدینے آئے تو حضرت عمر رضی اللہ عنہ جمعہ کے دن دوپہر ڈھلے بر آمد ہوئے اور خطبہ سنایا ۔ انہوں نے کہا اللہ پاک نے حضرت محمد صلی اللہ علیہ وسلم کو سچا رسول بنا کر بھیجا اور آپ پر قرآن اتارا ۔ اس قرآن میں رجم کی آیت بھی تھی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 53,
        "matchingArabicURN": 164400,
        "last_updated": null
    },
    {
        "urduURN": 4072140,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7324,
        "hadithSanad": "ہم سے سلیمان بن حرب نے بیان کیا ‘ کہا ہم سے حماد بن زید نے ‘ ان سے ایوب سختیانی نے ‘ ان سے محمد بن سیرین نے بیان کیا کہ",
        "hadithText": "ہم ابوہریرہ رضی اللہ عنہ کے پاس تھی اور ان کے جسم پر کتان کے دو کپڑے گیرو میں رنگے ہوئے تھے ۔ انہوں نے ان ہی کپڑوں میں ناک صاف کی اور کہا واہ واہ دیکھو ابوہریرہ کتان کے کپڑوں میں ناک صاف کرتا ہے ‘ اب ایسا مالدار ہو گیا حالانکہ میں نے اپنے آپ کو ایک زمانہ میں ایسا پایا ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے منبر اور عائشہ رضی اللہ عنہا کے حجرہ کے درمیان بیہوش ہو کر گڑ پڑتا تھا اور گزرنے والا میری گردن پر یہ سمجھ کر پاؤں رکھتا تھا کہ میں پاگل ہو گیا ہوں ‘ حالانہ مجھے جنون نہیں ہوتا تھا ‘ بلکہ صرف بھوک کی وجہ سے میری یہ حالت ہو جاتی تھی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 54,
        "matchingArabicURN": 164410,
        "last_updated": null
    },
    {
        "urduURN": 4072150,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7325,
        "hadithSanad": "ہم سے محمد بن کثیر نے بیان کیا ‘ کہا ہم کو سفیان ثوری نے خبر دی ‘ ان سے عبدالرحمٰن بن عابس نے بیان کیا ‘ کہا کہ ابن عباس رضی اللہ عنہما سے پوچھا گیا کہ",
        "hadithText": "کیا آپ نبی کریم صلی اللہ علیہ وسلم کے ساتھ عید میں گئے ہیں ؟ کہا کہ ہاں میں اس وقت کم سن تھا ۔ اگر آنخصرت صلی اللہ علیہ وسلم سے مجھ کو اتنا نزدیک کا رشتہ نہ ہوتا اور کم سن نہ ہوتا تو آپ کے ساتھ کبھی نہیں رہ سکتا تھا ۔ آنحضرت صلی اللہ علیہ وسلم گھر سے نکل کر اس نشان کے پاس آئے جو کثیر بن صلت کے مکان کے پاس ہے اور وہاں آپ نے نمازعید پڑھائی پھر خطبہ دیا ۔ انہوں نے اذان اور اقامت کا ذکر نہیں کیا ‘ پھر آپ نے صدقہ دینے کا حکم دیا تو عورتیں اپنے کانوں اور گردنوں کی طرف ہاتھ بڑھانے لگیں زیوروں کا صدقہ دینے کے لیے ۔ اس کے بعد آنحضرت صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ کو حکم فرمایا ۔ وہ آئے اور صدقہ میں ملی ہوئی چیزوں کو لے کر آنحضرت صلی اللہ علیہ وسلم کے پاس واپس گئے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 55,
        "matchingArabicURN": 164420,
        "last_updated": null
    },
    {
        "urduURN": 4072160,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7326,
        "hadithSanad": "ہم سے ابونعیم نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم قباء میں تشریف لاتے تھے ‘ کبھی پیدل اور کبھی سواری ( راجع : ۱۹۱۱ )</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 56,
        "matchingArabicURN": 164430,
        "last_updated": null
    },
    {
        "urduURN": 4072170,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7327,
        "hadithSanad": "ہم سے عبید بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے ان کے والد نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "انہوں نے عبداللہ بن زبیر رضی اللہ عنہما سے کہا تھا کہ مجھے انتقال کے بعد میری سو کنوں کے ساتھ دفن کرنا ۔ آنحضرت صلی اللہ علیہ وسلم کے ساتھ حجرہ میں دفن مت کرنا کیونکہ میں پسند نہیں کرتی کہ میری آپ کی اور بیویوں سے زیادہ پاکی بیان کی جائے ۔ \n<span class=urdu_sanad>اور ہشام سے روایت ہے ‘ ان سے ان کے والد نے بیان کیا کہ</span> عمر رضی اللہ عنہ نے عائشہ رضی اللہ عنہا کے یہاں آدمی بھیجا کہ مجھے اجازت دیں کہ آنحضرت صلی اللہ علیہ وسلم کے ساتھ دفن کیا جاؤں ۔ انہوں نے کہا کہ ہاں اللہ کی قسم ‘ میں ان کو اجازت دیتی ہوں ۔ راوی نے بیان کیا کہ پہلے جب کوئی صحابی ان سے وہاں دفن ہونے کی اجازت مانگتے تو وہ کہلادیتی تھیں کہ نہیں ! اللہ کی قسم میں ان کے ساتھ کسی اور کو دفن نہیں ہونے دوں گی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 57,
        "matchingArabicURN": 164441,
        "last_updated": null
    },
    {
        "urduURN": 4072190,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7329,
        "hadithSanad": "ہم سے ایوب بن سلمان نے بیان کیا ‘ کہا ہم سے ابوبکر بن اویس نے بیان کیا ‘ ان سے سلیمان بن بلال نے ‘ ان سے صالح بن کیسان نے ‘ ان سے ابن شہاب نے بیان کیا کہ مجھے انس بن مالک رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز پڑھ کر ان گاؤں میں جاتے جو مدینہ کی بلندی پر واقع ہیں وہاں پہنچ جاتے اور سورج بلند رہتا ۔ عوالی مدینہ کا بھی یہی حکم ہے اور لیث نے بھی اس حدیث کو یونس سے روایت کیا ۔ اس میں اتنا زیادہ ہے کہ یہ گاؤں مدینہ سے تین چار میل پر واقع ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 58,
        "matchingArabicURN": 164460,
        "last_updated": null
    },
    {
        "urduURN": 4072200,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7330,
        "hadithSanad": "ہم سے عمرو بن زرارہ نے بیان کیا ‘ کہا ہم سے قاسم بن مالک نے بیان کیا ‘ ان سے جعید نے ‘ انہوں نے سائب بن یزید سے سنا ‘ انہوں نے بیان کیا کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے زمانے میں صاع تمہارے وقت کی مد سے ایک مداور ایک تہائی مد کا ہوتا تھا ‘پھر صاع کی مقدار بڑھ گئی یعنی حضرت عمر بن عبد العزیز کے زمانہ میں وہ چار مد کا ہو گیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 59,
        "matchingArabicURN": 164470,
        "last_updated": null
    },
    {
        "urduURN": 4072210,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7331,
        "hadithSanad": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ‘ ان سے امام مالک نے ‘ ان سے اسحاق بن عبداللہ بن ابی طلحہ نے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اے اللہ ! ان مدینہ والوں کے پیمانہ میں انہیں برکت دے اور ان کے صاع اور مد میں انہیں برکت دے ۔ آپ کی مراد اہل مدینہ ( کے صاع ومد ) سے تھی ۔ ( مدنی صاع اور مد کو بھی تاریخی عظمت حاصل ہے )</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 60,
        "matchingArabicURN": 164480,
        "last_updated": null
    },
    {
        "urduURN": 4072220,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7332,
        "hadithSanad": "ہم سے ابراہیم بن المنذر نے بیان کیا ‘ کہا ہم سے ابو ضمرہ نے بیان کیا ‘ کہا ہم سے موسیٰ بن عقبہ نے ‘ ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کے پاس یہودی ایک مرد اور ایک عورت کو لے کر آئے جنہوں نے زنا کیا تھا تو آنحضرت صلی اللہ علیہ وسلم نے ان کے لیے رجم کا حکم دیا اور انہیں مسجد کی ایک جگہ کے قریب رجم کیا گیا جہاں جنازے رکھے جاتے ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 61,
        "matchingArabicURN": 164490,
        "last_updated": null
    },
    {
        "urduURN": 4072230,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7333,
        "hadithSanad": "ہم سے اسماعیل نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے مطلب کے مولیٰ عمرونے اور ان سے انس بن مالک رضی اللہ عنہ نے کہ",
        "hadithText": "احد پہاڑ رسول اللہ صلی اللہ علیہ وسلم کو ( راستے میں ) دکھائی دیا تو آپ نے فرمایا کہ یہ وہ پہاڑ ہے جو ہم سے محبت رکھتا ہے اور ہم اس سے محبت رکھتے ہیں ۔ اے اللہ ! ابراہیم علیہ السلام نے مکہ کو حرمت والا قرار دیا تھا اور میں تیرے حکم سے اس کے دونوں پتھریلے کناروں کے درمیانی علاقہ کو حرمت والا قرار دیتا ہوں ۔ اس روایت کی متابعت سہل رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے احد کے متعلق کی ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 62,
        "matchingArabicURN": 164500,
        "last_updated": null
    },
    {
        "urduURN": 4072240,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7334,
        "hadithSanad": "ہم سے ابن ابی مریم نے بیان کیا ‘ کہا ہم سے ابو غسان نے بیان کیا ‘ کہا مجھ سے ابوحازم نے بیان کیا ‘ ان سے سہل رضی اللہ عنہ نے کہ",
        "hadithText": "مسجدنبوی کی قبلہ کی طرف دیوار اور منبر کے درمیان بکریوں کے گزرنے جتنا فاصلہ تھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 63,
        "matchingArabicURN": 164510,
        "last_updated": null
    },
    {
        "urduURN": 4072250,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7335,
        "hadithSanad": "ہم سے عمر بن علی نے بیان کیا ‘ انہوں نے کہا ہم سے عبدالرحمٰن بن مہدی نے بیان کیا ‘ انہوں نے کہا ہم سے مالک نے بیان کیا ‘ ان سے خبیب بن عبدالرحمٰن نے بیان کیا ‘ ان سے حفص بن عاصم نے بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ میرے حجرہ اور میرے منبر کے درمیان کی زمین جنت کے باغوں میں سے ایک باغ ہے اور میرا یہ منبر میرے حوض پر ہو گا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 64,
        "matchingArabicURN": 164520,
        "last_updated": null
    },
    {
        "urduURN": 4072260,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7336,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے جویریہ نے بیان کیا ‘ ان سے نافع نے اور ان سے عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے گھوڑوں کی دوڑ کرائی اور وہ گھوڑے چھوڑے گئے جو گھوڑ دوڑ کیلئے تیار کئے گئے تھے تو ان کے دوڑ نے کا میدان مقام حفیاء سے ثنیۃ الوداع سے مسجد بنی زریق تک تھا اور عبداللہ رضی اللہ عنہ بھی ان لوگوں میں تھے جنہوں نے مقابلے میں حصہ لیا تھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 65,
        "matchingArabicURN": 164530,
        "last_updated": null
    },
    {
        "urduURN": 4072270,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7337,
        "hadithSanad": "ہم سے قتیبہ نے بیان کیا ‘ ان سے لیث نے ‘ ان سے نافع نے اور ان سے ابن عمر رضی اللہ عنہما نے ( دوسری سند ) اور مجھ سے اسحاق نے بیان کیا ‘ انہوں نے کہا ہم کو عیسیٰ اور ابن ادریس نے خبر دی اور ابن ابی غنیہ نے خبر دی ‘ انہیں ابو حیان نے ‘ انہیں شعبی نے اور ان سے حضرت عبداللہ بن عمر رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "میں نے عمر رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کے منبر پر ( خطبہ دیتے ) سنا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 66,
        "matchingArabicURN": 164540,
        "last_updated": null
    },
    {
        "urduURN": 4072280,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7338,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں سائب بن یزید نے خبر دی ‘ انہوں نے عثمان بن عفان رضی اللہ عنہ سے سنا ‘",
        "hadithText": "جو نبی کریم صلی اللہ علیہ وسلم کے منبر سے ہمیں خطاب کر رہے تھے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 67,
        "matchingArabicURN": 164550,
        "last_updated": null
    },
    {
        "urduURN": 4072290,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7339,
        "hadithSanad": "ہم سے محمد بن بشار نے بیان کیا ‘ کہا ہم سے عبد الاعلیٰ نے بیان کیا ‘ کہا ہم سے ہشام بن حسان نے بیان کیا ‘ان سے ہشام بن عروہ نے بیان کیا ‘ ان سے ان کے والد نے کہ عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "میرے اور رسول اللہ صلی اللہ علیہ وسلم کے لیے یہ لگن رکھی جاتی تھی اور ہم دونوں اس سے ایک ساتھ نہاتے تھے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 68,
        "matchingArabicURN": 164560,
        "last_updated": null
    },
    {
        "urduURN": 4072300,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7340,
        "hadithSanad": "ہم سے مسدد نے بیان کیا ‘ کہا ہم سے عباد بن عباد نے بیان کیا ‘ کہا ہم سے عاصم الاحوال نے بیان کیا اور ان سے انس رضی اللہ عنہ نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے انصار اور قریش کے درمیان میرے اس گھر میں بھائی چارہ کرایا جو مدینہ منورہ میں ہے ۔ \n<span class=urdu_sanad></span> اور آپ نے قبائل بنی سلیم کے لیے ایک مہینہ تک دعائے قنوت پڑھی جس میں ان کے لیے بددعا کی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 69,
        "matchingArabicURN": 164570,
        "last_updated": null
    },
    {
        "urduURN": 4072320,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7342,
        "hadithSanad": "ہم سے ابو کریب نے بیان کیا ’کہا ہم سے ابواسامہ نے بیان کیا ‘ کہا ہم سے برید نے بیان کیا ‘ کہا کہ",
        "hadithText": "میں مدینہ منورہ آیا اور عبداللہ بن سلام رضی اللہ عنہ سے میری ملاقات ہوئی تو انہوں نے کہا کہ میرے ساتھ گھر چلو تو میں تمہیں اس پیالہ میں پلاؤں گا جس میں رسول اللہ صلی اللہ علیہ وسلم نے پیا تھا اور پھر ہم اس نماز پڑھنے کی جگہ نماز پڑھیں گے جہاں آنحضرت صلی اللہ علیہ وسلم نے نماز پڑھی تھی ۔ چنانچہ میں ان کے ساتھ گیا اور انہوں نے مجھے ستو پلا یا اور کھجور کھلائی اور میں نے ان کے نماز پڑھنے کی جگہ نماز پڑھی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 70,
        "matchingArabicURN": 164580,
        "last_updated": null
    },
    {
        "urduURN": 4072330,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7343,
        "hadithSanad": "ہم سے سعید بن ربیع نے بیان کیا ‘ کہا ہم سے علی بن مبارک نے بیان کیا ‘ ان سے یحییٰ بن کثیر نے ‘ ان سے عکرمہ نے بیان کیا ‘ ان سے ابن عباس رضی اللہ عنہما نے اور ان سے عمر رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "مجھ سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ میرے پاس رات ایک میرے رب کی طرف سے آنے والا آیا ۔ آنحضرت صلی اللہ علیہ وسلم اس وقت وادی عقیق میں تھے اور کہا کہ اس مبارک وادی میں نماز پڑھئے اور کہئے کہ عمرہ اور حج ( کی نیت کرتا ہوں ) اور ہارون بن اسماعیل نے بیان کیا کہ ہم سے علی نے بیان کیا ( ان الفاظ کے ساتھ ) ” عمرۃ فی حجۃ “ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 71,
        "matchingArabicURN": 164590,
        "last_updated": null
    },
    {
        "urduURN": 4072340,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7344,
        "hadithSanad": "ہم سے محمد بن یوسف نے بیان کیا ‘ کہا ہم سے سفیان ثوری نے بیان کیا ‘ ان سے عبداللہ بن دینار نے اور ان سے ابن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم نے اہل نجد کے لیے مقام قرن ‘ حجفہ کو اہل شام کے لیے اور ذوالحلیفہ کو اہل مدینہ کے لیے میقات مقرر کیا ۔ بیان کیا کہ میں نے یہ نبی کریم صلی اللہ علیہ وسلم سے سنا اور مجھے معلوم ہوا ہے کہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اہل یمن کے لیے یلملم ( میقات ) ہے اور عراق کا ذکر ہوا تو انہوں نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کے زمانے میں عراق نہیں تھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 72,
        "matchingArabicURN": 164600,
        "last_updated": null
    },
    {
        "urduURN": 4072350,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7345,
        "hadithSanad": "ہم سے عبدالرحمٰن بن مبارک نے بیان کیا ‘ کہا ہم سے فضیل نے بیان کیا ‘ انہوں نے کہا ہم سے موسیٰ بن عقبہ نے بیان کیا ‘ ان سے سالم بن عبداللہ نے ‘ ان سے ان کے والد عبداللہ بن عمر رضی اللہ عنہما نے کہ",
        "hadithText": "نبی کریم صلی اللہ علیہ وسلم کو جب کہ آپ مقام ذوالحلیفہ میں پڑاؤ کئے ہوئے تھے ‘ خواب دکھایا گیا اور کہا گیا کہ آپ ایک مبارک وادی میں ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 73,
        "matchingArabicURN": 164610,
        "last_updated": null
    },
    {
        "urduURN": 4072360,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7346,
        "hadithSanad": "ہم سے احمد بن محمد نے بیان کیا ‘ کہا ہم کو عبداللہ بن مبارک نے خبر دی ‘ کہا ہم کو معمر نے ‘ انہیں زہری نے ‘ انہیں سالم نے اور انہیں عبداللہ بن عمر رضی اللہ عنہما نے ‘",
        "hadithText": "انہوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ‘ آپ صلی اللہ علیہ وسلم فجر کی نماز میں یہ دعا رکوع سے سر اٹھانے کے بعد پڑھتے تھے کہ ” اے اللہ ! ہمارے رب تیرے ہی لیے تمام تعریفیں ہیں ‘ پھر آپ صلی اللہ علیہ وسلم نے کہا ‘ اے اللہ ! فلاں اور فلاں کو اپنی رحمت سے دور کر دے “ اس پر اللہ عزوجل نے یہ آیت نازل کی کہ آپ کو اس معاملہ میں کوئی اختیار نہیں ہے یا اللہ ! ان کی توبہ قبول کر لے یا انہیں عذاب دے کہ بلاشبہ وہ حد سے تجاوز کرنے والے ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 74,
        "matchingArabicURN": 164620,
        "last_updated": null
    },
    {
        "urduURN": 4072370,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7347,
        "hadithSanad": "ہم سے ابو الیمان نے بیان کیا ‘ کہا ہم کو شعیب نے خبر دی ( دوسری سند ) امام بخاری نے کہا کہ اور مجھ سے محمد بن سلام بیکندی نے بیان کیا ‘ کہا ہم کو عتاب بن بشیر نے خبر دی ‘ انہیں اسحاق ابن ابی راشد نے ‘ انہیں زہری نے ‘ انہیں زین العابدین علی بن حسین رضی اللہ عنہ نے خبر دی اور انہیں ان کے والد حسین بن علی رضی اللہ عنہ نے خبر دی کہ علی بن ابی طالب رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ان کے اور فاطمہ بنت رسول اللہ علیم السلام والصلٰوۃ کے گھر ایک رات آنحضرت صلی اللہ علیہ وسلم تشریف لائے اور فرمایا کہ تم لوگ تہجد کی نماز نہیں پڑھتے ۔ علی رضی اللہ عنہ نے بیان کیا کہ میں نے عرض کیا ‘ یا رسول اللہ ! ہماری جانیں اللہ کے ہاتھ میں ہیں پس جب وہ ہمیں اٹھانا چاہے تو ہم کو اٹھا دے گا ۔ جوں ہی میں نے آنحضرت صلی اللہ علیہ وسلم سے یہ کہا تو آپ پیٹھ موڑ کر واپس جانے لگے اور کوئی جواب نہیں دیا لیکن واپس جاتے ہوئے آپ اپنی ران پر ہاتھ مار رہے تھے اور کہہ رہے تھے کہ ” اور انسان بڑا ہی جھگڑالو ہے “ اگر کوئی تمہارے پاس رات میں آئے تو ” طارق “ کہلائے گا اور قرآن میں جو ” والطارق “ کا لفظ آیا ہے اس سے مراد ستارہ ہے اور ” ثاقب “ بمعنی چمکتا ہوا ۔ عرب لوگ آگ جلانے والے سے کہتے ہیں ۔ اثقب نارک یعنی آگ روشن کر ۔ اس سے لفظ ثاقب ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 75,
        "matchingArabicURN": 164630,
        "last_updated": null
    },
    {
        "urduURN": 4072380,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7348,
        "hadithSanad": "ہم سے قتیبہ بن سعید نے بیان کیا ‘ ان سے لیث بن سعد نے بیان کیا ‘ ان سے سعید مقبری نے ‘ ان سے ان کے والد ابوسعید کیسان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "ہم مسجدنبوی میں تھے کہ رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور فرمایا یہودیوں کے پاس چلو ۔ چنانچہ ہم آنحضرت صلی اللہ علیہ وسلم کے ساتھ روانہ ہوئے ۔ جب ہم ان کے مدرسہ تک پہنچے تو آنحضرت صلی اللہ علیہ وسلم نے کھڑے ہو کر انہیں آوازدی اور فرمایا اے یہودیو ! اسلام لاؤ تو تم سلامت رہو گے ۔ اس پر یہودیوں نے کہا کہ ابوالقاسم ! آپ صلی اللہ علیہ وسلم نے اللہ کا حکم پہنچا دیا ۔ راوی نے بیان کیا کہ آنحضرت صلی اللہ علیہ وسلم نے دوبارہ ان سے فرمایا کہ یہی میرا مقصد ہے ‘ اسلام لاؤ تو تم سلامت رہو گے ۔ انہوں نے کہا ابوالقاسم ! آپ نے پیغام خدا پہنچا دیا ۔ پھر آپ نے یہی بات تیسری بار کہی اور فرمایا ‘ جان لو کہ ساری زمین اللہ اور اس کے رسول کی ہے اور میں چاہتا ہوں کہ تمہیں اس جگہ سے باہر کر دوں ۔ پس تم میں سے جو کوئی اپنی جائیداد کے بدلے میں کوئی قیمت پاتا ہو تو اسے بیچ لے ورنہ جان لو کہ زمین اللہ اور اس کے رسول کی ہے ۔ ( تم کو یہ شہر چھوڑ نا ہو گا ) ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 76,
        "matchingArabicURN": 164640,
        "last_updated": null
    },
    {
        "urduURN": 4072390,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7349,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ‘ کہا ہم سے ابواسامہ نے بیان کیا ‘ کہا ہم سے اعمش نے بیان کیا ‘ کہا ہم سے ابوصالح ( ذکوان ) نے بیان کیا ‘ ان سے ابو سعید خدری رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قیامت کے دن نوح علیہ السلام کو لایا جائے گا اور ان سے پوچھا جائے گا ‘ کیا تم نے اللہ کا پیغام پہنچا دیا تھا ؟ وہ عرض کریں گے کہ ہاں اے رب ! پھر ان کی امت سے پوچھا جائے گا کہ کیا انہوں نے تمہیں اللہ کا پیغام پہنچا دیا تھا ؟ وہ کہیں گے کہ ہمارے پاس کوئی ڈرانے والا نہیں آیا ۔ اللہ تعالیٰ حضرت نوح علیہ السلام سے پوچھے گا ‘ تمہارے گواہ کون ہیں ؟ نوح علیہ السلام عرض کریں گے کہ محمد صلی اللہ علیہ وسلم اور ان کی امت پھر تمہیں لایا جائے گا اور تم لوگ ان کے حق میں شہادت دو گے ‘ پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت پڑھی ” اور اسی طرح ہم نے تمہیں درمیانی امت بنایا “ کہا کہ وسط بمعنی عدل ( میانہ رو ) ہے ‘ تاکہ تم لوگوں کے لیے گواہ بنو اور رسول تم پر گواہ بنے ۔ اسحاق بن منصور سے جعفر بن عون نے روایت کیا ‘ کہا ہم سے اعمش نے بیان کیا ‘ ان سے ابوصالح نے ‘ ان سے ابو سعید خدری رضی اللہ عنہ نے اور ان سے نبی کریم صلی اللہ علیہ وسلم نے یہی حدیث بیان فرمائی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 77,
        "matchingArabicURN": 164651,
        "last_updated": null
    },
    {
        "urduURN": 4072400,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 0,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ ان سے ان کے بھائی ابوبکرنے بیان کیا ‘ ان سے سلیمان بن بلال نے بیان کیا ‘ ان سے عبد المجید بن سہیل بن عبدالرحمٰن بن عوف نے بیان کیا ‘ انہوں نے سعید بن مسیب سے سنا ‘ وہ ابو سعید خدری اور ابوہریرہ رضی اللہ عنہما سے بیان کرتے تھے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے بنی عدی الانصاری کے ایک صاحب سودابن عزیہ کو خیبر کا عامل بنا کر بھیجا تو وہ عمدہ قسم کی کھجور وصول کر کے لائے ۔ آنحضور صلی اللہ علیہ وسلم نے پوچھا کیا خیبر کی تمام کھجوریں ایسی ہی ہیں ؟ انہوں نے کہا کہ نہیں یا رسول اللہ ! اللہ کی قسم ! ہم ایسی ایک صاع کھجور دو صاع ( خراب ) کھجور کے بدلے خرید لیتے ہیں ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ ایسا نہ کیاکرو بلکہ ( جنس کو جنس کے بدلے ) برابر برابر میں خریدو ‘ یا یوں کروں کہ ردی کھجور نقدی بیچ ڈالو پھر یہ کھجور اس کے بدلے خرید لو ‘ اسی طرح ہر چیز کو جو تول کر بکتی ہے اس کا حکم ان ہی چیزوں کا ہے جو ناپ کر بکتی ہیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 78,
        "matchingArabicURN": 164670,
        "last_updated": null
    },
    {
        "urduURN": 4072410,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7352,
        "hadithSanad": "ہم سے عبداللہ بن یزید مقری مکی نے بیان کیا ‘ انہوں نے کہا ہم سے حیوہ بن شریح نے بیان کیا ‘ انہوں نے مجھ سے یزید بن عبداللہ بن الہاد نے بیان کیا ‘ ان سے محمد بن ابراہیم بن الحارث نے ‘ ان سے بسر بن سعید نے ‘ ان سے عمرو بن العاص کے مولیٰ ابو قیس نے ‘ ان سے عمر بن العاص رضی اللہ عنہ نے",
        "hadithText": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم نے سنا ‘ آپ نے فرمایا کہ جب حاکم کوئی فیصلہ اپنے اجتہاد سے کرے اور فیصلہ صحیح ہو تو اسے دہرا ثواب ملتا ہے اور جب کسی فیصلہ میں اجتہاد کرے اور غلطی کر جائے تو اسے اکہرا ثواب ملتا ہے ( اجتہاد کا ) بیان کیا کہ پھر میں نے یہ حدیث ابوبکر بن عمر وبن حزم سے بیان کی تو انہوں نے بیان کیا کہ مجھ سے ابوسلمہ بن عبدالرحمٰن نے اسی طرح بیان کیا اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا ۔ اور عبد العزیز بن المطلب نے بیان کیا ‘ ان سے عبداللہ بن ابی ابکرنے بیان کیا ‘ ان سے ابوسلمہ رضی اللہ عنہ نے بیان کیا اور ان سے نبی کریم صلی اللہ علیہ وسلم نے اسی طرح بیان فرمایا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 79,
        "matchingArabicURN": 164691,
        "last_updated": null
    },
    {
        "urduURN": 4072420,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7353,
        "hadithSanad": "ہم سے مسدد بن مسر ہد نے بیان کیا ‘ کہا ہم سے یحییٰ بن سعید قطان نے بیان کیا ‘ ان سے ابن جریج نے ‘ ان سے عطاء بن ابی رباح نے ‘ ان سے عبید بن عمیر نے بیان کیا کہ",
        "hadithText": "ابوموسیٰ اشعری رضی اللہ عنہ نے عمر رضی اللہ عنہ سے ( ملنے کی ) اجازت چاہی اور یہ دیکھ کر کہ حضرت عمر رضی اللہ عنہ مشغول ہیں آپ جلدی سے واپس چلے گئے ۔ پھر عمر رضی اللہ عنہ نے کہا کہ کیا میں ابھی عبداللہ بن قیس ( ابوموسیٰ رضی اللہ عنہ ) کی آواز نہیں سنی تھی ؟ انہیں بلا لو ۔ چنانچہ انہیں بلا یاگیا تو عمر رضی اللہ عنہ نے پوچھا کہ ایسا کیوں کیا ؟ ( جلدی واپس ہو گئے ) انہوں نے کہا کہ ہمیں حدیث میں اس کا حکم دیا گیا ہے ۔ حضرت عمر رضی اللہ عنہ نے کہا کہ اس حدیث پر کوئی گواہ لاؤ ‘ ورنہ میں تمہارے ساتھ یہ ( سختی ) کروں گا ۔ چنانچہ حضرت ابوموسیٰ رضی اللہ عنہ نے انصار کی ایک مجلس میں گئے انہوں نے کہا کہ اس کی گواہی ہم میں سب سے چھوٹا دے سکتا ہے ۔ چنانچہ ابو سیعد خدری رضی اللہ عنہ کھڑے ہوئے اور کہا کہ ہمیں دربار نبوی سے اس کا حکم دیا جاتا تھا ۔ اس پر عمر رضی اللہ عنہ نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کا یہ حکم مجھے معلوم نہیں تھا ‘ مجھے بازار کے کاموں خریدوفروخت نے اس حدیث سے غافل رکھا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 80,
        "matchingArabicURN": 164710,
        "last_updated": null
    },
    {
        "urduURN": 4072430,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7354,
        "hadithSanad": "ہم سے علی بن عبداللہ مدینی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے کہا ‘ مجھ سے زہری نے ‘ انہوں نے اعرج سے سنا ‘ انہوں نے بیان کیا کہ مجھے ابوہریرہ رضی اللہ عنہ نے خبر دی ‘ انہوں نے کہا کہ",
        "hadithText": "تم سمجھتے ہو کہ ابوہریرہ رسول اللہ صلی اللہ علیہ وسلم کی بات زیادہ حدیث بیان کرتے ہیں ‘اللہ کے حضور میں سب کو جانا ہے ۔ بات یہ تھی کہ میں ایک مسکین شخص تھا اور پیٹ بھرنے کے بعد ہر وقت آنحضرت صلی اللہ علیہ وسلم کے ساتھ رہتا تھا لیکن مہاجر ین کو بازار کے کارو بار مشغول رکھتے تھے اور انصار کو اپنے مالوں کی دیکھ بھال مصروف رکھتی تھی ۔ میں ایک دن آنحضرت صلی اللہ علیہ وسلم کی خدمت میں حاضر تھا اور آپ نے فرمایا کہ کون اپنی چادر پھیلائے گا ‘ یہاں تک کہ میں اپنی بات پوری کر لوں اور پھر وہ اپنی چادر سمیٹ لے اور اس کے بعد کبھی مجھ سے سنی ہوئی کوئی بات نہ بھولے ۔ چنانچہ میں نے اپنی چادر جو میرے جسم پر تھی ‘ پھیلادی اور اس ذات کی قسم جس نے آنحضرت صلی اللہ علیہ وسلم کو حق کے ساتھ بھیجا تھا پھر کبھی میں آپ کی کوئی حدیث جو آپ سے سنی تھی ‘ نہیں بھولا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 81,
        "matchingArabicURN": 164720,
        "last_updated": null
    },
    {
        "urduURN": 4072440,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7355,
        "hadithSanad": "ہم سے حماد بن حمید نے بیان کیا ‘ کہا ہم سے عبیداللہ بن معاذ نے ‘ کہا ہم سے ہمارے والد حضرت معاذ بن حسان نے بیان کیا ‘ ان سے شعبہ بن حجاج نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ ان سے محمد بن المنکدر نے بیان کیا ‘ ان سے سعد بن ابراہیم نے ‘ ان سے محمد بن المنکدر نے بیان کیا کہ",
        "hadithText": "میں نے جابر بن عبداللہ رضی اللہ عنہ کو دیکھا کہ وہ ابن الصیاد کے واقعہ پر اللہ کی قسم کھا تے تھے ۔ میں نے ان سے کہا کہ آپ اللہ کی قسم کھا تے ہیں ؟ انہوں نے کہا کہ میں نے عمر رضی اللہ عنہ کو نبی کریم صلی اللہ علیہ وسلم کے سامنے اللہ کی قسم کھا تے دیکھا اور آنحضرت صلی اللہ علیہ وسلم نے اس پر کوئی انکار نہیں فرمایا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 82,
        "matchingArabicURN": 164730,
        "last_updated": null
    },
    {
        "urduURN": 4072450,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7356,
        "hadithSanad": "ہم سے اسماعیل بن ابی اویس نے بیان کیا ‘ کہا مجھ سے امام مالک نے بیان کیا ‘ ان سے زید بن اسلم نے ‘ ان سے ابی صالح السمان نے اور ان سے ابوہریرہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا گھوڑے تین طرح کے لوگوں کے لیے ہیں ۔ ایک شخص کے لیے ان کا ر کھنا کا ر ثواب ہے ‘ دوسرے کے لیے برابر برابر نہ عذاب نہ ثواب اور تیسرے کے لیے وبال جان ہیں ۔ جس کے لیے وہ اجبر ہیں یہ وہ شخص ہے جس نے اسے اللہ کے راستے کے لیے باندھ کر رکھا اور اس کی رسی چراہ گاہ میں دراز کر دی تو وہ گھوڑا جتنی دور تک چراہ گاہ میں گھوم کر چرے گا وہ مالک کی نیکیوں میں ترقی کا ذریعہ ہو گا اور اگر گھوڑے نے اس دراز رسی کو بھی تڑوا لیا اور ایک یا دو دوڑ اس نے لگائی تو اس کے نشانات قدم اور اس کی لید بھی مالک کے لیے باعث اجر و ثواب ہو گی اور اگر گھوڑا کسی نہر سے گزر ا اور اس نے نہر کا پانی پی لیا ‘ مالک نے اسے پلانے کا کوئی ارادہ نہیں کیا تھا تب بھی مالک کے لیے یہ اجر کا باعث ہو گا اور ایسا گھوڑا اپنے مالک کے لیے ثواب ہوتا ہے اوردوسرا شخص برابر برابر والا ہوتا ہے جو گھوڑے کو اظہار بے نیازی یا اپنے بچاؤ کی غرض سے باندھتا ہے اور اس کی پشت اور گردن پر اللہ کے حق کو بھی نہیں بھولتا تو یہ گھوڑا اس کے لیے نہ عذاب ہے نہ ثواب اور تیسرا وہ شخص ہے جو گھوڑے کو فخر اور ریا کے لیے باندھتا ہے تو یہ اس کے لیے وبال جان ہے اور رسول اللہ صلی اللہ علیہ وسلم سے گدھوں کے متعلق پوچھا گیا تو آپ نے فرمایا کہ اللہ تعالیٰ نے اس سلسلہ میں مجھ پر اس جامع اور نادر آیت کے سوا اور کچھ نہیں نازل فرمایا ہے ۔ ” پس جو کوئی ایک ذرہ برابر بھی بھلائی کرے گا وہ اسے دیکھے گا اور جو کوئی ایک ذرہ برابر بھی برائی کرے گا وہ اسے دیکھے گا “ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 83,
        "matchingArabicURN": 164740,
        "last_updated": null
    },
    {
        "urduURN": 4072460,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7357,
        "hadithSanad": "ہم سے یحییٰ بن جعفر بیکندی نے بیان کیا ‘ کہا ہم سے سفیان بن عیینہ نے بیان کیا ‘ ان سے منصور بن صفیہ نے ‘ ان سے کی والدہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ",
        "hadithText": "ایک خاتون نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا ( دوسری سند ) امام بخاری نے کہا اور ہم سے محمد نے بیان کیا یعنی ابن عقبہ نے ‘ کہا ہم سے فضیل بن سلیمان النمیری نے بیان کیا ‘ کہا ہم سے منصور بن عبدالرحمٰن بن شیبہ نے بیان کیا ‘ ان سے ان کی والدہ نے اور ان سے عائشہ رضی اللہ عنہا نے کہ ایک عورت نے رسول کریم صلی اللہ علیہ وسلم سے حیض کے متعلق پوچھا کہ اس سے غسل کس طرح کیا جائے ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مشک لگا ہوا ایک کپڑا لے کر اس سے پاکی حاصل کر ۔ اس عورت نے پوچھا ‘ یا رسول اللہ ! میں اس سے پاکی کس طرح حاصل کروں گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اس سے پاکی حاصل کرو ۔ انہوں نے پھر پوچھا کہ کس طرح پاکی حاصل کروں ؟ آنحضرت صلی اللہ علیہ وسلم نے پھر وہی جواب دیا کہ پاکی حاصل کرو ۔ عائشہ رضی اللہ عنہا نے بیان کیا کہ میں آنحضرت صلی اللہ علیہ وسلم کا منشا سمجھ گئی اور اس عورت کو میں نے اپنی طرف کھینچ لیا اور انہیں طریقہ بتایا کہ پاکی سے آپ کا مطلب یہ ہے کہ اس کپڑے کو خون کے مقاموں پر پھیرتاکہ خون کی بدبو رفع ہو جائے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 84,
        "matchingArabicURN": 164750,
        "last_updated": null
    },
    {
        "urduURN": 4072470,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7358,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ کہا ہم سے ابو عوانہ نے بیان کیا ‘ ان سے ابو بشر نے ‘ ان سے سعید بن جبیر نے اور ان سے ابن عباس رضی اللہ عنہما نے کہ",
        "hadithText": "ام حفید بنت حارث بن حزن نے رسول اللہ صلی اللہ علیہ وسلم کو گھی اور پنیر اور بھنا ہوا سانڈا ہدیہ میں بھیجاآنحضرت صلی اللہ علیہ وسلم نے یہ چیزیں قبول فرما لیں اور آپ کے دسترخوان پر انہیں کھایا گیا لیکن آنحضرت صلی اللہ علیہ وسلم نے اس ( سانڈے کو ) ہاتھ نہیں لگا یا ‘ جیسے آپ کو پسند نہ ہو اور اگر وہ حرام ہوتا تو آپ کے دسترخوان پر نہ کھایا جاتا اور نہ آپ کھانے کے لیے کہتے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 85,
        "matchingArabicURN": 164760,
        "last_updated": null
    },
    {
        "urduURN": 4072480,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7359,
        "hadithSanad": "ہم سے احمد بن صالح نے بیان کیا ‘ کہا ہم سے عبداللہ بن وہب نے بیان کیا ‘ کہا مجھے یونس نے خبر دی ‘ انہیں ابن شہاب نے کہا کہ مجھ کو عطاء بن ابی رباح نے خبر دی ‘ انہیں جابر بن عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص کچی لہسن یا پیاز کھائے وہ ہم سے دور رہے یا ( یہ فرمایا کہ ) ہماری مسجد سے دور رہے اور اپنے گھر میں بیٹھا رہے ( یہاں تک کہ وہ بو رفع ہو جائے ) اور آپ کے پاس ایک طباق لایا گیا جس میں سبزیاں تھیں ۔ آنحضرت صلی اللہ علیہ وسلم نے اس میں بو محسوس کی ‘ پھر آپ کو اس میں رکھی ہوئی سبزیوں کے متلعق بتایا گیا تو آپ نے اپنے بعض صحابی کی طرف جو آپ کے ساتھ تھے اشارہ کر کے فرمایا کہ ان کے پاس لے جاؤ لیکن جب ان صحابی نے اسے دیکھا تو انہوں نے بھی اسے کھانا پسند نہیں کیا ۔ آنحضرت صلی اللہ علیہ وسلم نے اس پر ان سے فرمایا کہ تم کھا لو کیونکہ میں جس سے سرگوشی کرتا ہوں تم اس سے نہیں کرتے ۔ ( آپ کی مراد فرشتوں سے تھی ) سعید بن کثیر بن عفیر نے جو حضرت امام بخاری رحمہ اللہ کے شیخ ہیں ‘ عبداللہ بن وہب سے اس حدیث میں یوں روایت کیا کہ آنحضرت صلی اللہ علیہ وسلم کے پاس ہانڈی لائی گئی جس میں ترکاریاں تھیں اور لیث وابوصفوان عبداللہ بن سعید اموی نے بھی اس حدیث کو یو نس سے روایت کیا لیکن انہوں نے ہانڈی کا قصہ نہیں بیان کیا ‘ اب میں نہیں جانتا کہ ہانڈی کا قصہ حدیث میں داخل ہے یا زہری نے بڑھا دیا ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 86,
        "matchingArabicURN": 164770,
        "last_updated": null
    },
    {
        "urduURN": 4072490,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7360,
        "hadithSanad": "مجھ سے عبیداللہ بن سعد بن ابراہیم نے بیان کیا ‘ کہا مجھ سے میرے والد اور چچا نے بیان کیا ‘ کہا کہ مجھ سے میرے والد نے بیان کیا اور ان سے ان کے والد نے ‘ انہیں محمد بن جبیر نے خبر دی اور انہیں ان کے والد جبیر بن مطعم رضی اللہ عنہ نے خبر دی کہ",
        "hadithText": "ایک خاتون رسول کریم صلی اللہ علیہ وسلم کے پاس آئیں تو آنحضرت صلی اللہ علیہ وسلم نے انہیں ایک حکم دیا ۔ انہوں نے عرض کیا ‘ یا رسول اللہ ! اگر میں آپ کو نہ پاؤں تو پھر کیا کروں گی ؟ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ جب مجھے نہ پا نا تو ابوبکر رضی اللہ عنہ کے پاس جانا ۔ حمیدی نے ابراہیم بن سعد سے یہ اضافہ کیا کہ غالباً خاتون کی مراد وفات تھی ۔ امام بخاری نے کہا کہ حمیدی نے اس روایت میں ابراہیم بن سعد سے اتنا بڑھایا ہے کہ آپ کو نہ پاؤں ‘ اس سے مراد یہ ہے کہ آپ کی وفات ہو جائے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 87,
        "matchingArabicURN": 164780,
        "last_updated": null
    },
    {
        "urduURN": 4072500,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7361,
        "hadithSanad": "ابو الیمان امام بخاری کے شیخ نے بیان کیا کہ ہم کو شعیب نے خبر دی ‘ انہیں زہری نے ‘ انہیں حمید بن عبدالرحمٰن نے خبر دی ‘ انہوں نے معاویہ رضی اللہ عنہ سے سنا",
        "hadithText": "وہ مدینے میں قریش کی ایک جماعت سے حدیث بیان کر رہے تھے ۔ معاویہ رضی اللہ عنہ نے کعب احبار کا ذکر کیا اور فرمایا جتنے لوگ اہل کتاب سے احادیث نقل کرتے ہیں ان سب میں کعب احبار بہت سچے تھے اور باوجود اس کے کبھی کبھی ان کی بات جھوٹ نکلتی تھی ۔ یہ مطلب نہیں ہے کہ کعب احبار جھوٹ بولتے تھے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 88,
        "matchingArabicURN": 164790,
        "last_updated": null
    },
    {
        "urduURN": 4072510,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7362,
        "hadithSanad": "مجھ سے محمد بن بشار نے بیان کیا ‘ انہوں نے کہا ہم سے عثمان بن عمر نے بیان کیا ‘ انہوں نے کہا ہم کوعلی بن المبارک نے خبر دی ‘ انہوں نے کہا ہم سے یحییٰ بن ابی کثیر نے ‘ انہیں ابوسلمہ نے اور ان سے ابوہریرہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "اہل کتاب توریت عبرانی زبان میں پڑھتے تھے اور اس کی تفسیر مسلمانوں کے لیے عربی میں کرتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اہل کتاب کی نہ تصدیق کرو اور نہ ان کی تکذیب کرو کیونکہ ہم ایمان لائے اللہ پر اور اس پر جو ہم پر نازل ہو ااور جو ہم سے پہلے تم پر ناز ل ہوا آخر آیت تک جو سورۃ البقرہ میں ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 89,
        "matchingArabicURN": 164800,
        "last_updated": null
    },
    {
        "urduURN": 4072520,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7363,
        "hadithSanad": "ہم سے موسیٰ بن اسماعیل نے بیان کیا ‘ انہوں نے کہا ہم سے ابراہیم بن سعد نے بیان کیا ‘ انہوں نے کہا ہم کو ابن شہاب نے خبر دی ‘ انہیں عبیداللہ بن عبداللہ بن عتبہ نے اور ان سے حضرت عبداللہ بن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "تم اہل کتاب سے کسی چیز کے بارے میں کیوں پوچھتے ہو جب کہ تمہاری کتاب جو رسول اللہ صلی اللہ علیہ وسلم پر نازل ہوئی وہ تازہ بھی ہے اور محفوظ بھی اور تمہیں اس نے بتا بھی دیا کہ اہل کتاب نے اپنا دین بدل ڈالا اور اللہ کی کتاب میں تبدیلی کر دی اور اسے اپنے ہاتھ سے از خود بنا کر لکھا اور کہا کہ یہ اللہ کی طرف سے ہے تاکہ اس کے ذریعہ دنیا کا تھوڑا سا مال کما لیں ۔ تمہارے پاس ( قرآن و حدیث کا ) جو علم ہے وہ تمہیں ان سے پوچھنے سے منع کرتا ہے ۔ واللہ ! میں تو نہیں دیکھتا کہ اہل کتاب میں سے کوئی تم سے اس کے بارے میں پوچھتا ہو جو تم پر نازل کیا گیا ہو ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 90,
        "matchingArabicURN": 164810,
        "last_updated": null
    },
    {
        "urduURN": 4072530,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7364,
        "hadithSanad": "ہم سے اسحاق نے بیان کیا ‘ انہوں نے کہا ہم کو عبدالرحمٰن بن مہدی نے خبر دی ‘ انہیں سلام بن ابی مطیع نے ‘ انہیں ابو عمران الجونی نے ‘ ان سے جندب بن عبداللہ رضی اللہ عنہ نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ‘ جب تمہارے دل ملے رہیں قرآن پڑھو اور جب تم میں اختلاف ہو جائے تو اس سے دور ہو جاؤ ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 91,
        "matchingArabicURN": 164820,
        "last_updated": null
    },
    {
        "urduURN": 4072540,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7365,
        "hadithSanad": "ہم سے اسحاق بن منصور نے بیان کیا ‘ انہوں نے کہا ہم کو عبدالصمد بن عبدالوارث نے خبر دی ‘ کہا ہم سے ہمام بن یحییٰ بصریٰ نے بیان کیا ‘ کہا ہم سے ابو عمران جونی نے اور ان سے جندب بن عبداللہ رضی اللہ عنہ نے کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب تک تمہارے دلوں میں اتحاد واتفاق ہو قرآن پڑھو اور جب اختلاف ہو جائے تو اس سے دور ہو جاؤ اور یزید بن ہارون واسطی نے ہارون اعور سے بیان کیا ‘ ان سے ابو عمران نے بیان کیا ‘ ان سے جندب رضی اللہ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے بیان کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 92,
        "matchingArabicURN": 164831,
        "last_updated": null
    },
    {
        "urduURN": 4072550,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7366,
        "hadithSanad": "ہم سے ابراہیم بن موسیٰ نے بیان کیا ‘ کہا ہم کو ہشام نے خبر دی ‘ انہیں معمر نے ‘ انہیں زہری نے ‘ انہیں عبیداللہ بن عبداللہ نے اور ان سے ابن عباس رضی اللہ عنہما نے بیان کیا کہ",
        "hadithText": "جب آنحضرت صلی اللہ علیہ وسلم کی وفات کا وقت قریب آیا تو گھر میں بہت سے صحابہ موجود تھے ، جن میں عمر بن خطاب رضی اللہ عنہ بھی تھے اس وقت آپ نے فرمایا کہ آؤ میں تمہارے لیے ایک ایسا مکتوب لکھ دوں کہ اس کے بعد تم کبھی گمراہ نہ ہو ۔ عمر رضی اللہ عنہ نے کہا کہ اس وقت آپ نے فرمایا کہ آؤ میں تمہارے لیے ایک ایسا مکتوب لکھ دوں کہ اس کے بعد تم کبھی گمراہ نہ ہو ۔ عمر رضی اللہ عنہ نے کہا آنحضرت صلی اللہ علیہ وسلم تکلیف میں مبتلا ہیں ‘ تمہارے پاس اللہ کی کتاب ہے اور یہی ہمارے لیے کافی ہے ۔ گھر کے لوگوں میں بھی اختلاف ہو گیا اور آپس میں بحث کرنے لگے ۔ ان میں سے بعض نے کہا کہ آنحضرت صلی اللہ علیہ وسلم کے قریب ( لکھنے کا سامان ) کر دو ۔ وہ تمہارے لیے ایسی چیز لکھ دیں گے کہ اس کے بعد تم گمراہ نہیں ہو گے اور بعض نہ وہی بات کہی جو عمر رضی اللہ عنہ کہہ چکے تھے ۔ جب آنحضرت صلی اللہ علیہ وسلم کے پاس لوگ اختلاف وبحث زیادہ کرنے لگے تو آپ نے فرمایا کہ میرے پاس سے ہٹ جاؤ ۔ عبیداللہ رضی اللہ عنہ نے بیان کیا کہ ابن عباس رضی اللہ عنہما کہا کرتے تھے کہ سب سے بھاری مصیبت تو وہ تھے جو رسول کریم صلی اللہ علیہ وسلم اور اس نوشت لکھوانے کے درمیان حائل ہوئے ‘ یعنی جھگڑا اور شور ۔ ( والخیر فیما وقع ) ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 93,
        "matchingArabicURN": 164850,
        "last_updated": null
    },
    {
        "urduURN": 4072560,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7367,
        "hadithSanad": "ہم سے مکی بن ابراہیم نے بیان کیا ‘ ان سے ابن جریج نے بیان کیا ‘ ان سے عطاء نے بیان کیا ‘ ان سے جابر رضی اللہ عنہ نے ( دوسری سند ) حضرت امام ابوعبداللہ بخاری نے کہا کہ محمد بن بکر برقی نے بیان کیا ‘ان سے ابن جریج نے بیان کیا ‘ کہا کہ مجھے عطاء نے خبر دی ‘ انہوں نے جابر رضی اللہ عنہ سے سنا ‘ اس وقت اور لوگ بھی ان کے ساتھ تھے ‘ انہوں نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم کے صحابہ نے آنحضرت صلی اللہ علیہ وسلم کے ساتھ خالص حج کا احرام باندھا اس کے ساتھ عمرہ کا نہیں باندھا ۔ عطاء نے بیان کیا کہ جابر رضی اللہ عنہ نے کہا کہ پھر آنحضرت صلی اللہ علیہ وسلم ۴ذی الحجہ کی صبح کو آئے اور جب ہم بھی حاضر ہوئے تو آپ نے ہمیں حکم دیا کہ ہم حلال ہو جائیں اور آپ نے فرمایا کہ حلا ل ہو جاؤ اور اپنی بیویوں کے پاس جاؤ ۔ عطاء نے بیان کیا اور ان سے جابر رضی اللہ عنہ نے کہ ان پر یہ ضروری نہیں قرار دیا بلکہ صرف حلال کیا ‘پھر آنحضرت صلی اللہ علیہ وسلم کو معلوم ہوا کہ ہم میں یہ بات ہو رہی ہے کہ عرفہ پہنچنے میں صرف پانچ دن رہ گئے ہیں اور پھر بھی آنحضرت صلی اللہ علیہ وسلم نے ہمیں اپنی عورتوں کے پاس جانے کا حکم دیا ہے ‘ کیا ہم عرفات اس حالت میں جائیں کہ مذی یا منی ہمارے ذکر سے ٹپک رہی ہو ۔ عطاء نے کہا کہ جابر رضی اللہ عنہ نے اپنے ہاتھ سے اشارہ کیا کہ اس طرح مذی ٹپک رہی ہو ‘ اس کو ہلا یا ۔ پھر آنحضرت صلی اللہ علیہ وسلم کھڑے ہوئے اور فرمایا ‘ تمہیں معلوم ہے کہ میں تم میں اللہ سے سب سے زیادہ ڈرنے والا ہوں ‘ تم میں سب سے زیادہ سچا ہوں اور سب سے زیادہ نیک ہوں اور اگر میرے پاس ہدی ( قربانی کا جانور ) نہ ہوتا تو میں بھی حلال ہو جاتا ‘ پس تم بھی حلال ہو جاؤ ۔ اگر مجھے وہ بات پہلے سے معلوم ہو جاتی جو بعد میں معلوم ہوئی تو میں قربانی کا جانور ساتھ نہ لاتا ۔ چنانچہ ہم حلال ہو گئے اور ہم نے آنحضرت صلی اللہ علیہ وسلم کی بات سنی اور آپ کی اطاعت کی ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 94,
        "matchingArabicURN": 164860,
        "last_updated": null
    },
    {
        "urduURN": 4072570,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7368,
        "hadithSanad": "ہم سے ابو معمر نے بیان کیا ‘ کہا ہم سے عبدالوارث بن سعید نے بیان کیا ‘ ان سے حسین بن ذکوان معلم نے ‘ ان سے عبیداللہ بن بریدہ نے ‘ کہا مجھ سے عبداللہ بن مغفل مزنی نے بیان کیا",
        "hadithText": "اور ان سے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مغرب کی نماز سے پہلے بھی نماز پڑھو اور تیسری مرتبہ میں فرمایا کہ جس کا جی چاہے کیونکہ آپ پسند نہیں کرتے تھے کہ اسے لوگ لازمی سنت بنا لیں ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 95,
        "matchingArabicURN": 164870,
        "last_updated": null
    },
    {
        "urduURN": 4072580,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7369,
        "hadithSanad": "ہم سے عبد العزیز بن عبداللہ اویسی نے بیان کیا ‘ کہا ہم سے ابراہیم بن سعد نے ‘ ان سے صالح بن کیسان نے ‘ ان سے ابن شہاب نے ‘ کہا کہ",
        "hadithText": "مجھ سے عروہ بن مسیب اور علقمہ بن وقاص اور عبیداللہ بن عبداللہ نے بیان کیا اور ان سے عائشہ رضی اللہ عنہا نے کہ جب تہمت لگا نے والوں نے ان پر تہمت لگائی تھی اور رسول اللہ صلی اللہ علیہ وسلم نے علی بن ابی طالب ‘ اسامہ بن زید رضی اللہ عنہ کو بلایا کیونکہ اس معاملہ میں وحی اس وقت تک نہیں آئی تھی اور آنحضرت صلی اللہ علیہ وسلم اپنی اہل خانہ کو جدا کرنے کے سلسلہ میں ان سے مشورہ لینا چاہتے تھے تو اسامہ رضی اللہ عنہ نے وہی مشورہ دیا جو انہیں معلوم تھا یعنی آنحضرت صلی اللہ علیہ وسلم کی اہل خانہ کی برات کا لیکن علی رضی اللہ عنہ نے کہا کہ اللہ تعالیٰ نے آپ پر کوئی پابندی تو عائد نہیں کی ہے اور اس کے سوا اور بہت سی عورتیں ہیں ‘ باندی سے آپ دریافت فر ما لیں ‘ وہ آپ سے صحیح بات بتادے گی ۔ چنانچہ آنحضرت صلی اللہ علیہ وسلم نے پوچھا کہ کیا تم نے کوئی ایسی بات دیکھی ہے جس سے شبہ ہوتا ہے ۔ انہوں نے کہا کہ میں نے اس کے سوا اور کچھ نہیں دیکھا کہ وہ کم عمر لڑکی ہیں ‘ آٹا گوندھ کر بھی سو جاتی ہیں اور پڑوس کی بکری آ کر اسے کھا جاتی ہے ( یعنی کم عمری کی وجہ سے مزاج میں بے پروائی ہے ) اس کے بعد آنحضرت صلی اللہ علیہ وسلم منبر پر کھڑے ہوئے اور فرمایا ‘ اے مسلمانو ! میرے معاملے میں اس سے کون نمٹے گا جس کی اذیتیں اب میرے اہل خانہ تک پہنچ گئی ہیں ۔ اللہ کی قسم ! میں نے ان کے بارے میں بھلائی کے سوا اور کچھ نہیں جانا ہے ۔ پھر آپ نے عائشہ رضی اللہ عنہا کی پاک دامنی کاقصہ بیان کیا اور ابواسامہ نے ہشام بن عروہ سے بیان کیا ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 96,
        "matchingArabicURN": 164880,
        "last_updated": null
    },
    {
        "urduURN": 4072590,
        "collection": "bukhari",
        "volumeNumber": 0,
        "bookNumber": 96,
        "bookName": "a",
        "babNumber": null,
        "babName": null,
        "hadithNumber": 7370,
        "hadithSanad": "ہم سے محمد بن حرب نے بیان کیا ‘ کہا ہم سے یحییٰ بن زکریا نے بیان کیا ‘ ان سے ہشام بن عروہ نے ‘ ان سے عروہ اور ان سے عائشہ رضی اللہ عنہا نے بیان کیا کہ",
        "hadithText": "رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطاب کیا اور اللہ کی حمد و ثنا کے بعد فرمایا ‘ تم مجھے ان لوگوں کے بارے میں مشورہ دیتے ہو جو میرے اہل خانہ کو بد نام کرتے ہیں حالانکہ ان کے بارے میں مجھے کوئی بری بات کبھی نہیں معلوم ہوئی ۔ عروہ سے روایت ہے ‘ انہوں نے ہم سے بیان کیا کہ عائشہ رضی اللہ عنہا کو جب اس واقعہ کا علم ہوا ( کہ کچھ لوگ انہیں بد نام کر رہے ہیں ) تو انہوں نے آنحضرت صلی اللہ علیہ وسلم سے کہا یا رسول اللہ ! کیا مجھے آپ اپنے والد کے گھر جانے کی اجازت دیں گے ؟ آنحضرت صلی اللہ علیہ وسلم نے انہیں اجازت دی اور ان کے ساتھ غلام کو بھیجا ۔ انصار میں سے ایک صاحب ابوایوب رضی اللہ عنہ نے کہا سبحانک مایکون لنا ان نتکلم بھذا سبحانک ھذا بھتان عظیم تیری ذات پاک ہے اے اللہ ! ہمارے لیے مناسب نہیں کہ ہم اس طرح کی باتیں کریں تیری ذات پاک ہے ‘یہ تو بہت بڑا بہتان ہے ۔</b>",
        "bookID": "96.0",
        "grade": "",
        "comments": "",
        "ourHadithNumber": 97,
        "matchingArabicURN": 164890,
        "last_updated": null
    }
]