[
    {
        "arabicURN": 5635550,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3555",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ: أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا: اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَقَالَ الْآخَرُ: أَجَلْ يَا رَسُولَ اللَّهِ فاقْضِ بَيْننَا بكتابِ الله وائذَنْ لِي أَنْ أَتَكَلَّمَ قَالَ: «تَكَلَّمْ» قَالَ: إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبرُونِي أنَّ على ابْني الرَّجْم فاقتديت مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَأَمَّا أَنْتَ يَا أُنَيْسُ فَاغْدُ إِلَى امْرَأَةِ هَذَا فَإِن اعْترفت فارجمها» فَاعْترفت فرجمها",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 1,
        "matchingEnglishURN": 5860010,
        "last_updated": null
    },
    {
        "arabicURN": 5635560,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3556",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ فِيمَنْ زَنَى وَلَمْ يُحْصَنْ جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 2,
        "matchingEnglishURN": 5860020,
        "last_updated": null
    },
    {
        "arabicURN": 5635570,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3557",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِن الله بعث مُحَمَّدًا وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أَنْزَلَ اللَّهُ تَعَالَى آيَةُ الرَّجْمِ رَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كانَ الحَبَلُ أَو الِاعْتِرَاف",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 3,
        "matchingEnglishURN": 5860030,
        "last_updated": null
    },
    {
        "arabicURN": 5635580,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3558",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا: الْبِكْرُ بالبكر جلد مائَة ووتغريب عَام وَالثَّيِّب بِالثَّيِّبِ جلد مائَة وَالرَّجم \"",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 4,
        "matchingEnglishURN": 5860040,
        "last_updated": null
    },
    {
        "arabicURN": 5635590,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3559",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَن الْيَهُود جاؤوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ أَنَّ رَجُلًا مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ؟» قَالُوا: نَفْضَحُهُمْ وَيُجْلَدُونَ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ فَأْتُوا بِالتَّوْرَاةِ فَنَشَرُوهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ فَقَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: ارْفَعْ يَدَكَ فَرَفَعَ فإِذا فِيهَا آيةُ الرَّجم. فَقَالُوا: صدقَ يَا محمَّدُ فِيهَا آيَة الرَّجْم. فَأمر بهما النَّبِي صلى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَا. وَفِي رِوَايَةٍ: قَالَ: ارْفَعْ يَدَكَ فَرَفَعَ فَإِذَا فِيهَا آيَةُ الرَّجْمِ تَلُوحُ فَقَالَ: يَا مُحَمَّدُ إِنَّ فِيهَا آيَةَ الرَّجْمِ وَلِكِنَّا نَتَكَاتَمُهُ بَيْنَنَا فَأَمَرَ بِهِمَا فَرُجِمَا",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 5,
        "matchingEnglishURN": 5860050,
        "last_updated": null
    },
    {
        "arabicURN": 5635600,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3560",
        "bookName": "كتاب الحدود",
        "babName": "باب",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ وَهُوَ فِي الْمَسْجِدِ فَنَادَاهُ: يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ: إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا شَهِدَ أَرْبَعَ شَهَادَاتٍ دَعَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَبِكَ جُنُونٌ؟» قَالَ: لَا فَقَالَ: «أُحْصِنْتَ؟» قَالَ: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: «اذْهَبُوا بِهِ فَارْجُمُوهُ» قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ: فَرَجَمْنَاهُ بِالْمَدِينَةِ فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ فرجمناه حَتَّى مَاتَ\nوَفِي رِوَايَةٍ لِلْبُخَارِيِّ: عَنْ جَابِرٍ بَعْدَ قَوْلِهِ: قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خيرا وَصلى عَلَيْهِ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 6,
        "matchingEnglishURN": 5860060,
        "last_updated": null
    },
    {
        "arabicURN": 5635610,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3561",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا أَتَى مَاعِزُ بن مَالك النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ: «لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ؟» قَالَ: لَا يَا رَسُولَ اللَّهِ قَالَ: «أَنِكْتَهَا؟» لَا يُكَنِّي قَالَ: نَعَمْ فَعِنْدَ ذَلِكَ أَمر رجمه. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 7,
        "matchingEnglishURN": 5860071,
        "last_updated": null
    },
    {
        "arabicURN": 5635620,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3562",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ بُرَيْدَةَ قَالَ: جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيْحَكَ ارْجِعْ فَاسْتَغْفر الله وَتب إِلَيْهِ» . فَقَالَ: فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي. فَقَالَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَة قَالَه لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِيمَ أُطَهِّرُكَ؟» قَالَ: مِنَ الزِّنَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبِهِ جُنُونٌ؟» فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ فَقَالَ: «أَشَرِبَ خَمْرًا؟» فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ فَقَالَ: «أَزَنَيْتَ؟» قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ فَلَبِثُوا يَوْمَيْنِ أَوْ ثَلَاثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ لَقَدْ تَابَ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ» ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الْأَزْدِ فَقَالَتْ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيَحَكِ ارْجِعِي فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ» فَقَالَتْ: تُرِيدُ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ: إِنَّهَا حُبْلَى مِنَ الزِّنَا فَقَالَ: «أَنْتِ؟» قَالَتْ: نَعَمْ قَالَ لَهَا: «حَتَّى تَضَعِي مَا فِي بَطْنِكِ» قَالَ: فكَفَلَها رَجُلٌ مِنَ الْأَنْصَارِ حَتَّى وَضَعَتْ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: قَدْ وَضَعَتِ الغامديَّةُ فَقَالَ: «إِذاً لَا نرجُمها وندعُ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ» فَقَامَ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ: إِلَيَّ رَضَاعُهُ يَا نَبِيَّ اللَّهِ قَالَ: فَرَجَمَهَا. وَفِي رِوَايَةٍ: أَنَّهُ قَالَ لَهَا: «اذْهَبِي حَتَّى تَلِدِي» فَلَمَّا وَلَدَتْ قَالَ: «اذْهَبِي فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ» فَلَمَّا فَطَمَتْهُ أَتَتْهُ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ: هَذَا يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ وَقَدْ أَكَلَ الطَّعَامَ فَدَفَعَ الصَّبِيَّ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ ثُمَّ أَمَرَ بِهَا فَحُفِرَ لَهَا إِلَى صَدْرِهَا وَأَمَرَ النَّاسَ فَرَجَمُوهَا فَيُقْبِلُ خَالِدُ بْنُ الْوَلِيدِ بِحَجْرٍ فَرَمَى رَأْسَهَا فَتَنَضَّحَ الدَّمُ عَلَى وَجْهِ خَالِدٍ فَسَبَّهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مهلا يَا خَالِد فو الَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ» ثُمَّ أَمَرَ بِهَا فصلى عَلَيْهَا ودفنت. رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 8,
        "matchingEnglishURN": 5860073,
        "last_updated": null
    },
    {
        "arabicURN": 5635630,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3563",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الحدَّ وَلَا يُثَرِّبْ عَلَيْهَا ثمَّ إِنْ زنَتْ فلْيجلدْها الحدَّ وَلَا يُثَرِّبْ ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا ولوْ بحبْلٍ منْ شعرٍ»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 9,
        "matchingEnglishURN": 5860074,
        "last_updated": null
    },
    {
        "arabicURN": 5635640,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.10",
        "hadithNumber": "3564",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا أَيُّهَا النَّاسُ أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ مَنْ أُحْصِنَ مِنْهُمْ وَمَنْ لَمْ يُحْصَنْ فَإِنَّ أَمَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَنَتْ فَأَمَرَنِي أَنْ أَجْلِدَهَا فَإِذَا هِيَ حَدِيثُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحْسَنْتَ» . رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «دَعْهَا حَتَّى يَنْقَطِعَ دَمُهَا ثُمَّ أَقِمْ عَلَيْهَا الْحَدَّ وَأَقِيمُوا الْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانكُم»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 10,
        "matchingEnglishURN": 5860081,
        "last_updated": null
    },
    {
        "arabicURN": 5635650,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3565",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ مَاعِزٌ الْأَسْلَمِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّه قدْ زَنى فأعرضَ عَنهُ ثمَّ جَاءَ مِنْ شِقِّهِ الْآخَرِ فَقَالَ: إِنَّهُ قَدْ زنى فَأَعْرض عَنهُ ثمَّ جَاءَ من شقَّه الْآخَرِ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ زَنى فَأَمَرَ بِهِ فِي الرَّابِعَةِ فَأُخْرِجَ إِلَى الْحَرَّةِ فَرُجِمَ بِالْحِجَارَةِ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ فَرَّ يَشْتَدُّ حَتَّى مَرَّ بِرَجُلٍ مَعَهُ لَحْيُ جَمَلٍ فَضَرَبَهُ بِهِ وَضَرَبَهُ النَّاسُ حَتَّى مَاتَ. فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنه فرحين وَجَدَ مَسَّ الْحِجَارَةِ وَمَسَّ الْمَوْتِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَّا تَرَكْتُمُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّه أَن يَتُوب الله عَلَيْهِ»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 11,
        "matchingEnglishURN": 5860100,
        "last_updated": null
    },
    {
        "arabicURN": 5635660,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3566",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِمَاعِزِ بْنِ مَالِكٍ: «أَحَقٌّ مَا بَلَغَنِي عَنْكَ؟» قَالَ: وَمَا بَلَغَكَ عَنِّي؟ قَالَ: «بَلَغَنِي أَنَّكَ قَدْ وَقَعْتَ عَلَى جَارِيَةِ آلِ فُلَانٍ» قَالَ: نَعَمْ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ فَأمر بهِ فرجم. رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 12,
        "matchingEnglishURN": 5860110,
        "last_updated": null
    },
    {
        "arabicURN": 5635670,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3567",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ أَبِيهِ أَنَّ مَاعِزًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ عِنْدَهُ أَرْبَعَ مَرَّاتٍ فَأَمَرَ بِرَجْمِهِ وَقَالَ لِهَزَّالٍ: «لَوْ سَتَرْتَهُ بِثَوْبِكَ كَانَ خَيْرًا لَكَ» قَالَ ابْنُ الْمُنْكَدِرِ: إِنَّ هَزَّالًا أَمَرَ مَاعِزًا أَنْ يَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فيخبره. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 13,
        "matchingEnglishURN": 5860120,
        "last_updated": null
    },
    {
        "arabicURN": 5635680,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3568",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَعَافَوُا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 14,
        "matchingEnglishURN": 5860130,
        "last_updated": null
    },
    {
        "arabicURN": 5635690,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3569",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أقيلوا ذَوي الهيآت عثراتهم إِلَّا الْحُدُود» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 15,
        "matchingEnglishURN": 5860140,
        "last_updated": null
    },
    {
        "arabicURN": 5635700,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3570",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «ادرؤا الْحُدُودَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: قَدْ رُوِيَ عَنْهَا وَلم يرفع وَهُوَ أصح",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 16,
        "matchingEnglishURN": 5860150,
        "last_updated": null
    },
    {
        "arabicURN": 5635710,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3571",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ وَائِلِ بْنِ حُجْرٍ قَالَ: اسْتُكْرِهَتِ امْرَأَةٌ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَرَأَ عَنْهَا الْحَدَّ وَأَقَامَهُ عَلَى الَّذِي أَصَابَهَا وَلَمْ يُذْكَرْ أَنَّهُ جَعَلَ لَهَا مَهْرًا. رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 17,
        "matchingEnglishURN": 5860160,
        "last_updated": null
    },
    {
        "arabicURN": 5635720,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3572",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْهُ: أَنَّ امْرَأَةً خَرَجَتْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدُ الصَّلَاةَ فَتَلَقَّاهَا رَجُلٌ فَتَجَلَّلَهَا فَقَضَى حَاجَتَهُ مِنْهَا فَصَاحَتْ وَانْطَلَقَ وَمَرَّتْ عِصَابَةٌ مِنَ الْمُهَاجِرِينَ فَقَالَتْ: إِنَّ ذَلِكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا فَأَخَذُوا الرَّجُلَ فَأَتَوْا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا: «اذْهَبِي فَقَدْ غَفَرَ اللَّهُ لَكِ» وَقَالَ لِلرَّجُلِ الَّذِي وَقَعَ عَلَيْهَا: «ارْجُمُوهُ» وَقَالَ: «لَقَدْ تَابَ تَوْبَةً لَوْ تَابَهَا أَهْلُ الْمَدِينَةِ لَقُبِلَ مِنْهُمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 18,
        "matchingEnglishURN": 5860170,
        "last_updated": null
    },
    {
        "arabicURN": 5635730,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3573",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ: أَنَّ رَجُلًا زَنَى بِامْرَأَةٍ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجُلِدَ الْحَدَّ ثُمَّ أُخْبِرَ أَنَّهُ مُحْصَنٌ فَأَمَرَ بِهِ فرجم. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 19,
        "matchingEnglishURN": 5860180,
        "last_updated": null
    },
    {
        "arabicURN": 5635740,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3574",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ أَنَّ سَعْدَ بْنَ عُبَادَةَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ كَانَ فِي الْحَيِّ مُخْدَجٍ سقيم فَوجدَ على أمة من إمَائِهِمْ بخبث بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُذُوا لَهُ عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ فَاضْرِبُوهُ ضَرْبَة» . رَوَاهُ فِي شَرْحِ السُّنَّةِ وَفِي رِوَايَةِ ابْنِ مَاجَه نَحوه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 20,
        "matchingEnglishURN": 5860190,
        "last_updated": null
    },
    {
        "arabicURN": 5635750,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3575",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُول بِهِ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 21,
        "matchingEnglishURN": 5860200,
        "last_updated": null
    },
    {
        "arabicURN": 5635760,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3576",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ وَاقْتُلُوهَا مَعَهُ» . قِيلَ لِابْنِ عَبَّاسٍ: مَا شَأْنُ الْبَهِيمَةِ؟ قَالَ: مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئا وَلَكِن أره كَرِهَ أَنْ يُؤْكَلَ لَحْمُهَا أَوْ يُنْتَفَعَ بِهَا وَقَدْ فُعِلَ بِهَا ذَلِكَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 22,
        "matchingEnglishURN": 5860210,
        "last_updated": null
    },
    {
        "arabicURN": 5635770,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3577",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 23,
        "matchingEnglishURN": 5860220,
        "last_updated": null
    },
    {
        "arabicURN": 5635780,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3578",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مِنْ بَنِي بَكْرِ بْنِ لَيْثٍ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ أَنَّهُ زَنَى بِامْرَأَةٍ أَرْبَعَ مَرَّاتٍ فَجَلَدَهُ مِائَةً وَكَانَ بِكْرًا ثُمَّ سَأَلَهُ الْبَيِّنَةَ عَلَى الْمَرْأَةِ فَقَالَتْ: كَذَبَ وَاللَّهِ يَا رَسُولَ اللَّهِ فَجُلِدَ حَدَّ الْفِرْيَةِ. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 24,
        "matchingEnglishURN": 5860230,
        "last_updated": null
    },
    {
        "arabicURN": 5635790,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.20",
        "hadithNumber": "3579",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَائِشَةَ قَالَتْ: لَمَّا نَزَلَ عُذْرِي قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَذَكَرَ ذَلِكَ فَلَمَّا نَزَلَ مِنَ الْمِنْبَرِ أَمَرَ بِالرَّجُلَيْنِ وَالْمَرْأَةِ فَضُرِبُوا حَدَّهُمْ. رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 25,
        "matchingEnglishURN": 5860240,
        "last_updated": null
    },
    {
        "arabicURN": 5635800,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3580",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "عَنْ نَافِعٍ: أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ أَخْبَرَتْهُ أَنَّ عَبْدًا مِنْ رَقِيقِ الْإِمَارَةِ وَقَعَ على وليدةٍ من الخُمسِ فاستَكرهَها حَتَّى افتضَّها فَجَلَدَهُ عُمَرُ وَلَمْ يَجْلِدْهَا مِنْ أَجْلِ أَنَّهُ استكرهها. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 26,
        "matchingEnglishURN": 5860250,
        "last_updated": null
    },
    {
        "arabicURN": 5635810,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3581",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْ يَزِيدَ بْنِ نُعَيْمِ بْنِ هَزَّالٍ عَنْ أَبِيهِ قَالَ: كَانَ مَاعِزُ بْنُ مَالِكٍ يَتِيمًا فِي حِجْرِ أَبِي فَأَصَابَ جَارِيَةً مِنَ الْحَيِّ فَقَالَ لَهُ أَبِي: ائْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِمَا صَنَعْتَ لَعَلَّهُ يَسْتَغْفِرُ لَكَ وَإِنَّمَا يُرِيدُ بِذَلِكَ رَجَاءَ أَنْ يَكُونَ لَهُ مَخْرَجًا فَآتَاهُ فَقَالَ: يَا رَسُولَ اللَّهِ إِني زنيتُ فأقِمْ عليَّ كتابَ اللَّهِ حَتَّى قَالَهَا أَرْبَعَ مَرَّاتٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّكَ قَدْ قُلْتَهَا أَرْبَعَ مَرَّاتٍ فَبِمَنْ؟ \" قَالَ: بِفُلَانَةَ. قَالَ: «هَلْ ضَاجَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ بَاشَرْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ جَامَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: فَأَمَرَ بِهِ أَنْ يُرْجَمَ فَأُخْرِجُ بِهِ إِلَى الْحَرَّةِ فَلَمَّا رُجِمَ فَوَجَدَ مَسَّ الْحِجَارَةِ فَجَزِعَ فَخَرَجَ يَشْتَدُّ فَلَقِيَهُ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ وَقَدْ عَجَزَ أَصْحَابُهُ فَنَزَعَ لَهُ بِوَظِيفِ بَعِيرٍ فَرَمَاهُ بِهِ فَقَتَلَهُ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّهُ أَنْ يَتُوبَ. فَيَتُوبَ اللَّهُ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 27,
        "matchingEnglishURN": 5860261,
        "last_updated": null
    },
    {
        "arabicURN": 5635820,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3582",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الزِّنَا إِلَّا أُخِذُوا بِالسَّنَةِ وَمَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الرِّشَا إِلَّا أخذُوا بِالرُّعْبِ» . رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 28,
        "matchingEnglishURN": 5860262,
        "last_updated": null
    },
    {
        "arabicURN": 5635850,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3585",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى رَجُلٍ أَتَى رَجُلًا أَوِ امْرَأَةً فِي دُبُرِهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 30,
        "matchingEnglishURN": 5860280,
        "last_updated": null
    },
    {
        "arabicURN": 5635860,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3586",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْهُ أَنَّهُ قَالَ: «مَنْ أَتَى بَهِيمَةً فَلَا حَدَّ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ قَالَ: وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ وَهُوَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ» وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 31,
        "matchingEnglishURN": 5860290,
        "last_updated": null
    },
    {
        "arabicURN": 5635870,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3587",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَقِيمُوا حُدُودَ اللَّهِ فِي الْقَرِيبِ وَالْبَعِيدِ وَلَا تَأْخُذْكُمْ فِي اللَّهِ لوْمةُ لائمٍ» . رَوَاهُ ابنُ مَاجَه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062c\\u064a\\u062f\", \"priority\": 50}]",
        "ourHadithNumber": 32,
        "matchingEnglishURN": 5860300,
        "last_updated": null
    },
    {
        "arabicURN": 5635900,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.10",
        "hadithNumber": "3590",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الأول",
        "hadithText": "عَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُقطعُ يدُ السَّارِقِ إِلاَّ بربُعِ دِينَار فَصَاعِدا»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 34,
        "matchingEnglishURN": 5860320,
        "last_updated": null
    },
    {
        "arabicURN": 5635910,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.10",
        "hadithNumber": "3591",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 35,
        "matchingEnglishURN": 5860330,
        "last_updated": null
    },
    {
        "arabicURN": 5635920,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.10",
        "hadithNumber": "3592",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ السارِقَ يسرقُ البيضةَ فتُقطعُ يَده وَيسْرق الْحَبل فتقطع يَده»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 36,
        "matchingEnglishURN": 5860340,
        "last_updated": null
    },
    {
        "arabicURN": 5635930,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3593",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "عَنْ رَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ» رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَابْنُ مَاجَهْ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 37,
        "matchingEnglishURN": 5860350,
        "last_updated": null
    },
    {
        "arabicURN": 5635940,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3594",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ سُئِلَ عَنِ الثَّمَرِ الْمُعَلَّقِ قَالَ: «مَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينَ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 38,
        "matchingEnglishURN": 5860360,
        "last_updated": null
    },
    {
        "arabicURN": 5635950,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3595",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ معلَّقٍ وَلَا فِي حَرِيسَةِ جَبَلٍ فَإِذَا آوَاهُ الْمُرَاحُ وَالْجَرِينُ فَالْقَطْعُ قيمًا بلغ ثمن الْمِجَن» . رَوَاهُ مَالك",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 39,
        "matchingEnglishURN": 5860371,
        "last_updated": null
    },
    {
        "arabicURN": 5635960,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3596",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ وَمَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 40,
        "matchingEnglishURN": 5860372,
        "last_updated": null
    },
    {
        "arabicURN": 5635970,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3597",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 41,
        "matchingEnglishURN": 5860380,
        "last_updated": null
    },
    {
        "arabicURN": 5636010,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3601",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ بُسْرِ بْنِ أَرْطَاةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ إِلَّا أَنَّهُمَا قَالَا: «فِي السّفر» بدل «الْغَزْو»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 43,
        "matchingEnglishURN": 5860400,
        "last_updated": null
    },
    {
        "arabicURN": 5636020,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3602",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ فِي السَّارِقِ: «إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ» . رَوَاهُ فِي شرح السّنة",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 44,
        "matchingEnglishURN": 5860410,
        "last_updated": null
    },
    {
        "arabicURN": 5636050,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3605",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بسارقٍ فقُطِعَتْ يَدَهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 46,
        "matchingEnglishURN": 5860422,
        "last_updated": null
    },
    {
        "arabicURN": 5636060,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3606",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْن مَاجَه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 47,
        "matchingEnglishURN": 5860430,
        "last_updated": null
    },
    {
        "arabicURN": 5636070,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.30",
        "hadithNumber": "3607",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثالث",
        "hadithText": "عَنْ عَائِشَةَ قَالَتْ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقَطَعَهُ فَقَالُوا: مَا كُنَّا نَرَاكَ تَبْلُغُ بِهِ هَذَا قَالَ: «لَوْ كانتْ فاطمةُ لقطعتَها» . رَوَاهُ النَّسَائِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 48,
        "matchingEnglishURN": 5860440,
        "last_updated": null
    },
    {
        "arabicURN": 5636080,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.30",
        "hadithNumber": "3608",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ قَالَ: جَاءَ رَجُلٌ إِلَى عُمَرَ بِغُلَامٍ لَهُ فَقَالَ: اقْطَعْ يَدَهُ فَإِنَّهُ سرقَ مرآةَ لأمرأتي فَقَالَ عمَرُ رَضِي اللَّهُ عَنهُ: لَا قَطْعَ عَلَيْهِ وَهُوَ خَادِمُكُمْ أَخَذَ مَتَاعَكُمْ. رَوَاهُ مَالك",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 49,
        "matchingEnglishURN": 5860450,
        "last_updated": null
    },
    {
        "arabicURN": 5636090,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.30",
        "hadithNumber": "3609",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ» قُلْتُ: لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ قَالَ: «كَيْفَ أَنْتَ إِذَا أَصَابَ النَّاسَ مَوْتٌ يَكُونُ الْبَيْتُ فِيهِ بِالْوَصِيفِ» يَعْنِي الْقَبْرَ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «عَلَيْكَ بِالصَّبْرِ» قَالَ حمَّادُ بنُ أبي سُليمانَ: تُقْطَعُ يَدُ النَّبَّاشِ لِأَنَّهُ دَخَلَ عَلَى الْمَيْتِ بيتَه. رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 50,
        "matchingEnglishURN": 5860460,
        "last_updated": null
    },
    {
        "arabicURN": 5636100,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "2.10",
        "hadithNumber": "3610",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الأول",
        "hadithText": "عَن عائشةَ رَضِي الله عَنْهَا أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا: مَنْ يُكَلِّمُ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالُوا: وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ؟» ثُمَّ قَامَ فَاخْتَطَبَ ثُمَّ قَالَ: «إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا» . مُتَّفَقٌ عَلَيْهِ. وَفِي روايةٍ لمسلمٍ: قالتْ: كانتِ امرأةٌ مخزوميَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا ثمَّ ذكرَ الحديثَ بنحوِ مَا تقدَّمَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 51,
        "matchingEnglishURN": 5860470,
        "last_updated": null
    },
    {
        "arabicURN": 5636110,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "2.20",
        "hadithNumber": "3611",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدَ ضَادَّ اللَّهَ وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سُخْطِ اله تَعَالَى حَتَّى يَنْزِعَ وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ حَتَّى يَخْرُجَ مِمَّا قَالَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَفِي روايةٍ للبيهقيِّ فِي شعبِ الْإِيمَان «مَنْ أَعانَ على خُصُومَةً لَا يَدْرِي أَحَقٌّ أَمْ بَاطِلٌ فَهُوَ فِي سَخطِ اللَّهِ حَتَّى ينْزع»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 52,
        "matchingEnglishURN": 5860490,
        "last_updated": null
    },
    {
        "arabicURN": 5636120,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "2.20",
        "hadithNumber": "3612",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بِلِصٍّ قَدِ اعْتَرَفَ اعْتِرَافًا وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَخَالُكَ سَرَقْتَ» . قَالَ: بَلَى فَأَعَادَ عَلَيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا كُلَّ ذَلِكَ يَعْتَرِفُ فَأَمَرَ بِهِ فَقُطِعَ وَجِيءَ بِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ» فَقَالَ: أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ تُبْ عليهِ» ثَلَاثًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ هَكَذَا وجدتُ فِي الْأُصُول الْأَرْبَعَة وجامع الْأُصُول وَشُعَبُ الْإِيمَانِ وَمَعَالِمُ السُّنَنِ عَنْ أَبِي أُمَيَّةَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 53,
        "matchingEnglishURN": 5860500,
        "last_updated": null
    },
    {
        "arabicURN": 5636141,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.10",
        "hadithNumber": "3614, 3615",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ والنِّعالِ وجلَدَ أَبُو بكرٍ رَضِي الله عَنهُ أربعينَ<br><p>\nوَفِي رِوَايَة عَنْهُ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 54,
        "matchingEnglishURN": 5860510,
        "last_updated": null
    },
    {
        "arabicURN": 5636160,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.10",
        "hadithNumber": "3616",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "وَعَنِ السَّائِبِ بْنِ يَزِيدَ قَالَ: كَانَ يُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ فَنَقُومُ عَلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ فَجَلَدَ أَرْبَعِينَ حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 55,
        "matchingEnglishURN": 5860520,
        "last_updated": null
    },
    {
        "arabicURN": 5636200,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.20",
        "hadithNumber": "3620",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ قَالَ: كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ لِلنَّاسِ: «اضْرِبُوهُ» فَمِنْهُمْ مَنْ ضَرَبَهُ بِالنِّعَالِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْعَصَا وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْمِيتَخَةِ. قَالَ ابْنُ وَهْبٍ: يَعْنِي الْجَرِيدَةَ الرَّطْبَةَ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرَابًا مِنَ الْأَرْضِ فَرَمَى بِهِ فِي وجهِه. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 57,
        "matchingEnglishURN": 5860532,
        "last_updated": null
    },
    {
        "arabicURN": 5636210,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.20",
        "hadithNumber": "3621",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شربَ الخمرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِثَوْبِهِ وَالضَّارِبُ بِنَعْلِهِ ثُمَّ قَالَ: «بَكِّتُوهُ» فَأَقْبَلُوا عَلَيْهِ يَقُولُونَ: مَا اتَّقَيْتَ اللَّهَ مَا خَشِيتَ اللَّهَ وَمَا اسْتَحْيَيْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ. قَالَ: \" لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ وَلَكِنْ قُولُوا: اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ \". رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 58,
        "matchingEnglishURN": 5860540,
        "last_updated": null
    },
    {
        "arabicURN": 5636220,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.20",
        "hadithNumber": "3622",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: شَرِبَ رَجُلٌ فَسَكِرَ فَلُقِيَ يَمِيلُ فِي الْفَجِّ فَانْطُلِقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا حَاذَى دَارَ الْعَبَّاسِ انْفَلَتَ فَدَخَلَ عَلَى الْعَبَّاسِ فَالْتَزَمَهُ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فضحكَ وَقَالَ: «أفعَلَها؟» وَلم يأمرْ فيهِ بشيءٍ. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 59,
        "matchingEnglishURN": 5860550,
        "last_updated": null
    },
    {
        "arabicURN": 5636230,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.30",
        "hadithNumber": "3623",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثالث",
        "hadithText": "عَن عُمَيْر بن سعيد النخفي قَالَ: سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ: مَا كُنْتُ لِأُقِيمَ عَلَى أَحَدٍ حَدًّا فَيَمُوتَ فَأَجِدَ فِي نَفْسِي مِنْهُ شَيْئًا إِلَّا صَاحِبَ الْخَمْرِ فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يسنه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 60,
        "matchingEnglishURN": 5860560,
        "last_updated": null
    },
    {
        "arabicURN": 5636240,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.30",
        "hadithNumber": "3624",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثالث",
        "hadithText": "وَعَنْ ثَوْرِ بْنِ زَيْدٍ الدَّيْلِمِيِّ قَالَ: إِنَّ عُمَرَ اسْتَشَارَ فِي حَدِّ الْخَمْرِ فَقَالَ لَهُ عَلِيٌّ: أَرَى أَنْ تَجْلِدَهُ ثَمَانِينَ جَلْدَةً فَإِنَّهُ إِذَا شَرِبَ سَكِرَ وَإِذَا سَكِرَ هَذَى وَإِذَا هذَى افْتَرى فجلدَ عمرُ رَضِي الله عَنهُ فِي حَدِّ الْخَمْرِ ثَمَانِينَ. رَوَاهُ مَالِكٌ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 61,
        "matchingEnglishURN": 5860570,
        "last_updated": null
    },
    {
        "arabicURN": 5636250,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "4.10",
        "hadithNumber": "3625",
        "bookName": "كتاب الحدود",
        "babName": "باب مالا يدعى على المحدود - الفصل الأول",
        "hadithText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أنَّ رجلا اسمُه عبدُ اللَّهِ يُلَقَّبُ حمارا كَانَ يُضْحِكُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَلَدَهُ فِي الشَّرَابِ فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تلعنوه فو الله مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 62,
        "matchingEnglishURN": 5860580,
        "last_updated": null
    },
    {
        "arabicURN": 5636260,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "4.10",
        "hadithNumber": "3626",
        "bookName": "كتاب الحدود",
        "babName": "باب مالا يدعى على المحدود - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِنَعْلِهِ وَالضَّارِبُ بِثَوْبِهِ فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ قَالَ: «لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ» . رَوَاهُ الْبُخَارِيُّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 63,
        "matchingEnglishURN": 5860590,
        "last_updated": null
    },
    {
        "arabicURN": 5636270,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "4.20",
        "hadithNumber": "3627",
        "bookName": "كتاب الحدود",
        "babName": "باب مالا يدعى على المحدود - الفصل الثاني",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ الْأَسْلَمِيُّ إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ أَصَابَ امْرَأَةً حَرَامًا أَرْبَعَ مَرَّاتٍ كُلَّ ذَلِكَ يُعْرِضُ عَنْهُ فَأَقْبَلَ فِي الْخَامِسَةِ فَقَالَ: «أَنِكْتَهَا؟» قَالَ: نَعَمْ قَالَ: «حَتَّى غَابَ ذَلِكَ مِنْكَ فِي ذَلِكَ مِنْهَا» قَالَ: نَعَمْ قَالَ: «كَمَا يَغِيبُ الْمِرْوَدُ فِي الْمُكْحُلَةِ وَالرِّشَاءُ فِي الْبِئْرِ؟» قَالَ: نَعَمْ قَالَ: «هَلْ تَدْرِي مَا الزِّنَا؟» قَالَ: نَعَمْ أَتَيْتُ مِنْهَا حَرَامًا مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ حَلَالًا قَالَ: «فَمَا تُرِيدُ بِهَذَا الْقَوْلِ؟» قَالَ: أُرِيدُ أَنْ تُطَهِّرَنِي فَأَمَرَ بِهِ فَرُجِمَ فَسَمِعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَيْنِ مِنْ أَصْحَابِهِ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ: انْظُرْ إِلَى هَذَا الَّذِي سَتَرَ اللَّهُ عَلَيْهِ فَلَمْ تَدَعْهُ نَفْسُهُ حَتَّى رُجِمَ رَجْمَ الْكَلْبِ فَسَكَتَ عَنْهُمَا ثُمَّ سَارَ سَاعَةً حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلٍ برجلِهِ فَقَالَ: «أينَ فلانٌ وفلانٌ؟» فَقَالَا: نَحْنُ ذَانِ يَا رَسُولَ اللَّهِ فَقَالَ: «انْزِلَا فَكُلَا مِنْ جِيفَةِ هَذَا الْحِمَارِ» فَقَالَا: يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ مِنْ هَذَا؟ قَالَ: «فَمَا نِلْتُمَا مِنْ عَرْضِ أَخِيكُمَا آنِفًا أَشَدُّ مِنْ أَكْلٍ مِنْهُ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ الْآنَ لَفِي أنهارِ الجنَّةِ ينغمسُ فِيهَا» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 64,
        "matchingEnglishURN": 5860600,
        "last_updated": null
    },
    {
        "arabicURN": 5636280,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "4.20",
        "hadithNumber": "3628",
        "bookName": "كتاب الحدود",
        "babName": "باب مالا يدعى على المحدود - الفصل الثاني",
        "hadithText": "وَعَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَ ذَنْبًا أُقِيمَ عَلَيْهِ حَدُّ ذَلِكَ الذَّنْبِ فَهُوَ كفارتُه» رَوَاهُ فِي شرح السّنة",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 65,
        "matchingEnglishURN": 5860611,
        "last_updated": null
    },
    {
        "arabicURN": 5636290,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "4.20",
        "hadithNumber": "3629",
        "bookName": "كتاب الحدود",
        "babName": "باب مالا يدعى على المحدود",
        "hadithText": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَصَابَ حَدًّا فَعُجِّلَ عُقُوبَتَهُ فِي الدُّنْيَا فَاللَّهُ أَعْدَلُ مِنْ أَنْ يُثَنِّيَ عَلَى عَبْدِهِ الْعُقُوبَةَ فِي الْآخِرَة وَمن أصَاب حد فستره اللَّهُ عليهِ وَعَفَا عَنْهُ فَاللَّهُ أَكْرَمُ مِنْ أَنْ يَعُودَ فِي شَيْءٍ قَدْ عَفَا عَنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ\nهَذَا الْبَاب خَال عَن الْفَصْل الثَّالِث",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 66,
        "matchingEnglishURN": 5860612,
        "last_updated": null
    },
    {
        "arabicURN": 5636300,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "5.10",
        "hadithNumber": "3630",
        "bookName": "كتاب الحدود",
        "babName": "باب التعزيز - الفصل الأول",
        "hadithText": "عَن أبي بردة بن ينار عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حد من حُدُود الله»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 67,
        "matchingEnglishURN": 5860620,
        "last_updated": null
    },
    {
        "arabicURN": 5636310,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "5.20",
        "hadithNumber": "3631",
        "bookName": "كتاب الحدود",
        "babName": "باب التعزيز - الفصل الثاني",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ الوجهَ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 68,
        "matchingEnglishURN": 5860630,
        "last_updated": null
    },
    {
        "arabicURN": 5636320,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "5.20",
        "hadithNumber": "3632",
        "bookName": "كتاب الحدود",
        "babName": "باب التعزيز - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ: يَا يَهُودِيُّ فَاضْرِبُوهُ عِشْرِينَ وَإِذَا قَالَ: يَا مُخَنَّثُ فَاضْرِبُوهُ عِشْرِينَ وَمَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ فَاقْتُلُوهُ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 69,
        "matchingEnglishURN": 5860641,
        "last_updated": null
    },
    {
        "arabicURN": 5636330,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "5.20",
        "hadithNumber": "3633",
        "bookName": "كتاب الحدود",
        "babName": "باب التعزيز",
        "hadithText": "وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَجَدْتُمُ الرَّجُلَ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ فَاحْرُقُوا مَتَاعَهُ وَاضْرِبُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب\nهَذَا الْبَاب خَال من الْفَصْل الثَّالِث",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 70,
        "matchingEnglishURN": 5860642,
        "last_updated": null
    },
    {
        "arabicURN": 5636340,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3634",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" الْخَمْرُ مِنْ هَاتَيْنِ الشَّجرتينِ: النخلةِ والعِنَبَةِ \". رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 71,
        "matchingEnglishURN": 5860650,
        "last_updated": null
    },
    {
        "arabicURN": 5636350,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3635",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: خطَبَ عمرُ رَضِي الله عَنهُ عَلَى مِنْبَرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: \" إِنَّهُ قَدْ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهِيَ مِنْ خَمْسَةِ أَشْيَاءَ: الْعِنَبِ وَالتَّمْرِ وَالْحِنْطَةِ والشعيرِ والعسلِ وَالْخمر مَا خامر الْعقل \". رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 72,
        "matchingEnglishURN": 5860660,
        "last_updated": null
    },
    {
        "arabicURN": 5636360,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3636",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: لَقَدْ حُرِّمَتِ الْخَمْرُ حِينَ حُرِّمَتْ وَمَا نَجِدُ خَمْرَ الْأَعْنَابِ إِلَّا قَلِيلًا وَعَامة خمرنا الْبُسْر وَالتَّمْر. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 73,
        "matchingEnglishURN": 5860670,
        "last_updated": null
    },
    {
        "arabicURN": 5636370,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3637",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ قَالَتْ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْبِتْعِ وَهُوَ نَبِيذُ الْعَسَلِ فَقَالَ: «كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 74,
        "matchingEnglishURN": 5860681,
        "last_updated": null
    },
    {
        "arabicURN": 5636380,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3638",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ وَمَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ لَمْ يَشْرَبْهَا فِي الْآخِرَةِ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 75,
        "matchingEnglishURN": 5860682,
        "last_updated": null
    },
    {
        "arabicURN": 5636390,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3639",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ جَابِرٍ أَنَّ رَجُلًا قَدِمَ مِنَ الْيَمَنِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنَ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوَ مُسْكِرٌ هُوَ؟» قَالَ: نَعَمْ قَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ عَلَى اللَّهِ عَهْدًا لِمَنْ يَشْرَبُ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ» . قَالُوا: يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ؟ قَالَ: «عَرَقُ أَهْلِ النَّارِ أَوْ عُصَارَةُ أَهْلِ النَّارِ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 76,
        "matchingEnglishURN": 5860690,
        "last_updated": null
    },
    {
        "arabicURN": 5636400,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3640",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي قَتَادَةَ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ خَلِيطِ التَّمْرِ وَالْبُسْرِ وَعَنْ خَلِيطِ الزَّبِيبِ وَالتَّمْرِ وَعَنْ خَلِيطِ الزَّهْوِ وَالرُّطَبِ. وَقَالَ: «انْتَبِذُوا كُلَّ وَاحِدٍ عَلَى حِدَةٍ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 77,
        "matchingEnglishURN": 5860700,
        "last_updated": null
    },
    {
        "arabicURN": 5636410,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3641",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْخَمْرِ يُتَّخَذُ خَلًّا؟ فَقَالَ: «لَا» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 78,
        "matchingEnglishURN": 5860711,
        "last_updated": null
    },
    {
        "arabicURN": 5636420,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.10",
        "hadithNumber": "3642",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الأول",
        "hadithText": "وَعَنْ وَائِلٍ الْحَضْرَمِيِّ أَنَّ طَارِقَ بْنَ سُوَيْدٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ. فَقَالَ: إِنَّمَا أَصْنَعُهَا لِلدَّوَاءِ فَقَالَ: «إِنَّهُ لَيْسَ بِدَوَاءٍ وَلَكِنَّهُ دَاءٌ» . رَوَاهُ مُسْلِمٌ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 79,
        "matchingEnglishURN": 5860712,
        "last_updated": null
    },
    {
        "arabicURN": 5636450,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3645",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 81,
        "matchingEnglishURN": 5860722,
        "last_updated": null
    },
    {
        "arabicURN": 5636460,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3646",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثاني",
        "hadithText": "وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أسكرَ مِنْهُ الفرْقُ فَمِلْءُ الْكَفِّ مِنْهُ حَرَامٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 82,
        "matchingEnglishURN": 5860731,
        "last_updated": null
    },
    {
        "arabicURN": 5636470,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3647",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثاني",
        "hadithText": "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 83,
        "matchingEnglishURN": 5860732,
        "last_updated": null
    },
    {
        "arabicURN": 5636480,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3648",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها",
        "hadithText": "وَعَن أبي سعيدٍ الخدريِّ قَالَ: كانَ عندَنا خَمْرٌ لِيَتِيمٍ فَلَمَّا نَزَلَتِ (الْمَائِدَةُ)\nسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ وَقُلْتُ: إِنَّه ليَتيمٍ فَقَالَ: «أهْريقوهُ» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 84,
        "matchingEnglishURN": 5860740,
        "last_updated": null
    },
    {
        "arabicURN": 5636490,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3649",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثاني",
        "hadithText": "وَعَنْ أَنَسٍ عَنْ أَبِي طَلْحَةَ: أَنَّهُ قَالَ: يَا نَبِيَّ اللَّهِ إِنِّي اشْتَرَيْتُ خَمْرًا لِأَيْتَامٍ فِي حِجْرِي قَالَ: «أَهْرِقِ الْخَمْرَ وَاكْسِرِ الدِّنَانَ» . رَوَاهُ التِّرْمِذِيُّ وَضَعَّفَهُ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: أَنه سَأَلَهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيْتَامٍ وَرِثُوا خَمْرًا قَالَ: «أَهْرِقْهَا» . قَالَ: أَفَلَا أَجْعَلُهَا خلاًّ؟ قَالَ: «لَا»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 85,
        "matchingEnglishURN": 5860751,
        "last_updated": null
    },
    {
        "arabicURN": 5636500,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3650",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "عَنْ أُمِّ سَلَمَةَ قَالَتْ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ مُسْكِرٍ ومقتر. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 86,
        "matchingEnglishURN": 5860770,
        "last_updated": null
    },
    {
        "arabicURN": 5636510,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3651",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْ دَيْلَمٍ الْحِمْيَرِيِّ قَالَ: قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ بَارِدَةٍ وَنُعَالِجُ فِيهَا عَمَلًا شَدِيدًا وَإِنَّا نَتَّخِذُ شَرَابًا مِنْ هَذَا الْقَمْحِ نَتَقَوَّى بِهِ عَلَى أَعْمَالِنَا وَعَلَى بَرْدِ بِلَادِنَا قَالَ: «هَلْ يُسْكِرُ؟» قُلْتُ: نَعَمْ قَالَ: «فَاجْتَنِبُوهُ» قُلْتُ: إِنَّ النَّاسَ غَيْرُ تَارِكِيهِ قَالَ: «إِنْ لَمْ يَتْرُكُوهُ فقاتلوهم» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 87,
        "matchingEnglishURN": 5860780,
        "last_updated": null
    },
    {
        "arabicURN": 5636520,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3652",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ وَالْغُبَيْرَاءِ وَقَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 88,
        "matchingEnglishURN": 5860791,
        "last_updated": null
    },
    {
        "arabicURN": 5636530,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3653",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ وَلَا قَمَّارٌ وَلَا مَنَّانٌ وَلَا مُدْمِنُ خَمْرٍ» . رَوَاهُ الدَّارِمِيُّ وَفِي رِوَايَةٍ لَهُ: «وَلَا وَلَدَ زِنْيَةٍ» بَدَلَ «قمار»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 89,
        "matchingEnglishURN": 5860792,
        "last_updated": null
    },
    {
        "arabicURN": 5636540,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3654",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ اللَّهَ تَعَالَى بَعَثَنِي رَحْمَة للعالمينَ وهُدىً لِلْعَالِمِينَ وَأَمَرَنِي رَبِّي عَزَّ وَجَلَّ بِمَحْقِ الْمَعَازِفِ وَالْمَزَامِيرِ وَالْأَوْثَانِ وَالصُّلُبِ وَأَمْرِ الْجَاهِلِيَّةِ وَحَلَفَ رَبِّي عزَّ وجلَّ: بعِزَّتي لَا يشربُ عبدٌ منْ عَبِيدِي جرعة خَمْرٍ إِلَّا سَقَيْتُهُ مِنَ الصَّدِيدِ مِثْلَهَا وَلَا يَتْرُكُهَا مِنْ مَخَافَتِي إِلَّا سَقَيْتُهُ مِنْ حِيَاضِ الْقُدس \". رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 90,
        "matchingEnglishURN": 5860800,
        "last_updated": null
    },
    {
        "arabicURN": 5636550,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3655",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" ثَلَاثَةٌ قَدْ حَرَّمَ اللَّهُ عَلَيْهِمُ الْجَنَّةَ: مُدْمِنُ الْخَمْرِ وَالْعَاقُّ وَالدَّيُّوثُ الَّذِي يُقِرُّ فِي أَهْلِهِ الْخَبَثَ \". رَوَاهُ أَحْمَدُ وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 91,
        "matchingEnglishURN": 5860810,
        "last_updated": null
    },
    {
        "arabicURN": 5636560,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3656",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" ثَلَاثَةٌ لَا تَدْخُلُ الجنَّةَ: مُدْمنُ الخمرِ وقاطِعُ الرَّحِم ومصدق السحر \" رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 92,
        "matchingEnglishURN": 5860820,
        "last_updated": null
    },
    {
        "arabicURN": 5636600,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3660",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي مُوسَى أَنَّهُ كَانَ يَقُولُ: مَا أُبالي شرِبتُ الخمرَ أَو عبدْتُ هذهِ السَّارِيةَ دونَ اللَّهِ. رَوَاهُ النَّسَائِيّ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 94,
        "matchingEnglishURN": 5860840,
        "last_updated": null
    },
    {
        "arabicURN": 5636031,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3603, 3604",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: جِيءَ بِسَارِقٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّانِيَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّالِثَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الرَّابِعَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ فَأُتِيَ بِهِ الْخَامِسَةَ فَقَالَ: «اقْتُلُوهُ» فَانْطَلَقْنَا بِهِ فَقَتَلْنَاهُ ثُمَّ اجْتَرَرْنَاهُ فَأَلْقَيْنَاهُ فِي بِئْرٍ وَرَمَيْنَا عَلَيْهِ الحجارةَ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ<br><p>\nوَرُوِيَ فِي شَرْحِ السُّنَّةِ فِي قَطْعِ السَّارِقِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْطَعُوهُ ثمَّ احسموه»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 45,
        "matchingEnglishURN": 5860421,
        "last_updated": null
    },
    {
        "arabicURN": 5636431,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.20",
        "hadithNumber": "3643, 3644",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثاني",
        "hadithText": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَنْ شَرِبَ الْخَمْرَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةَ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ. فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ فِي الرَّابِعَةِ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاة أَرْبَعِينَ صباحا فَإِن تَابَ لم يَتُبِ اللَّهُ عَلَيْهِ وَسَقَاهُ مِنْ نَهْرِ الْخَبَالِ» . رَوَاهُ التِّرْمِذِيّ<br><p>\nوَرَوَاهُ النَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ عَنْ عَبْدِ الله بن عَمْرو",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 80,
        "matchingEnglishURN": 5860721,
        "last_updated": null
    },
    {
        "arabicURN": 5635831,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3583, 3584",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَلْعُونٌ مَنْ عَمِلَ عَمَلَ قَوْمِ لُوطٍ» . رَوَاهُ رَزِينٌ<br><p>\nوَفِي رِوَايَةٍ لَهُ عَنِ ابْنِ عَبَّاسٍ: أَنَّ عليَّاً رَضِي الله عَنهُ أحرَقَهما وَأَبا بكرٍ هدم عَلَيْهِمَا حَائِطا",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 29,
        "matchingEnglishURN": 5860270,
        "last_updated": null
    },
    {
        "arabicURN": 5635881,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "0.30",
        "hadithNumber": "3588, 3589",
        "bookName": "كتاب الحدود",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِقَامَةُ حَدٍّ مِنْ حُدُودِ اللَّهِ خَيْرٌ مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً فِي بلادِ الله» . رَوَاهُ ابْن مَاجَه<br><p>\nوَرَوَاهُ النَّسَائِيُّ عَنْ أَبِي هُرَيْرَةَ",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u062c\\u064a\\u062f, \\u062c\\u064a\\u062f\",\"priority\":50}]",
        "ourHadithNumber": 33,
        "matchingEnglishURN": 5860310,
        "last_updated": null
    },
    {
        "arabicURN": 5635981,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "1.20",
        "hadithNumber": "3598, 3599, 3600",
        "bookName": "كتاب الحدود",
        "babName": "باب قطع السرقة - الفصل الثاني",
        "hadithText": "وَرُوِيَ فِي «شَرْحِ السُّنَّةِ» : أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ قَدِمَ الْمَدِينَةَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ وَأَخَذَ رِدَاءَهُ فَأَخَذَهُ صَفْوَانُ فَجَاءَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ تُقْطَعَ يَدُهُ فَقَالَ صَفْوَانُ: إِنِّي لَمْ أُرِدْ هَذَا هُوَ عَلَيْهِ صَدَقَةٌ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَهَلا قبل أَن تَأتِينِي بِهِ»\r\n\r\nوَرَوَى نَحْوَهُ ابْنُ مَاجَهْ عَنْ عَبْدِ اللَّهِ بن صَفْوَان عَن أَبِيه\r\n\r\nوالدارمي عَن ابْن عَبَّاس",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 42,
        "matchingEnglishURN": 5860390,
        "last_updated": null
    },
    {
        "arabicURN": 5636171,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "3.20",
        "hadithNumber": "3617, 3618, 3619",
        "bookName": "كتاب الحدود",
        "babName": "باب الشفاعة في الحدود - الفصل الثاني",
        "hadithText": "عَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الرَّابِعَةِ فَاقْتُلُوهُ» قَالَ: ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ بِرَجُلٍ قَدْ شَرِبَ فِي الرَّابِعَةِ فَضَرَبَهُ وَلَمْ يقْتله. رَوَاهُ التِّرْمِذِيّ<br><p>\nوَرَوَاهُ أَبُو دَاوُد عَن قبيصَة بن دؤيب<br><p>\nوَفِي أُخْرَى لَهُمَا وَلِلنَّسَائِيِّ وَابْنِ مَاجَهْ وَالدَّارِمِيِّ عَنْ نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمُ ابْنُ عُمَرَ وَمُعَاوِيَةُ وَأَبُو هُرَيْرَة والشريد إِلَى قَوْله: «فَاقْتُلُوهُ»",
        "annotations": null,
        "bookID": "17.0",
        "grade1": null,
        "ourHadithNumber": 56,
        "matchingEnglishURN": 5860531,
        "last_updated": null
    },
    {
        "arabicURN": 5636571,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 17,
        "babNumber": "6.30",
        "hadithNumber": "3657, 3658, 3659",
        "bookName": "كتاب الحدود",
        "babName": "باب بيان الخمر ووعيد شاربها - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُدْمِنُ الْخَمْرِ إِنْ مَاتَ لقيَ اللَّهَ كعابِدِ وثن» . رَوَاهُ أَحْمد\r\n\r\nوروى ابْن مَاجَه عَن أبي هُرَيْرَة\r\n\r\nوَالْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنْ مُحَمَّدِ بْنِ عبيد الله عَن أَبِيه. قَالَ: ذَكَرَ الْبُخَارِيُّ فِي التَّارِيخِ عَنْ مُحَمَّدِ بْنِ عبد الله عَن أَبِيه",
        "annotations": null,
        "bookID": "17.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 93,
        "matchingEnglishURN": 5860830,
        "last_updated": null
    }
]