[
    {
        "arabicURN": 5646061,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4606, 4607",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلَّا الْمُبَشِّرَاتُ» قَالُوا: وَمَا الْمُبَشِّرَاتُ؟ قَالَ: «الرُّؤْيَا الصالحةُ» . رَوَاهُ البُخَارِيّ<br><p>\nوَزَادَ مَالِكٌ بِرِوَايَةِ عَطَاءِ بْنِ يَسَارٍ: «يَرَاهَا الرجل الْمُسلم أَو ترى لَهُ»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d, \\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\",\"priority\":50}]",
        "ourHadithNumber": 1,
        "matchingEnglishURN": 5930010,
        "last_updated": null
    },
    {
        "arabicURN": 5646080,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4608",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 2,
        "matchingEnglishURN": 5930020,
        "last_updated": null
    },
    {
        "arabicURN": 5646090,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4609",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: «من رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ فِي صُورَتِي»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 3,
        "matchingEnglishURN": 5930030,
        "last_updated": null
    },
    {
        "arabicURN": 5646100,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4610",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 4,
        "matchingEnglishURN": 5930040,
        "last_updated": null
    },
    {
        "arabicURN": 5646110,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4611",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من رَآنِي فِي الْمَنَام فيسراني فِي الْيَقَظَةِ وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِي»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 5,
        "matchingEnglishURN": 5930050,
        "last_updated": null
    },
    {
        "arabicURN": 5646120,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4612",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلَا يُحَدِّثُ بِهِ إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَمِنْ شَرِّ الشَّيْطَانِ وَلْيَتْفُلْ ثَلَاثًا وَلَا يُحَدِّثْ بِهَا أحدا فَإِنَّهَا لن تضره»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 6,
        "matchingEnglishURN": 5930060,
        "last_updated": null
    },
    {
        "arabicURN": 5646130,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4613",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلَاثًا وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كانَ عَلَيْهِ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 7,
        "matchingEnglishURN": 5930070,
        "last_updated": null
    },
    {
        "arabicURN": 5646160,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4616",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَن جَابر قَالَ: جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ قَالَ: فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ فَلَا يُحَدِّثْ بِهِ النَّاس» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 9,
        "matchingEnglishURN": 5930090,
        "last_updated": null
    },
    {
        "arabicURN": 5646170,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4617",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَأَيْتُ ذَاتَ لَيْلَةٍ فِيمَا يَرَى النَّائِمُ كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ فَأُوتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ فَأَوَّلْتُ أَنَّ الرِّفْعَةَ لَنَا فِي الدُّنْيَا وَالْعَاقِبَةَ فِي الْآخِرَةِ وَأَنَّ دِينَنَا قَدْ طَابَ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 10,
        "matchingEnglishURN": 5930100,
        "last_updated": null
    },
    {
        "arabicURN": 5646180,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4618",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهْلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِي رُؤْيَايَ هَذِهِ: أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فعادَ أحسنَ مَا كانَ فإِذا هوَ جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ \"",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 11,
        "matchingEnglishURN": 5930110,
        "last_updated": null
    },
    {
        "arabicURN": 5646190,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4619",
        "bookName": "كتاب الرؤيا",
        "babName": "باب",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَا أَنَا نَائِمٌ بِخَزَائِنِ الْأَرْضِ فَوُضِعَ فِي كَفَّيَّ سِوَارَانِ مِنْ ذَهَبٍ فَكَبُرَا عَلَيَّ فَأُوحِيَ إِلَيَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «يُقَالُ لِأَحَدِهِمَا مُسَيْلِمَةُ صَاحِبُ الْيَمَامَةِ وَالْعَنْسِيُّ صَاحِبُ صَنْعَاءَ» لَمْ أَجِدْ هَذِهِ الرِّوَايَةَ فِي (الصَّحِيحَيْنِ)\nوَذكرهَا صَاحب الْجَامِع عَن التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 12,
        "matchingEnglishURN": 5930120,
        "last_updated": null
    },
    {
        "arabicURN": 5646200,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4620",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أُمِّ الْعَلَاءِ الْأَنْصَارِيَّةِ قَالَتْ: رَأَيْتُ لِعُثْمَانَ بْنِ مَظْعُونٍ فِي النَّوْمِ عَيْنًا تَجْرِي فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «ذَلِكِ عَمَلُهُ يُجْرَى لَهُ» . رَوَاهُ الْبُخَارِيُّ",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 13,
        "matchingEnglishURN": 5930130,
        "last_updated": null
    },
    {
        "arabicURN": 5646210,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4621",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَن سُمرةَ بنِ جُندب قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ: «مَنْ رَأَى مِنْكُمُ اللَّيْلَةَ رُؤْيَا؟» قَالَ: فَإِنْ رَأَى أَحَدٌ قَصَّهَا فَيَقُولُ: مَا شَاءَ اللَّهُ فَسَأَلَنَا يَوْمًا فَقَالَ: «هَلْ رَأَى مِنْكُمْ أَحَدٌ رُؤْيَا؟» قُلْنَا: لَا قَالَ: \" لَكِنِّي رَأَيْتُ اللَّيْلَةَ رَجُلَيْنِ أَتَيَانِي فَأَخَذَا بِيَدَيَّ فَأَخْرَجَانِي إِلَى أَرْضٍ مُقَدَّسَةٍ فَإِذَا رَجُلٌ جَالِسٌ وَرَجُلٌ قَائِمٌ بِيَدِهِ كَلُّوبٌ مِنْ حَدِيدٍ يُدْخِلُهُ فِي شِدْقِهِ فَيَشُقُّهُ حَتَّى يَبْلُغَ قَفَاهُ ثُمَّ يَفْعَلُ بِشِدْقِهِ الْآخَرِ مِثْلَ ذَلِكَ وَيَلْتَئِمُ شِدْقُهُ هَذَا فَيَعُودُ فَيَصْنَعُ مِثْلَهُ. قُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ عَلَى قَفَاهُ وَرَجُلٌ قَائِمٌ عَلَى رَأْسِهِ بِفِهْرٍ أَوْ صَخْرَةٍ يَشْدَخُ بِهَا رَأْسَهُ فَإِذَا ضَرَبَهُ تَدَهْدَهَ الْحَجَرُ فَانْطَلَقَ إِلَيْهِ لِيَأْخُذَهُ فَلَا يَرْجِعُ إِلَى هَذَا حَتَّى يَلْتَئِمَ رَأْسُهُ وَعَادَ رَأْسُهُ كَمَا كَانَ فَعَادَ إِلَيْهِ فَضَرَبَهُ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا إِلَى ثَقْبٍ مِثْلِ التَّنُّورِ أَعْلَاهُ ضَيِّقٌ وَأَسْفَلَهُ وَاسِعٌ تَتَوَقَّدُ تَحْتَهُ نَارٌ فَإِذَا ارْتَفَعَتِ ارْتَفَعُوا حَتَّى كَادَ أَنْ يَخْرُجُوا مِنْهَا وَإِذَا خَمَدَتْ رَجَعُوا فِيهَا وَفِيهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى نَهَرٍ مِنْ دَمٍ فِيهِ رَجُلٌ قَائِمٌ عَلَى وَسْطِ النَّهَرِ وَعَلَى شَطِّ النَّهَرِ رَجُلٌ بَيْنَ يَدَيْهِ حِجَارَةٌ فَأَقْبَلَ الرَّجُلُ الَّذِي فِي النَّهَرِ فَإِذَا أَرَادَ أَنْ يَخْرُجَ رَمَى الرَّجُلُ بِحَجَرٍ فِي فِيهِ فَرَدَّهُ حَيْثُ كَانَ فَجَعَلَ كُلَّمَا جَاءَ لِيَخْرُجَ رَمَى فِي فِيهِ بِحَجَرٍ فَيَرْجِعُ كَمَا كَانَ فَقُلْتُ مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى انْتَهَيْنَا إِلَى رَوْضَةٍ خَضْرَاءَ فِيهَا شَجَرَةٌ عَظِيمَةٌ وَفِي أَصْلِهَا شَيْخٌ وَصِبْيَانٌ وَإِذَا رَجُلٌ قَرِيبٌ مِنَ الشجرةِ بَيْنَ يَدَيْهِ نَارٌ يُوقِدُهَا فَصَعِدَا بِيَ الشَّجَرَةَ فأدخلاني دَار أوسطَ الشَّجَرَةِ لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا فِيهَا رِجَالٌ شُيُوخٌ وَشَبَابٌ وَنِسَاءٌ وَصِبْيَانٌ ثُمَّ أَخْرَجَانِي مِنْهَا فصعدا بِي الشَّجَرَة فأدخلاني دَار هِيَ أَحْسَنُ وَأَفْضَلُ مِنْهَا فِيهَا شُيُوخٌ وَشَبَابٌ فَقُلْتُ لَهُمَا: إِنَّكُمَا قَدْ طَوَّفْتُمَانِي اللَّيْلَةَ فَأَخْبِرَانِي عَمَّا رَأَيْتُ قَالَا: نَعَمْ أَمَّا الرَّجُلُ الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يُحَدِّثُ بِالْكَذْبَةِ فَتُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الْآفَاقَ فَيُصْنَعُ بِهِ مَا تَرَى إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ يُشْدَخُ رَأْسُهُ فَرَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ فَنَامَ عَنْهُ بِاللَّيْلِ وَلَمْ يَعْمَلْ بِمَا فِيهِ بِالنَّهَارِ يُفْعَلُ بِهِ مَا رَأَيْتَ إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ فِي الثَّقْبِ فَهُمُ الزُّنَاةُ وَالَّذِي رَأَيْتَهُ فِي النَّهَرِ آكِلُ الرِّبَا وَالشَّيْخُ الَّذِي رَأَيْتَهُ فِي أَصْلِ الشَّجَرَةِ إِبْرَاهِيمُ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلَادُ النَّاسِ وَالَّذِي يُوقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ وَالدَّارُ الْأُولَى الَّتِي دَخَلْتَ دَارُ عَامَّةِ الْمُؤْمِنِينَ وَأَمَّا هَذِهِ الدَّارُ فَدَارُ الشُّهَدَاءِ وَأَنَا جِبْرِيلُ وَهَذَا مِيكَائِيلُ فَارْفَعْ رَأْسَكَ فَرَفَعْتُ رَأْسِي فَإِذَا فَوْقِي مِثْلُ السَّحَابِ وَفِي رِوَايَةٍ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ قَالَا: ذَلِكَ مَنْزِلُكَ قُلْتُ: دَعَانِي أَدْخُلْ مَنْزِلِي قَالَا: إِنَّهُ بَقِيَ لَكَ عُمُرٌ لَمْ تَسْتَكْمِلْهُ فَلَوِ اسْتَكْمَلْتَهُ أَتَيْتَ مَنْزِلَكَ «. رَوَاهُ الْبُخَارِيُّ.",
        "annotations": null,
        "bookID": "24.0",
        "grade1": null,
        "ourHadithNumber": 14,
        "matchingEnglishURN": 5930140,
        "last_updated": null
    },
    {
        "arabicURN": 5646220,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.20",
        "hadithNumber": "4622",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الثاني",
        "hadithText": "عَن أبي رزين العقيليِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «لَا تُحَدِّثْ إِلَّا حَبِيبًا أَوْ لَبِيبًا» . رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ قَالَ: «الرُّؤْيَا عَلَى رِجْلِ طَائِرٍ مَا لَمْ تُعْبَرْ فَإِذَا عُبِرَتْ وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «وَلَا تَقُصَّهَا إِلَّا عَلَى وَادٍّ أَوْ ذِي رأيٍ»",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 15,
        "matchingEnglishURN": 5930160,
        "last_updated": null
    },
    {
        "arabicURN": 5646230,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.20",
        "hadithNumber": "4623",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن وَرَقَةَ. فَقَالَتْ لَهُ خَدِيجَةُ: إِنَّهُ كَانَ قَدْ صَدَّقَكَ وَلَكِنْ مَاتَ قَبْلَ أَنْ تَظْهَرَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُرِيتُهُ فِي الْمَنَامِ وَعَلَيْهِ ثِيَابٌ بِيضٌ وَلَوْ كَانَ مِنْ أَهْلِ النَّارِ لَكَانَ عَلَيْهِ لِبَاسٌ غَيْرُ ذَلِك» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 16,
        "matchingEnglishURN": 5930170,
        "last_updated": null
    },
    {
        "arabicURN": 5646240,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.20",
        "hadithNumber": "4624",
        "bookName": "كتاب الرؤيا",
        "babName": "باب",
        "hadithText": "وَعَنِ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ عَمِّهِ أَبِي خُزَيْمَةَ رَضِيَ اللَّهُ عَنْهُمْ أَنَّهُ رَأَى فِيمَا يَرَى النَّائِمُ أَنَّهُ سَجَدَ عَلَى جَبْهَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَاضْطَجَعَ لَهُ وَقَالَ: «صَدِّقْ رُؤْيَاكَ» فَسَجَدَ عَلَى جَبْهَتِهِ. رَوَاهُ فِي شَرْحِ السُّنَّةِ.",
        "annotations": null,
        "bookID": "24.0",
        "grade1": null,
        "ourHadithNumber": 17,
        "matchingEnglishURN": 5930180,
        "last_updated": null
    },
    {
        "arabicURN": 5646250,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.30",
        "hadithNumber": "4625",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الثالث",
        "hadithText": "عَن سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَكْثُرُ أَنْ يَقُولَ لِأَصْحَابِهِ: «هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا؟» فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ وَإِنَّهُ قَالَ لَنَا ذَاتَ غَدَاةٍ: \" إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ وَإِنَّهُمَا ابْتَعَثَانِي وَإِنَّهُمَا قَالَا لِي: انْطَلِقْ وَإِنِّي انْطَلَقْتُ مَعَهُمَا \". وَذَكَرَ مِثْلَ الْحَدِيثِ الْمَذْكُورِ فِي الْفَصْلِ الْأَوَّلِ بِطُولِهِ وَفِيهِ زِيَادَةٌ لَيْسَتْ فِي الْحَدِيثِ الْمَذْكُورِ وَهِيَ قَوْلُهُ: \" فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتِمَةٍ فِيهَا مِنْ كُلِّ نَوْرِ الرَّبِيعِ وَإِذَا بَيْنَ ظَهْرَيِ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لَا أَكَادُ أَرَى رَأْسَهُ طُولًا فِي السَّمَاءِ وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ قُلْتُ لَهُمَا: مَا هَذَا مَا هَؤُلَاءِ؟ \" قَالَ: \" قَالَا لِيَ: انْطَلِقْ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلَا أَحْسَنَ \". قَالَ: \" قَالَا لِيَ: ارْقَ فِيهَا \". قَالَ: «فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ فَأَتَيْنَا بَابَ الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ وَشَطْرٌ مِنْهُمْ كَأَقْبَحِ مَا أَنْتَ رَاءٍ» . قَالَ: \" قَالَا لَهُمُ: اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ \" قَالَ: «وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ فَذَهَبُوا فَوَقَعُوا فِيهِ ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ فَصَارُوا فِي أَحْسَنِ صُورَةٍ» وَذَكَرَ فِي تَفْسِير هَذِه الزِّيَادَة: «وَأما الرجلُ الطويلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ» قَالَ: فَقَالَ بَعْضُ الْمُسْلِمِينَ: يَا رَسُولَ اللَّهِ وَأَوْلَادُ الْمُشْرِكِينَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَأَوْلَادُ الْمُشْرِكِينَ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شطرٌ مِنْهُم حسن وَشطر مِنْهُمْ حَسَنٌ وَشَطْرٌ مِنْهُمْ قَبِيحٌ فَإِنَّهُمْ قَوْمٌ قَدْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ الله عَنْهُم» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 18,
        "matchingEnglishURN": 5930200,
        "last_updated": null
    },
    {
        "arabicURN": 5646260,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.30",
        "hadithNumber": "4626",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ الرَّجُلُ عَيْنَيْهِ مَا لم تريا» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 19,
        "matchingEnglishURN": 5930210,
        "last_updated": null
    },
    {
        "arabicURN": 5646270,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.30",
        "hadithNumber": "4627",
        "bookName": "كتاب الرؤيا",
        "babName": "باب",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ» . رَوَاهُ التِّرْمِذِيّ والدارمي\nنِهَايَة الْجُزْء الثَّانِي",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 20,
        "matchingEnglishURN": 5930220,
        "last_updated": null
    },
    {
        "arabicURN": 5646141,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 24,
        "babNumber": "0.10",
        "hadithNumber": "4614, 4615",
        "bookName": "كتاب الرؤيا",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اقْتَرَبَ الزَّمَانُ لَمْ يَكَدْ يَكْذِبُ رُؤْيَا الْمُؤْمِنِ وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَمَا كَانَ مِنَ النُّبُوَّةِ فَإِنَّهُ لَا يَكْذِبُ» . قَالَ مُحَمَّدُ بْنُ سِيرِينَ: وَأَنَا أَقُولُ: الرُّؤْيَا ثَلَاثٌ: حَدِيثُ النَّفْسِ وَتَخْوِيفُ الشَّيْطَانِ وَبُشْرَى مِنَ اللَّهِ فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلَا يَقُصَّهُ عَلَى أَحَدٍ وَلْيَقُمْ فَلْيُصَلِّ قَالَ: وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ وَيُعْجِبُهُمُ الْقَيْدُ وَيُقَال: الْقَيْد ثبات فِي الدّين<br><p>\nقَالَ البُخَارِيّ: رَوَاهُ قَتَادَة وَيُونُس وَهِشَام وَأَبُو هِلَالٍ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ وَقَالَ يُونُسُ: لَا أَحْسَبُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَيْدِ\nوَقَالَ مُسْلِمٌ: لَا أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ؟ وَفِي رِوَايَةٍ نَحْوُهُ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: «وَأَكْرَهُ الْغُلَّ. . .» إِلَى تَمام الْكَلَام",
        "annotations": null,
        "bookID": "24.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650, \\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\",\"priority\":50}]",
        "ourHadithNumber": 8,
        "matchingEnglishURN": 5930080,
        "last_updated": null
    }
]