[
    {
        "arabicURN": 5617720,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1772",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ: «إِنَّك تَأتي قوما من أهل الْكتاب. فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ. فَإِنْ هُمْ أطاعوا لذَلِك. فَأَعْلِمْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ. فَإِنْ هم أطاعوا لذَلِك فأعلمهم أَن الله قد فرض عَلَيْهِم صَدَقَة تُؤْخَذ من أغنيائهم فَترد فِي فُقَرَائِهِمْ. فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ. فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَبَين الله حجاب»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 1,
        "matchingEnglishURN": 5760010,
        "last_updated": null
    },
    {
        "arabicURN": 5617730,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1773",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ صَاحِبِ ذَهَبٍ وَلَا فِضَّةٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ صُفِّحَتْ لَهُ صَفَائِحُ مِنْ نَارٍ فَأُحْمِيَ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَيُكْوَى بِهَا جَنْبُهُ وجبينه وظهره كلما بردت أُعِيدَتْ لَهُ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ» قِيلَ: يَا رَسُولَ اللَّهِ فَالْإِبِلُ؟ قَالَ: «وَلَا صَاحِبُ إِبِلٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا وَمِنْ حَقِّهَا حَلْبُهَا يَوْمَ وِرْدِهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ أَوْفَرَ مَا كَانَت لَا يفقد مِنْهَا فصيلا وَاحِدًا تَطَؤُهُ بِأَخْفَافِهَا وَتَعَضُّهُ بِأَفْوَاهِهَا كُلَّمَا مَرَّ عَلَيْهِ أولاها رد عَلَيْهِ أخراها فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّار» قيل: يَا رَسُول الله فَالْبَقَرُ وَالْغَنَمُ؟ قَالَ: «وَلَا صَاحِبُ بَقْرٍ وَلَا غَنَمٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ لَا يَفْقِدُ مِنْهَا شَيْئًا لَيْسَ فِيهَا عَقْصَاءُ وَلَا جَلْحَاءُ وَلَا عَضْبَاءُ تَنْطِحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا كُلَّمَا مَرَّ عَلَيْهِ أُولَاهَا رُدَّ عَلَيْهِ أُخْرَاهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ» . قِيلَ: يَا رَسُول الله فالخيل؟ قَالَ: \" الْخَيل ثَلَاثَةٌ: هِيَ لِرَجُلٍ وِزْرٌ وَهِيَ لِرَجُلٍ سِتْرٌ وَهِيَ لِرَجُلٍ أَجْرٌ. فَأَمَّا الَّتِي هِيَ لَهُ وِزْرٌ فَرَجُلٌ رَبَطَهَا رِيَاءً وَفَخْرًا وَنِوَاءً عَلَى أَهْلِ الْإِسْلَامِ فَهِيَ لَهُ وِزْرٌ. وَأَمَّا الَّتِي لَهُ سِتْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ ثُمَّ لَمْ يَنْسَ حَقَّ اللَّهِ فِي ظُهُورِهَا وَلَا رِقَابِهَا فَهِيَ لَهُ سِتْرٌ. وَأَمَّا الَّتِي هِيَ لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ الله لأهل الْإِسْلَام فِي مرج أَو رَوْضَة فَمَا أَكَلَتْ مِنْ ذَلِكَ الْمَرْجِ أَوِ الرَّوْضَةِ مِنْ شَيْءٍ إِلَّا كُتِبَ لَهُ عَدَدَ مَا أَكَلَتْ حَسَنَاتٌ وَكُتِبَ لَهُ عَدَدَ أَرْوَاثِهَا وَأَبْوَالِهَا حَسَنَاتٌ وَلَا تَقْطَعُ طِوَلَهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ إِلَّا كَتَبَ اللَّهُ لَهُ عَدَدَ آثَارِهَا وأوراثها حَسَنَاتٍ وَلَا مَرَّ بِهَا صَاحِبُهَا عَلَى نَهْرٍ فَشَرِبَتْ مِنْهُ وَلَا يُرِيدُ أَنْ يَسْقِيَهَا إِلَّا كَتَبَ اللَّهُ لَهُ عَدَدَ مَا شَرِبَتْ حَسَنَاتٍ \" قِيلَ: يَا رَسُولَ اللَّهِ فَالْحُمُرُ؟ قَالَ: \" مَا أُنْزِلَ عَلَيَّ فِي الْحُمُرِ شَيْءٌ إِلَّا هَذِهِ الْآيَةُ الْفَاذَّةُ الْجَامِعَةُ (فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ)\nالزلزلة. رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 2,
        "matchingEnglishURN": 5760020,
        "last_updated": null
    },
    {
        "arabicURN": 5617740,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1774",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ آتَاهُ اللَّهُ مَالًا فَلَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ مَالُهُ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ يَأْخُذ بِلِهْزِمَتَيْهِ - يَعْنِي بشدقيه - يَقُولُ: أَنَا مَالُكَ أَنَا كَنْزُكَ \". ثُمَّ تَلَا هَذِه الْآيَة: (وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ من فَضله)\nإِلَى آخر الْآيَة. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 3,
        "matchingEnglishURN": 5760030,
        "last_updated": null
    },
    {
        "arabicURN": 5617750,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1775",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ رَجُلٍ يَكُونُ لَهُ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ لَا يُؤَدِّي حَقَّهَا إِلَّا أَتَى بِهَا يَوْمَ الْقِيَامَةِ أعظم مَا يكون وَأَسْمَنَهُ تَطَؤُهُ بِأَخْفَافِهَا وَتَنْطِحُهُ بِقُرُونِهَا كُلَّمَا جَازَتْ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاس»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 4,
        "matchingEnglishURN": 5760040,
        "last_updated": null
    },
    {
        "arabicURN": 5617760,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1776",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ جَرِيرِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أَتَاكُمُ الْمُصَدِّقُ فَلْيَصْدُرْ عَنْكُمْ وَهُوَ عَنْكُمْ رَاضٍ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 5,
        "matchingEnglishURN": 5760050,
        "last_updated": null
    },
    {
        "arabicURN": 5617770,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1777",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ: «اللَّهُمَّ صلى على آل فلَان» . فَأَتَاهُ أبي بِصَدَقَتِهِ فَقَالَ: «اللَّهُمَّ صلى الله على آل أبي أوفى»\nوَفِي رِوَايَة: \" إِذا أَتَى الرجل النَّبِي بِصَدَقَتِهِ قَالَ: «اللَّهُمَّ صلي عَلَيْهِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 6,
        "matchingEnglishURN": 5760060,
        "last_updated": null
    },
    {
        "arabicURN": 5617780,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1778",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَن أَبِي هُرَيْرَةَ. قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمَرَ عَلَى الصَّدَقَةِ. فَقِيلَ: مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَالْعَبَّاسُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلَّا أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَرَسُولُهُ. وَأَمَّا خَالِدٌ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا. قَدِ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ. وَأَمَّا الْعَبَّاسُ فَهِيَ عَلَيَّ. وَمِثْلُهَا مَعَهَا» . ثُمَّ قَالَ: «يَا عُمَرُ أَمَا شَعَرْتَ أَن عَم الرجل صنوا أَبِيه؟»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 7,
        "matchingEnglishURN": 5760070,
        "last_updated": null
    },
    {
        "arabicURN": 5617790,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1779",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "عَن أبي حميد السَّاعِدِيّ: اسْتَعْمَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنَ الأزد يُقَال لَهُ ابْن اللتبية الأتبية عَلَى الصَّدَقَةِ فَلَمَّا قَدِمَ قَالَ: هَذَا لَكُمْ وَهَذَا أُهْدِيَ لِي فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأثْنى عَلَيْهِ وَقَالَ: \" أَمَّا بَعْدُ فَإِنِّي أَسْتَعْمِلُ رِجَالًا مِنْكُمْ عَلَى أُمُور مِمَّا ولاني الله فَيَأْتِي أحدكُم فَيَقُول: هَذَا لكم وَهَذَا هَدِيَّةٌ أُهْدِيَتْ لِي فَهَلَّا جَلَسَ فِي بَيْتِ أَبِيهِ أَوْ بَيْتِ أُمِّهِ فَيَنْظُرُ أَيُهْدَى لَهُ أَمْ لَا؟ وَالَّذِي نَفْسِي بِيَدِهِ لَا يَأْخُذُ أَحَدٌ مِنْهُ شَيْئًا إِلَّا جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى رَقَبَتِهِ إِنْ كَانَ بَعِيرًا لَهُ رُغَاءٌ أَوْ بَقْرًا لَهُ خُوَارٌ أَوْ شَاة تَيْعر \" ثمَّ رفع يَدَيْهِ حَتَّى رَأينَا عفرتي إِبِطَيْهِ ثُمَّ قَالَ: «اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَل بلغت» . . قَالَ الْخَطَّابِيُّ: وَفِي قَوْلِهِ: «هَلَّا جَلَسَ فِي بَيْتِ أُمِّهِ أَوْ أَبِيهِ فَيَنْظُرُ أَيُهْدَى إِلَيْهِ أَمْ لَا؟» دَلِيلٌ عَلَى أَنَّ كُلَّ أَمْرٍ يُتَذَرَّعُ بِهِ إِلَى مَحْظُورٍ فَهُوَ مَحْظُورٌ وَكُلُّ دخل فِي الْعُقُودِ يُنْظَرُ هَلْ يَكُونُ حُكْمُهُ عِنْدَ الِانْفِرَادِ كَحُكْمِهِ عِنْدَ الِاقْتِرَانِ أَمْ لَا؟ هَكَذَا فِي شرح السّنة",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 8,
        "matchingEnglishURN": 5760080,
        "last_updated": null
    },
    {
        "arabicURN": 5617800,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.10",
        "hadithNumber": "1780",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الأول",
        "hadithText": "وَعَنْ عَدِيِّ بْنِ عُمَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَعْمَلْنَاهُ مِنْكُم على عمر فَكَتَمَنَا مِخْيَطًا فَمَا فَوْقَهُ كَانَ غُلُولًا يَأْتِي بِهِ يَوْم الْقِيَامَة» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 9,
        "matchingEnglishURN": 5760090,
        "last_updated": null
    },
    {
        "arabicURN": 5617810,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1781",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: لَمَّا نَزَلَتْ (وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ)\nكَبُرَ ذَلِكَ عَلَى الْمُسْلِمِينَ. فَقَالَ عُمَرُ أَنَا أُفَرِّجُ عَنْكُمْ فَانْطَلَقَ. فَقَالَ: يَا نَبِيَّ اللَّهِ قد كبر على أَصْحَابك هَذِه الْآيَة. فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لم يفْرض الزَّكَاة إِلَّا ليطيب بهَا مَا بَقِيَ مِنْ أَمْوَالِكُمْ وَإِنَّمَا فَرَضَ الْمَوَارِيثَ وَذكر كلمة لتَكون لمن بعدكم» قَالَ فَكَبَّرَ عُمَرُ. ثُمَّ قَالَ لَهُ: «أَلَا أُخْبِرُكَ بِخَيْرِ مَا يَكْنِزُ الْمَرْءُ الْمَرْأَةُ الصَّالِحَةُ إِذَا نَظَرَ إِلَيْهَا سَرَّتْهُ وَإِذَا أَمَرَهَا أَطَاعَتْهُ وَإِذَا غَابَ عَنْهَا حفظته» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 10,
        "matchingEnglishURN": 5760100,
        "last_updated": null
    },
    {
        "arabicURN": 5617820,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1782",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "عَن جَابِرِ بْنِ عَتِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيَأْتِيكُمْ رُكَيْبٌ مُبَغَّضُونَ فَإِذا جاؤكم فَرَحِّبُوا بِهِمْ وَخَلُّوا بَيْنَهُمْ وَبَيْنَ مَا يَبْتَغُونَ فَإِنْ عَدَلُوا فَلِأَنْفُسِهِمْ وَإِنْ ظَلَمُوا فَعَلَيْهِمْ وَأَرْضُوهُمْ فَإِنَّ تَمَامَ زَكَاتِكُمْ رِضَاهُمْ وَلْيَدْعُوا لَكُمْ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 11,
        "matchingEnglishURN": 5760110,
        "last_updated": null
    },
    {
        "arabicURN": 5617830,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1783",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "عَن جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: جَاءَ نَاسٌ يَعْنِي مِنَ الْأَعْرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: إِنَّ نَاسًا مِنَ المصدقين يَأْتُونَا فيظلمونا قَالَ: فَقَالَ: «أَرْضُوا مُصَدِّقِيكُمْ وَإِنْ ظُلِمْتُمْ» رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 12,
        "matchingEnglishURN": 5760120,
        "last_updated": null
    },
    {
        "arabicURN": 5617840,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1784",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ بَشِيرِ بْنِ الْخَصَاصِيَّةِ قَالَ: قُلْنَا: أَنَّ أَهْلَ الصَّدَقَةِ يَعْتَدُونَ عَلَيْنَا أَفَنَكْتُمُ مِنْ أَمْوَالِنَا بِقَدْرِ مَا يَعْتَدُونَ؟ قَالَ: «لَا» رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 13,
        "matchingEnglishURN": 5760130,
        "last_updated": null
    },
    {
        "arabicURN": 5617850,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1785",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَن رَافع بن خديح قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَامِلُ عَلَى الصَّدَقَةِ بِالْحَقِّ كَالْغَازِي فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ إِلَى بَيْتِهِ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 14,
        "matchingEnglishURN": 5760140,
        "last_updated": null
    },
    {
        "arabicURN": 5617860,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1786",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ» . رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 15,
        "matchingEnglishURN": 5760150,
        "last_updated": null
    },
    {
        "arabicURN": 5617870,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1787",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَفَادَ مَالًا فَلَا زَكَاة فِيهِ حَتَّى يحول عيه الْحَوْلُ» . رَوَاهُ التِّرْمِذِيُّ وَذَكَرَ جَمَاعَةٌ أَنَّهُمْ وَقَفُوهُ على ابْن عمر",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 16,
        "matchingEnglishURN": 5760160,
        "last_updated": null
    },
    {
        "arabicURN": 5617880,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1788",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ: أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيل صَدَقَة قَبْلَ أَنْ تَحِلَّ: فَرَخَّصَ لَهُ فِي ذَلِكَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 17,
        "matchingEnglishURN": 5760170,
        "last_updated": null
    },
    {
        "arabicURN": 5617890,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.20",
        "hadithNumber": "1789",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثاني",
        "hadithText": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ فَقَالَ: «أَلَا مَنْ وَلِيَ يَتِيمًا لَهُ مَالٌ فَلْيَتَّجِرْ فِيهِ وَلَا يَتْرُكْهُ حَتَّى تَأْكُلَهُ الصَّدَقَةُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: فِي إِسْنَادِهِ مقَال: لِأَن الْمثنى بن الصَّباح ضَعِيف",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 18,
        "matchingEnglishURN": 5760180,
        "last_updated": null
    },
    {
        "arabicURN": 5617900,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.30",
        "hadithNumber": "1790",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثالث",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ قَالَ: لَمَّا تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ: يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا: لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ على الله \". قَالَ أَبُو بَكْرٍ: وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا. قَالَ عُمَرُ: فَوَاللَّهِ مَا هُوَ إِلَّا أَن رَأَيْت أَن قد شرح الله صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 19,
        "matchingEnglishURN": 5760190,
        "last_updated": null
    },
    {
        "arabicURN": 5617910,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.30",
        "hadithNumber": "1791",
        "bookName": "كتاب الزكاة",
        "babName": "باب - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَفِرُّ مِنْهُ صَاحِبُهُ وَهُوَ يَطْلُبُهُ حَتَّى يُلْقِمَهُ أَصَابِعه» . رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 20,
        "matchingEnglishURN": 5760200,
        "last_updated": null
    },
    {
        "arabicURN": 5617920,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.30",
        "hadithNumber": "1792",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "وَعَنِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ رَجُلٍ لَا يُؤَدِّي زَكَاةَ مَالِهِ إِلَّا جَعَلَ اللَّهُ يَوْمَ الْقِيَامَةِ فِي عُنُقِهِ شُجَاعًا» ثُمَّ قَرَأَ عَلَيْنَا مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ: (وَلَا يَحْسَبَنَّ الَّذِينَ يبلخون بِمَا آتَاهُم الله من فَضله)\nالْآيَة. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 21,
        "matchingEnglishURN": 5760210,
        "last_updated": null
    },
    {
        "arabicURN": 5617930,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "0.30",
        "hadithNumber": "1793",
        "bookName": "كتاب الزكاة",
        "babName": "باب",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا خَالَطَتِ الزَّكَاةُ مَالًا قَطُّ إِلَّا أَهْلَكَتْهُ» . رَوَاهُ الشَّافِعِيُّ وَالْبُخَارِيُّ فِي تَارِيخِهِ وَالْحُمَيْدِيُّ وَزَادَ قَالَ: يَكُونُ قَدْ وَجَبَ عَلَيْكَ صَدَقَةٌ فَلَا تُخْرِجْهَا فَيُهْلِكُ الْحَرَامُ الْحَلَالَ. وَقَدِ احْتَجَّ بِهِ من يرى تعلق الزَّكَاةِ بِالْعَيْنِ هَكَذَا فِي الْمُنْتَقَى\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْ أَحْمَدَ بْنِ حَنْبَلٍ بِإِسْنَادِهِ إِلَى عَائِشَةَ. وَقَالَ أَحْمَدُ فِي «خَالَطَتْ» : تَفْسِيرُهُ أَنَّ الرَّجُلَ يَأْخُذُ الزَّكَاةَ وَهُوَ مُوسِرٌ أَو غَنِي وَإِنَّمَا هِيَ للْفُقَرَاء",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 22,
        "matchingEnglishURN": 5760220,
        "last_updated": null
    },
    {
        "arabicURN": 5617940,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.10",
        "hadithNumber": "1794",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ من الْإِبِل صَدَقَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 23,
        "matchingEnglishURN": 5760230,
        "last_updated": null
    },
    {
        "arabicURN": 5617950,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.10",
        "hadithNumber": "1795",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُسْلِمِ صَدَقَةٌ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ» . وَفِي رِوَايَةٍ قَالَ: «لَيْسَ فِي عَبْدِهِ صَدَقَةٌ إِلَّا صَدَقَةُ الْفِطْرِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 24,
        "matchingEnglishURN": 5760240,
        "last_updated": null
    },
    {
        "arabicURN": 5617960,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.10",
        "hadithNumber": "1796",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الأول",
        "hadithText": "وَعَن أنس بن مَالك: أَن أَبَا بكر رَضِي الله عَنهُ كَتَبَ لَهُ هَذَا الْكِتَابَ لَمَّا وَجَّهَهُ إِلَى الْبَحْرِينِ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ هَذِهِ فَرِيضَةُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ وَالَّتِي أَمَرَ اللَّهُ عز وَجل بهَا رَسُوله فَمن سَأَلَهَا مِنَ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَهَا فَلَا يُعْطِ: فِي أَرْبَعٍ وَعِشْرِينَ مِنَ الْإِبِل فَمَا دونهَا خَمْسٍ شَاةٌ. فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَى فَإِذَا بلغت سِتا وَثَلَاثِينَ فَفِيهَا بنت لبون أُنْثَى. فَإِذا بلغت سِتَّة وَأَرْبَعين إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْجَمَلِ فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ فَفِيهَا جَذَعَة. فَإِذا بلغت سِتا وَسبعين فَفِيهَا بِنْتَا لَبُونٍ. فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْجَمَلِ. فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ. وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ الْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. فَإِذَا بَلَغَتْ خَمْسًا فَفِيهَا شَاةٌ وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ الْإِبِلِ صَدَقَةَ الْجَذَعَةِ وَلَيْسَتْ عِنْده جَذَعَة وَعِنْده حقة فَإِنَّهَا تقبل مِنْهُ الْحِقَّةُ وَيُجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا. وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةَ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ الْحِقَّةُ وَعِنْدَهُ الْجَذَعَةُ فَإِنَّهَا تُقْبَلُ مِنْهُ الْجَذَعَةُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةَ الْحِقَّةِ وَلَيْسَت إِلَّا عِنْده بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ لَبُونٍ وَيُعْطِي مَعهَا شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَمًا. وَمَنْ بَلَغَتْ صَدَقَتُهُ بنت لبون وَعِنْده حقة فَإِنَّهَا تقبل مِنْهُ الْحِقَّةُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ صَدَقَتُهُ بَنْتَ لِبَوْنٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ مَخَاضٍ وَيُعْطَى مَعَهَا عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ صَدَقَتُهُ بَنْتَ مَخَاضٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. فَإِنْ لَمْ تَكُنْ عِنْدَهُ بِنْتُ مَخَاضٍ عَلَى وَجْهِهَا وَعِنْدَهُ ابْن لَبُونٍ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ. وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاة إِلَى عشْرين وَمِائَة شَاة فَإِن زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَان. فَإِن زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثِمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاهٍ. فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ. فَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. وَلَا تُخْرَجَ فِي الصَّدَقَة هرمة وَلَا ذَات عور وَلَا تَيْسٌ إِلَّا مَا شَاءَ الْمُصَدِّقُ. وَلَا يجمع بَين متفرق وَلَا يفرق بَين مُجْتَمع خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ. وَفِي الرِّقَةِ رُبُعُ الْعُشْرِ فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 25,
        "matchingEnglishURN": 5760250,
        "last_updated": null
    },
    {
        "arabicURN": 5617970,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.10",
        "hadithNumber": "1797",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الأول",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ أَوْ كَانَ عَثَرِيًّا الْعُشْرُ. وَمَا سقِِي بالنضح نصف الْعشْر» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 26,
        "matchingEnglishURN": 5760260,
        "last_updated": null
    },
    {
        "arabicURN": 5617980,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.10",
        "hadithNumber": "1798",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «العجماء جرحها جَبَّار والبشر جَبَّار والمعدن جَبَّار وَفِي الرِّكَاز الْخمس»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 27,
        "matchingEnglishURN": 5760270,
        "last_updated": null
    },
    {
        "arabicURN": 5617990,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1799",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة",
        "hadithText": "عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" قَدْ عَفَوْتُ عَنِ الْخَيْلِ وَالرَّقِيقِ فَهَاتُوا صَدَقَةً الرِّقَةِ: مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِي تِسْعِينَ وَمِائَةٍ شَيْءٌ فَإِذَا بَلَغَتْ مِائَتَيْنِ فَفِيهَا خَمْسَةُ دَرَاهِمَ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَفِي رِوَايَةٍ لأبي دَاوُد عَن الْحَارِث عَنْ عَلِيٍّ قَالَ زُهَيْرٌ أَحْسَبُهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \" هَاتُوا رُبْعَ الْعُشْرِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ عَلَيْكُمْ شَيْءٌ حَتَّى تَتِمَّ مِائَتَيْ دِرْهَمٍ. فَإِذَا كَانَتْ مِائَتَيْ دِرْهَمٍ فَفِيهَا خَمْسَةُ دَرَاهِمَ. فَمَا زَادَ فَعَلَى حِسَابِ ذَلِكَ. وَفِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ شَاةً شَاةٌ إِلَى عِشْرِينَ وَمِائَة ز فَإِن زَادَت وَاحِدَة فشاتان إِلَى مِائَتَيْنِ. فَإِن زَادَتْ فَثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِمِائَةٍ فَإِذَا زَادَتْ على ثَلَاث مائَة فَفِي كُلِّ مِائَةٍ شَاةٌ. فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعٌ وَثَلَاثُونَ فَلَيْسَ عَلَيْكَ فِيهَا شَيْءٌ\nوَفِي الْبَقَرِ: فِي كُلِّ ثَلَاثِينَ تَبِيعٌ وَفِي الْأَرْبَعين مُسِنَّة وَلَيْسَ على العوامل شَيْء \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 28,
        "matchingEnglishURN": 5760280,
        "last_updated": null
    },
    {
        "arabicURN": 5618000,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1800",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ مُعَاذٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا وَجَّهَهُ إِلَى الْيَمَنِ أَمْرَهُ أَنْ يَأْخُذَ مِنْ الْبَقَرَة: مِنْ كُلِّ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كل أَرْبَعِينَ مُسِنَّةً. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ والدارمي",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 29,
        "matchingEnglishURN": 5760290,
        "last_updated": null
    },
    {
        "arabicURN": 5618010,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1801",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُعْتَدِي فِي الصَّدَقَةِ كَمَانِعِهَا» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 30,
        "matchingEnglishURN": 5760300,
        "last_updated": null
    },
    {
        "arabicURN": 5618020,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1802",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ فِي حَبٍّ وَلَا تَمْرٍ صَدَقَةٌ حَتَّى يَبْلُغَ خَمْسَةَ أَوْسُقٍ» . رَوَاهُ النَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 31,
        "matchingEnglishURN": 5760310,
        "last_updated": null
    },
    {
        "arabicURN": 5618030,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1803",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ مُوسَى بْنِ طَلْحَةَ قَالَ: عِنْدَنَا كِتَابُ مُعَاذِ بْنِ جَبَلٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: إِنَّمَا أَمَرَهُ أَنْ يَأْخُذَ الصَّدَقَةَ مِنَ الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ. مُرْسل رَوَاهُ فِي شرح السّنة",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 32,
        "matchingEnglishURN": 5760320,
        "last_updated": null
    },
    {
        "arabicURN": 5618040,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1804",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ عَتَّابِ بْنِ أَسِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي زَكَاةِ الْكُرُومِ: «إِنَّهَا تُخْرَصُ كَمَا تُخْرَصُ النَّخْلُ ثُمَّ تُؤَدَّى زَكَاتُهُ زَبِيبًا كَمَا تُؤَدَّى زَكَاةُ النَّخْلِ تَمْرًا» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 33,
        "matchingEnglishURN": 5760330,
        "last_updated": null
    },
    {
        "arabicURN": 5618050,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1805",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا الثُّلُثَ فَإِنْ لَمْ تَدَعُوا الثُّلُثَ فَدَعُوا الرُّبُعَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 34,
        "matchingEnglishURN": 5760340,
        "last_updated": null
    },
    {
        "arabicURN": 5618060,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1806",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يبْعَث عبد الله ابْن رَوَاحَةَ إِلَى يَهُودٍ فَيَخْرُصُ النَّخْلَ حِينَ يَطِيبُ قَبْلَ أَنْ يُؤْكَلَ مِنْهُ. رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 35,
        "matchingEnglishURN": 5760350,
        "last_updated": null
    },
    {
        "arabicURN": 5618070,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1807",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم فِي الْعَمَل: «فِي كُلِّ عَشْرَةِ أَزُقٍّ زِقٌّ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: فِي إِسْنَادِهِ مَقَالٌ وَلَا يَصِحُّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْبَاب كثير شَيْء",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 36,
        "matchingEnglishURN": 5760360,
        "last_updated": null
    },
    {
        "arabicURN": 5618080,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1808",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ فَإِنَّكُنَّ أَكْثَرُ أَهْلِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 37,
        "matchingEnglishURN": 5760370,
        "last_updated": null
    },
    {
        "arabicURN": 5618090,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1809",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ امْرَأَتَيْنِ أَتَتَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي أَيْدِيهِمَا سِوَارَانِ مِنْ ذَهَبٍ فَقَالَ لَهُمَا: «تُؤَدِّيَانِ زَكَاتَهُ؟» قَالَتَا: لَا. فَقَالَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتُحِبَّانِ أَنْ يُسَوِّرَكُمَا اللَّهُ بِسِوَارَيْنِ مِنْ نَارٍ؟» قَالَتَا: لَا. قَالَ: «فَأَدِّيَا زَكَاتَهُ» رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث قد رَوَاهُ الْمُثَنَّى بْنُ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ نَحْوَ هَذَا وَالْمُثَنَّى بْنُ الصَّبَّاحِ وَابْنُ لَهِيعَةَ يُضَعَّفَانِ فِي الْحَدِيثِ وَلَا يَصِحُّ فِي هَذَا الْبَابِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْء",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 38,
        "matchingEnglishURN": 5760380,
        "last_updated": null
    },
    {
        "arabicURN": 5618100,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1810",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كُنْتُ أَلْبَسُ أَوْضَاحًا مِنْ ذَهَبٍ فَقُلْتُ: يَا رَسُولَ اللَّهِ أَكَنْزٌ هُوَ؟ فَقَالَ: «مَا بلغ أَن يُؤدى زَكَاتُهُ فَزُكِّيَ فَلَيْسَ بِكَنْزٍ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 39,
        "matchingEnglishURN": 5760390,
        "last_updated": null
    },
    {
        "arabicURN": 5618110,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1811",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ نُخْرِجَ الصَّدَقَةَ مِنَ الَّذِي نُعِدُّ لِلْبَيْعِ. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 40,
        "matchingEnglishURN": 5760400,
        "last_updated": null
    },
    {
        "arabicURN": 5618120,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.20",
        "hadithNumber": "1812",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ غَيْرِ وَاحِدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ لِبِلَالِ بْنِ الْحَارِثِ الْمُزَنِيِّ معادن الْقبلية وَهِيَ مِنْ نَاحِيَةِ الْفُرْعِ فَتِلْكَ الْمَعَادِنُ لَا تُؤْخَذُ مِنْهَا إِلَّا الزَّكَاةُ إِلَى الْيَوْمِ. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 41,
        "matchingEnglishURN": 5760410,
        "last_updated": null
    },
    {
        "arabicURN": 5618130,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.30",
        "hadithNumber": "1813",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثالث",
        "hadithText": "عَنْ عَلِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ فِي الْخَضْرَاوَاتِ صَدَقَةٌ وَلَا فِي الْعَرَايَا صَدَقَةٌ وَلَا فِي أَقَلَّ مِنْ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِي الْعَوَامِلِ صَدَقَةٌ وَلَا فِي الْجَبْهَةِ صَدَقَةٌ» . قَالَ الصَّقْرُ: الْجَبْهَةُ الْخَيل وَالْبِغَال وَالْعَبِيد. رَوَاهُ الدَّارَقُطْنِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 42,
        "matchingEnglishURN": 5760420,
        "last_updated": null
    },
    {
        "arabicURN": 5618140,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "2.30",
        "hadithNumber": "1814",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة",
        "hadithText": "وَعَنْ طَاوُسٍ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَتَى بِوَقَصِ الْبَقَرِ فَقَالَ: لَمْ يَأْمُرْنِي فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ. رَوَاهُ الدَّارَقُطْنِيُّ وَالشَّافِعِيُّ وَقَالَ: الْوَقَصُ مَا لَمْ يَبْلُغِ الْفَرِيضَةَ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 43,
        "matchingEnglishURN": 5760430,
        "last_updated": null
    },
    {
        "arabicURN": 5618150,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.10",
        "hadithNumber": "1815",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثالث",
        "hadithText": "عَنِ ابْنِ عُمَرَ قَالَ: فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْعَبْدِ وَالْحُرِّ وَالذَّكَرِ وَالْأُنْثَى وَالصَّغِيرِ وَالْكَبِيرِ مِنَ الْمُسْلِمِينَ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاس إِلَى الصَّلَاة",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 44,
        "matchingEnglishURN": 5760440,
        "last_updated": null
    },
    {
        "arabicURN": 5618160,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.10",
        "hadithNumber": "1816",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ أَو صَاعا من شعير أَو صَاعا من تَمْرٍ أَوْ صَاعًا مَنْ أَقِطٍ أَوْ صَاعًا من زبيب",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 45,
        "matchingEnglishURN": 5760450,
        "last_updated": null
    },
    {
        "arabicURN": 5618170,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.20",
        "hadithNumber": "1817",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "عَنِ ابْنِ عَبَّاسٍ قَالَ: فِي آخِرِ رَمَضَانَ أخرجُوا صَدَقَة صومكم. فرض رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الصَّدَقَةَ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ عَلَى كُلِّ حُرٍّ أَوْ مَمْلُوكٍ ذَكَرٍ أَوْ أُنْثَى صَغِيرٍ أَوْ كَبِيرٍ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 46,
        "matchingEnglishURN": 5760460,
        "last_updated": null
    },
    {
        "arabicURN": 5618180,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.20",
        "hadithNumber": "1818",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثاني",
        "hadithText": "وَعَن ابْنِ عَبَّاسٍ قَالَ: فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ طُهْرَ الصِّيَامِ مِنَ اللَّغْوِ وَالرَّفَثِ وَطُعْمَةً لِلْمَسَاكِينِ. رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 47,
        "matchingEnglishURN": 5760470,
        "last_updated": null
    },
    {
        "arabicURN": 5618190,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.30",
        "hadithNumber": "1819",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثالث",
        "hadithText": "عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُنَادِيًا فِي فِجَاجِ مَكَّةَ: «أَلَا إِنَّ صَدَقَةَ الْفِطْرِ وَاجِبَةٌ عَلَى كُلِّ مُسْلِمٍ ذَكَرٍ أَوْ أُنْثَى حُرٍّ أَوْ عَبْدٍ صَغِيرٍ أَوْ كَبِيرٍ مُدَّانِ مِنْ قَمْحٍ أَوْ سِوَاهُ أَوْ صَاع من طَعَام» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 48,
        "matchingEnglishURN": 5760480,
        "last_updated": null
    },
    {
        "arabicURN": 5618200,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "3.30",
        "hadithNumber": "1820",
        "bookName": "كتاب الزكاة",
        "babName": "باب ما يجب فيه الزكاة - الفصل الثالث",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ أَوْ ثَعْلَبَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صُعَيْرٍ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَاعٌ مِنْ بُرٍّ أَوْ قَمْحٍ عَنْ كُلِّ اثْنَيْنِ صَغِيرٍ أَوْ كَبِيرٍ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى. أَمَّا غَنِيُّكُمْ فَيُزَكِّيهِ اللَّهُ. وَأَمَّا فَقِيرُكُمْ فَيَرُدُّ عَلَيْهِ أَكْثَرَ مَا أعطَاهُ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 49,
        "matchingEnglishURN": 5760490,
        "last_updated": null
    },
    {
        "arabicURN": 5618210,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1821",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "عَنْ أَنَسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرَةٍ فِي الطَّرِيقِ فَقَالَ: «لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لأكلتها»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 50,
        "matchingEnglishURN": 5760500,
        "last_updated": null
    },
    {
        "arabicURN": 5618220,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1822",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَخَذَ الْحَسَنُ بْنُ عَلِيٍّ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَجَعَلَهَا فِي فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كِخْ كِخْ» لِيَطْرَحَهَا ثُمَّ قَالَ: «أما شَعرت أَنا لَا نَأْكُل الصَّدَقَة؟»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 51,
        "matchingEnglishURN": 5760510,
        "last_updated": null
    },
    {
        "arabicURN": 5618230,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1823",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ عَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن هَذِهِ الصَّدَقَاتِ إِنَّمَا هِيَ أَوْسَاخُ النَّاسِ وَإِنَّهَا لَا تَحِلُّ لِمُحَمَّدٍ وَلَا لِآلِ مُحَمَّدٍ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 52,
        "matchingEnglishURN": 5760520,
        "last_updated": null
    },
    {
        "arabicURN": 5618240,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1824",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِطَعَامٍ سَأَلَ عَنْهُ: «أَهَدْيَةٌ أَمْ صَدَقَةٌ؟» فَإِنْ قِيلَ: صَدَقَةٌ: قَالَ لِأَصْحَابِهِ: «كُلُوا» وَلَمْ يَأْكُلْ وَإِنْ قِيلَ: هَدِيَّةٌ ضَرَبَ بِيَدِهِ فَأَكَلَ مَعَهم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 53,
        "matchingEnglishURN": 5760530,
        "last_updated": null
    },
    {
        "arabicURN": 5618250,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1825",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ فِي بَرِيرَةَ ثَلَاثُ سُنَنٍ: إِحْدَى السُّنَنِ أَنَّهَا عُتِقَتْ فَخُيِّرَتْ فِي زَوْجِهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْوَلَاءُ لِمَنْ أَعْتَقَ» . وَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْبُرْمَةُ تَفُورُ بِلَحْمٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ: «أَلَمْ أَرَ بُرْمَةً فِيهَا لَحْمٌ؟» قَالُوا: بَلَى وَلَكِنَّ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ وَأَنْتَ لَا تَأْكُلُ الصَّدَقَةَ قَالَ: «هُوَ عَلَيْهَا صَدَقَةٌ وَلنَا هَدِيَّة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 54,
        "matchingEnglishURN": 5760540,
        "last_updated": null
    },
    {
        "arabicURN": 5618260,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1826",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ الْهَدِيَّة ويثيب عَلَيْهَا. رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 55,
        "matchingEnglishURN": 5760550,
        "last_updated": null
    },
    {
        "arabicURN": 5618270,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1827",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ دُعِيتُ إِلَى كُرَاعٍ لَأَجَبْتُ وَلَوْ أُهْدِيَ إِلَيَّ ذِرَاع لقبلت» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 56,
        "matchingEnglishURN": 5760560,
        "last_updated": null
    },
    {
        "arabicURN": 5618280,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.10",
        "hadithNumber": "1828",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ الْمِسْكِينُ الَّذِي يَطُوفُ عَلَى النَّاسِ تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ وَلَكِنَّ الْمِسْكِينَ الَّذِي لَا يَجِدُ غِنًى يُغْنِيهِ وَلَا يُفْطَنُ بِهِ فَيُتَصَدَّقَ عَلَيْهِ وَلَا يَقُومُ فَيَسْأَلَ النَّاس»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 57,
        "matchingEnglishURN": 5760570,
        "last_updated": null
    },
    {
        "arabicURN": 5618290,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.20",
        "hadithNumber": "1829",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثاني",
        "hadithText": "عَنْ أَبِي رَافِعٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا مِنْ بَنِي مَخْزُومٍ عَلَى الصَّدَقَةِ فَقَالَ لِأَبِي رَافِعٍ: اصْحَبْنِي كَيْمَا تُصِيبُ مِنْهَا. فَقَالَ: لَا حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلَهُ. فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ: «إِنَّ الصَّدَقَةَ لَا تَحِلُّ لَنَا وَإِنَّ مَوَالِيَ الْقَوْمِ مِنْ أَنْفُسِهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 58,
        "matchingEnglishURN": 5760580,
        "last_updated": null
    },
    {
        "arabicURN": 5618301,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.20",
        "hadithNumber": "1830, 1831",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي<br><p>\nوَرَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ عَنْ أَبِي هُرَيْرَة",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 59,
        "matchingEnglishURN": 5760590,
        "last_updated": null
    },
    {
        "arabicURN": 5618320,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.20",
        "hadithNumber": "1832",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ قَالَ: أَخْبَرَنِي رَجُلَانِ أَنَّهُمَا أَتَيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي حَجَّةِ الْوَدَاعِ وَهُوَ يُقَسِّمُ الصَّدَقَةَ فَسَأَلَاهُ مِنْهَا فَرَفَعَ فِينَا النَّظَرَ وَخَفَضَهُ فَرَآنَا جَلْدَيْنِ فَقَالَ: «إِنْ شِئْتُمَا أَعْطَيْتُكُمَا وَلَا حَظَّ فِيهَا لِغَنِيٍّ وَلَا لِقَوِيٍّ مكتسب» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 60,
        "matchingEnglishURN": 5760600,
        "last_updated": null
    },
    {
        "arabicURN": 5618331,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.20",
        "hadithNumber": "1833, 1834",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَطَاءِ بْنِ يَسَارٍ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \" لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ: لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ كَانَ لَهُ جَارٌ مِسْكِينٌ فَتَصَدَّقَ عَلَى الْمِسْكِينِ فَأَهْدَى الْمِسْكِين للغني \". رَوَاهُ مَالك وَأَبُو دَاوُد<br><p>\nوَفِي رِوَايَةٍ لِأَبِي دَاوُدَ عَنْ أَبِي سَعِيدٍ: «أوابن السَّبِيل»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647, \\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\",\"priority\":50}]",
        "ourHadithNumber": 61,
        "matchingEnglishURN": 5760610,
        "last_updated": null
    },
    {
        "arabicURN": 5618350,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.20",
        "hadithNumber": "1835",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ زِيَادِ بْنِ الْحَارِثِ الصُّدَائِيِّ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْتُهُ فَذَكَرَ حَدِيثًا طَوِيلًا فَأَتَاهُ رَجُلٌ فَقَالَ: أَعْطِنِي مِنَ الصَّدَقَةِ. فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَمْ يَرْضَ بِحُكْمِ نَبِيٍّ وَلَا غَيْرِهِ فِي الصَّدَقَاتِ حَتَّى حَكَمَ فِيهَا هُوَ فَجَزَّأَهَا ثَمَانِيَةَ أَجْزَاءٍ فَإِنْ كُنْتَ مِنْ تِلْكَ الْأَجْزَاء أَعطيتك» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 62,
        "matchingEnglishURN": 5760620,
        "last_updated": null
    },
    {
        "arabicURN": 5618360,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "4.30",
        "hadithNumber": "1836",
        "bookName": "كتاب الزكاة",
        "babName": "باب ممن لا تحل له الصدقة - الفصل الثالث",
        "hadithText": "عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ: شَرِبَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ لَبَنًا فَأَعْجَبَهُ فَسَأَلَ الَّذِي سَقَاهُ: مِنْ أَيْنَ هَذَا اللَّبَنُ؟ فَأَخْبَرَهُ أَنَّهُ وَرَدَ عَلَى مَاءٍ قَدْ سَمَّاهُ فَإِذَا نَعَمٌ مِنْ نَعَمِ الصَّدَقَةِ وَهُمْ يَسْقُونَ فَحَلَبُوا مِنْ أَلْبَانِهَا فَجَعَلْتُهُ فِي سِقَائِي فَهُوَ هَذَا: فَأدْخل عمر يَده فاستقاءه. رَوَاهُ مَالِكٌ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 63,
        "matchingEnglishURN": 5760630,
        "last_updated": null
    },
    {
        "arabicURN": 5618370,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1837",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "عَن قبيصَة بن مُخَارق الْهِلَالِي قَالَ: تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا. فَقَالَ: «أَقِمْ حَتَّى تَأْتِينَا الصَّدَقَة فنأمر لَك بهَا» . قَالَ ثُمَّ قَالَ: «يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يقوم ثَلَاثَة من ذَوي الحجى مِنْ قَوْمِهِ. لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ فَمَا سِوَاهُنَّ من الْمَسْأَلَة يَا قبيصَة سحتا يأكلها صَاحبهَا سحتا» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 64,
        "matchingEnglishURN": 5760640,
        "last_updated": null
    },
    {
        "arabicURN": 5618380,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1838",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا فَإِنَّمَا يَسْأَلُ جمرا. فليستقل أَو ليستكثر» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 65,
        "matchingEnglishURN": 5760650,
        "last_updated": null
    },
    {
        "arabicURN": 5618390,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1839",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يَزَالُ الرَّجُلُ يَسْأَلُ النَّاسَ حَتَّى يَأْتِيَ يَوْمَ الْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لحم»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 66,
        "matchingEnglishURN": 5760660,
        "last_updated": null
    },
    {
        "arabicURN": 5618400,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1840",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُلْحِفُوا فِي الْمَسْأَلَةِ فوَاللَّه لَا يسألني أحدق مِنْكُمِ شَيْئًا فَتُخْرِجَ لَهُ مَسْأَلَتُهُ مِنِّي شَيْئًا وَأَنَا لَهُ كَارِهٌ فَيُبَارَكَ لَهُ فِيمَا أَعْطَيْتُهُ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 67,
        "matchingEnglishURN": 5760670,
        "last_updated": null
    },
    {
        "arabicURN": 5618410,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1841",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ فَيَأْتِيَ بِحُزْمَةِ حَطَبٍ عَلَى ظَهْرِهِ فَيَبِيعَهَا فَيَكُفَّ اللَّهُ بِهَا وَجْهَهُ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ مَنَعُوهُ» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 68,
        "matchingEnglishURN": 5760680,
        "last_updated": null
    },
    {
        "arabicURN": 5618420,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1842",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ لِي: «يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ. وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى» . قَالَ حَكِيمٌ: فَقُلْتُ: يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 69,
        "matchingEnglishURN": 5760690,
        "last_updated": null
    },
    {
        "arabicURN": 5618430,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1843",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ عَلَى الْمِنْبَرِ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ عَنِ الْمَسْأَلَةِ: «الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَالْيَد الْعليا هِيَ المنفقة وَالْيَد السُّفْلى هِيَ السائلة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 70,
        "matchingEnglishURN": 5760700,
        "last_updated": null
    },
    {
        "arabicURN": 5618440,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1844",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: إِنَّ أُنَاسًا مِنَ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى نَفِدَ مَا عِنْدَهُ. فَقَالَ: «مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعِفَّ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنَ الصَّبْرِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 71,
        "matchingEnglishURN": 5760710,
        "last_updated": null
    },
    {
        "arabicURN": 5618450,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.10",
        "hadithNumber": "1845",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الأول",
        "hadithText": "وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ: أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي. فَقَالَ: «خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخذه. ومالا فَلَا تتبعه نَفسك»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 72,
        "matchingEnglishURN": 5760720,
        "last_updated": null
    },
    {
        "arabicURN": 5618460,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1846",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَسَائِلُ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ أَبْقَى عَلَى وَجْهِهِ وَمَنْ شَاءَ تَرَكَهُ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ فِي أَمْرٍ لَا يَجِدُ مِنْهُ بُدًّا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيّ وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 73,
        "matchingEnglishURN": 5760730,
        "last_updated": null
    },
    {
        "arabicURN": 5618470,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1847",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من سَأَلَ النَّاسَ وَلَهُ مَا يُغْنِيهِ جَاءَ يَوْمَ الْقِيَامَةِ وَمَسْأَلَتُهُ فِي وَجْهِهِ خُمُوشٌ أَوْ خُدُوشٌ أَوْ كُدُوحٌ» . قِيلَ يَا رَسُولَ اللَّهِ وَمَا يُغْنِيهِ؟ قَالَ: «خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنَ الذَّهَبِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 74,
        "matchingEnglishURN": 5760740,
        "last_updated": null
    },
    {
        "arabicURN": 5618480,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1848",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَنْ سَهْلِ بْنِ الْحَنْظَلِيَّةِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ وَعِنْدَهُ مَا يُغْنِيهِ فَإِنَّمَا يَسْتَكْثِرُ مِنَ النَّارِ» . قَالَ النُّفَيْلِيُّ. وَهُوَ أَحَدُ رُوَاتِهِ فِي مَوْضِعٍ آخر: وَمَا الْغنى الَّذِي لَا يَنْبَغِي مَعَهُ الْمَسْأَلَةُ؟ قَالَ: «قَدْرُ مَا يُغَدِّيهِ وَيُعَشِّيهِ» . وَقَالَ فِي مَوْضِعٍ آخَرَ: «أَنْ يَكُونَ لَهُ شِبَعُ يَوْمٍ أَوْ لَيْلَةٍ وَيَوْمٍ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 75,
        "matchingEnglishURN": 5760750,
        "last_updated": null
    },
    {
        "arabicURN": 5618490,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1849",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ بَنِي أَسَدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ مِنْكُمْ وَلَهُ أُوقِيَّةٌ أَوْ عَدْلُهَا فَقَدْ سَأَلَ إِلْحَافًا» . رَوَاهُ مَالك وَأَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 76,
        "matchingEnglishURN": 5760760,
        "last_updated": null
    },
    {
        "arabicURN": 5618500,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1850",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَنْ حُبْشِيِّ بْنِ جُنَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ إِلَّا لِذِي فَقْرٍ مُدْقِعٍ أَوْ غُرْمٍ مُفْظِعٍ وَمَنْ سَأَلَ النَّاسَ لِيُثْرِيَ بِهِ مَالَهُ: كَانَ خُمُوشًا فِي وَجْهِهِ يَوْمَ الْقِيَامَةِ وَرَضْفًا يَأْكُلُهُ مِنْ جَهَنَّمَ فَمَنْ شَاءَ فَلْيَقُلْ وَمَنْ شَاءَ فليكثر \". رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 77,
        "matchingEnglishURN": 5760770,
        "last_updated": null
    },
    {
        "arabicURN": 5618510,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1851",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَن أنس بن مَالك: أَنَّ رَجُلًا مِنَ الْأَنْصَارِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ فَقَالَ: «أَمَا فِي بَيْتك شَيْء؟» قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَعْبٌ نَشْرَبُ فِيهِ مِنَ الْمَاءِ. قَالَ: «ائْتِنِي بِهِمَا» قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ: «مَنْ يَشْتَرِي هَذَيْنِ؟» قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ قَالَ: «مَنْ يَزِيدُ عَلَى دِرْهَمٍ؟» مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ رجل أَنا آخذهما بِدِرْهَمَيْنِ فَأَعْطَاهُمَا إِيَّاه وَأخذ الدِّرْهَمَيْنِ فَأَعْطَاهُمَا الْأَنْصَارِيُّ وَقَالَ: «اشْتَرِ بِأَحَدِهِمَا طَعَامًا فانبذه إِلَى أهلك واشتر بِالْآخرِ قدومًا فأتني بِهِ» . فَأَتَاهُ بِهِ فَشَدَّ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُودًا بِيَدِهِ ثُمَّ قَالَ لَهُ اذْهَبْ فَاحْتَطِبْ وَبِعْ وَلَا أَرَيَنَّكَ خَمْسَةَ عَشَرَ يَوْمًا \". فَذهب الرجل يحتطب وَيبِيع فجَاء وَقَدْ أَصَابَ عَشَرَةَ دَرَاهِمَ فَاشْتَرَى بِبَعْضِهَا ثَوْبًا وَبِبَعْضِهَا طَعَامًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ الْمَسْأَلَةُ نُكْتَةً فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لَا تَصْلُحُ إِلَّا لِثَلَاثَةٍ لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ لِذِي دَمٍ مُوجِعٍ» . رَوَاهُ أَبُو دَاوُدَ وَرَوَى ابْن مَاجَه إِلَى قَوْله: «يَوْم الْقِيَامَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 78,
        "matchingEnglishURN": 5760780,
        "last_updated": null
    },
    {
        "arabicURN": 5618520,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.20",
        "hadithNumber": "1852",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَتْهُ فَاقَةٌ فَأَنْزَلَهَا بِالنَّاسِ لَمْ تُسَدَّ فَاقَتُهُ. وَمَنْ أَنْزَلَهَا بِاللَّه أوشك الله لَهُ بالغنى إِمَّا بِمَوْتٍ عَاجِلٍ أَوْ غِنًى آجِلٍ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u062d\\u0633\\u0646\", \"priority\": 50}]",
        "ourHadithNumber": 79,
        "matchingEnglishURN": 5760790,
        "last_updated": null
    },
    {
        "arabicURN": 5618530,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1853",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "عَنِ ابْنِ الْفِرَاسِيِّ أَنَّ الْفِرَاسِيَّ قَالَ: قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ يَا رَسُولَ اللَّهِ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا وَإِن كنت لابد فسل الصَّالِحين» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 80,
        "matchingEnglishURN": 5760800,
        "last_updated": null
    },
    {
        "arabicURN": 5618540,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1854",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "وَعَن ابْن السَّاعِدِيّ الْمَالِكِي أَنه قَالَ: استعملني عمر بن الْخطاب رَضِي الله عَنْهُم عَلَى الصَّدَقَةِ فَلَمَّا فَرَغْتُ مِنْهَا وَأَدَّيْتُهَا إِلَيْهِ أَمَرَ لِي بِعُمَالَةٍ فَقُلْتُ إِنَّمَا عَمِلْتُ لِلَّهِ وَأجْرِي على الله فَقَالَ خُذْ مَا أُعْطِيتَ فَإِنِّي قَدْ عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَمَّلَنِي فَقُلْتُ مِثْلَ قَوْلِكَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أُعْطِيتَ شَيْئا من غير أَن تسْأَل فَكل وَتصدق» . رَوَاهُ مُسلم وَأَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 81,
        "matchingEnglishURN": 5760810,
        "last_updated": null
    },
    {
        "arabicURN": 5618550,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1855",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ يَوْمَ عَرَفَةَ رَجُلًا يَسْأَلُ النَّاسَ فَقَالَ: أَفِي هَذَا الْيَوْمِ: وَفِي هَذَا الْمَكَانِ تسْأَل من يغر الله؟ فخفقه بِالدرةِ. رَوَاهُ رزين",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 82,
        "matchingEnglishURN": 5760820,
        "last_updated": null
    },
    {
        "arabicURN": 5618560,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1856",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "وَعَن عمر رَضِي الله عَنهُ قَالَ: تَعْلَمُنَّ أَيُّهَا النَّاسُ أَنَّ الطَّمَعَ فَقْرٌ وَأَنَّ الْإِيَاسَ غِنًى وَأَنَّ الْمَرْءَ إِذَا يَئِسَ عَن شَيْء اسْتغنى عَنهُ. رَوَاهُ رزين",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 83,
        "matchingEnglishURN": 5760830,
        "last_updated": null
    },
    {
        "arabicURN": 5618570,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1857",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَكْفُلُ لِي أَنْ لَا يَسْأَلَ النَّاسَ شَيْئًا فَأَتَكَفَّلَ لَهُ بِالْجَنَّةِ؟» فَقَالَ ثَوْبَانُ: أَنَا فَكَانَ لَا يَسْأَلُ أَحَدًا شَيْئا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 84,
        "matchingEnglishURN": 5760840,
        "last_updated": null
    },
    {
        "arabicURN": 5618580,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "5.30",
        "hadithNumber": "1858",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا تحل له المسألة ومن تحل له - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَشْتَرِطُ عَلَيَّ: «أَنْ لَا تَسْأَلَ النَّاسَ شَيْئًا» قُلْتُ: نَعَمْ. قَالَ: «وَلَا سَوْطَكَ إِنْ سَقَطَ مِنْكَ حَتَّى تنزل إِلَيْهِ فتأخذه» . رَوَاهُ أَحْمَدُ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 85,
        "matchingEnglishURN": 5760850,
        "last_updated": null
    },
    {
        "arabicURN": 5618590,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1859",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا لَسَرَّنِي أَنْ لَا يَمُرَّ عَلَيَّ ثَلَاثُ لَيَالٍ وَعِنْدِي مِنْهُ شَيْءٌ إِلَّا شَيْءٌ أَرْصُدُهُ لِدَيْنٍ» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 86,
        "matchingEnglishURN": 5760860,
        "last_updated": null
    },
    {
        "arabicURN": 5618600,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1860",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مَلَكَانِ يَنْزِلَانِ فَيَقُولُ أَحَدُهُمَا: اللَّهُمَّ أطع مُنْفِقًا خَلَفًا وَيَقُولُ الْآخَرُ: اللَّهُمَّ أَعْطِ مُمْسِكًا تلفا \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 87,
        "matchingEnglishURN": 5760870,
        "last_updated": null
    },
    {
        "arabicURN": 5618610,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1861",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَسْمَاءَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَفِقِي وَلَا تُحْصِي فَيُحْصِيَ اللَّهُ عَلَيْكِ وَلَا تُوعِي فَيُوعِيَ اللَّهُ عَلَيْكِ ارْضَخِي مَا اسْتَطَعْتِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 88,
        "matchingEnglishURN": 5760880,
        "last_updated": null
    },
    {
        "arabicURN": 5618620,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1862",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" قَالَ اللَّهُ تَعَالَى: أَنْفِقْ يَا ابْن آدم أنْفق عَلَيْك \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 89,
        "matchingEnglishURN": 5760890,
        "last_updated": null
    },
    {
        "arabicURN": 5618630,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1863",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا ابْنَ آدَمَ إِنْ تَبْذُلِ الْفَضْلَ خَيْرٌ لَكَ وَإِنْ تُمْسِكْهُ شَرٌّ لَكَ وَلَا تُلَامُ عَلَى كَفَافٍ وَابْدَأْ بِمن تعول» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 90,
        "matchingEnglishURN": 5760900,
        "last_updated": null
    },
    {
        "arabicURN": 5618640,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1864",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ قَدِ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدُيِّهِمَا وَتَرَاقِيهِمَا فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدقَة انبسطت عَنهُ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ وَأَخَذَتْ كُلُّ حَلقَة بمكانها»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 91,
        "matchingEnglishURN": 5760910,
        "last_updated": null
    },
    {
        "arabicURN": 5618650,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1865",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ: حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمهمْ \". رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 92,
        "matchingEnglishURN": 5760920,
        "last_updated": null
    },
    {
        "arabicURN": 5618660,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1866",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ حَارِثَةَ بْنِ وَهْبٌ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" تصدقوا فَإِنَّهُ يَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَلَا يَجِدُ مَنْ يَقْبَلُهَا يَقُولُ الرَّجُلُ: لَوْ جِئْت بهَا بِالْأَمْسِ لَقَبِلْتُهَا فَأَمَّا الْيَوْمَ فَلَا حَاجَةَ لِي بهَا \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 93,
        "matchingEnglishURN": 5760930,
        "last_updated": null
    },
    {
        "arabicURN": 5618670,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1867",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَعْظَمُ أَجْرًا؟ قَالَ: \" أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَخْشَى الْفَقْرَ وَتَأْمُلُ الْغِنَى وَلَا تُمْهِلَ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ: لِفُلَانٍ كَذَا وَلِفُلَانٍ كَذَا وَقَدْ كَانَ لِفُلَانٍ \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 94,
        "matchingEnglishURN": 5760940,
        "last_updated": null
    },
    {
        "arabicURN": 5618680,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.10",
        "hadithNumber": "1868",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَلَمَّا رَآنِي قَالَ: «هُمُ الْأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ» فَقُلْتُ: فَدَاكَ أَبِي وَأُمِّي مَنْ هُمْ؟ قَالَ: \" هُمُ الْأَكْثَرُونَ أَمْوَالًا إِلَّا مَنْ قَالَ: هَكَذَا وَهَكَذَا وَهَكَذَا مِنْ بَين يَدَيْهِ وَمن خَلفه وعني مينه وَعَن شِمَاله وَقَلِيل مَا هم \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 95,
        "matchingEnglishURN": 5760950,
        "last_updated": null
    },
    {
        "arabicURN": 5618690,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1869",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّخِيُّ قَرِيبٌ مِنَ اللَّهِ قَرِيبٌ مِنَ الْجَنَّةِ قَرِيبٌ مِنَ النَّاسِ بَعِيدٌ مِنَ النَّارِ. وَالْبَخِيلُ بَعِيدٌ مِنَ اللَّهِ بَعِيدٌ مِنَ الْجَنَّةِ بَعِيدٌ مِنَ النَّاسِ قَرِيبٌ مِنَ النَّارِ. وَلَجَاهِلٌ سَخِيٌّ أَحَبُّ إِلَى اللَّهِ مِنْ عَابِدٍ بَخِيلٍ» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641 \\u062c\\u062f\\u0627\", \"priority\": 50}]",
        "ourHadithNumber": 96,
        "matchingEnglishURN": 5760960,
        "last_updated": null
    },
    {
        "arabicURN": 5618700,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1870",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَتَصَدَّقَ الْمَرْءُ فِي حَيَاتِهِ بِدِرْهَمٍ خَيْرٌ لَهُ مِنْ أَنْ يَتَصَدَّقَ بِمِائَةٍ عِنْدِ مَوته» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 97,
        "matchingEnglishURN": 5760970,
        "last_updated": null
    },
    {
        "arabicURN": 5618710,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1871",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الَّذِي يَتَصَدَّقُ عِنْدَ مَوْتِهِ أَوْ يُعْتِقُ كَالَّذِي يُهْدِي إِذَا شَبِعَ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ والدارمي وَالتِّرْمِذِيّ وَصحح",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 98,
        "matchingEnglishURN": 5760980,
        "last_updated": null
    },
    {
        "arabicURN": 5618720,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1872",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \" خصلتان لَا تجتمعان فِي مُؤْمِنٍ: الْبُخْلُ وَسُوءُ الْخُلُقِ \". رَوَاهُ التِّرْمِذِيُّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 99,
        "matchingEnglishURN": 5760990,
        "last_updated": null
    },
    {
        "arabicURN": 5618730,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1873",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ خِبٌّ وَلَا بَخِيلٌ وَلَا منان» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 100,
        "matchingEnglishURN": 5761000,
        "last_updated": null
    },
    {
        "arabicURN": 5618740,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.20",
        "hadithNumber": "1874",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «شَرُّ مَا فِي الرَّجُلِ شُحٌّ هَالِعٌ وَجُبْنٌ خَالِعٌ» . رَوَاهُ أَبُو دَاوُدَ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 101,
        "matchingEnglishURN": 5761010,
        "last_updated": null
    },
    {
        "arabicURN": 5618750,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1875",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّنَا أَسْرَعُ بِكَ لُحُوقًا؟ قَالَ: \" أَطْوَلُكُنَّ يَدًا فَأَخَذُوا قَصَبَةً يَذْرَعُونَهَا فَكَانَت سَوْدَة أَطْوَلهنَّ يدا فَعلمنَا بعد أَنما كَانَت طُولُ يَدِهَا الصَّدَقَةَ وَكَانَتْ أَسْرَعَنَا لُحُوقًا بِهِ زَيْنَبُ وَكَانَتْ تُحِبُّ الصَّدَقَةَ. رَوَاهُ الْبُخَارِيُّ. وَفِي رِوَايَةِ مُسْلِمٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَسْرَعكُنَّ لُحُوقا بَين أَطْوَلكُنَّ يَدًا» . قَالَتْ: فَكَانَتْ أَطْوَلَنَا يَدًا زَيْنَبُ؟ لِأَنَّهَا كَانَت تعْمل بِيَدِهَا وَتَتَصَدَّق",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 102,
        "matchingEnglishURN": 5761030,
        "last_updated": null
    },
    {
        "arabicURN": 5618760,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1876",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" قَالَ رَجُلٌ: لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تصدق عَلَى سَارِقٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِقٍ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدي زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لَأَتَصَدَّقَنَّ بِصَدقَة فَخرج بِصَدَقَتِهِ فوضعها فِي يَدي غَنِي فَأَصْبحُوا يتحدثون تصدق عَلَى غَنِيٍّ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِق وعَلى زَانِيَة وعَلى غَنِي فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ عَلَى سَارِقٍ فَلَعَلَّهُ أَنْ يَسْتَعِفَّ عَنْ سَرِقَتِهِ وَأَمَّا الزَّانِيَةُ فَلَعَلَّهَا أَنْ تَسْتَعِفَّ عَنْ زِنَاهَا وَأَمَّا الْغَنِيُّ فَلَعَلَّهُ يَعْتَبِرُ فَيُنْفِقَ مِمَّا أَعْطَاهُ اللَّهُ \". مُتَّفَقٌ عَلَيْهِ وَلَفظه للْبُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 103,
        "matchingEnglishURN": 5761040,
        "last_updated": null
    },
    {
        "arabicURN": 5618770,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1877",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَا رَجُلٌ بِفَلَاةٍ مِنَ الْأَرْضِ فَسَمِعَ صَوْتًا فِي سَحَابَةٍ اسْقِ حَدِيقَةَ فُلَانٍ فَتَنَحَّى ذَلِكَ السَّحَابُ فَأَفْرَغَ مَاءَهُ فِي حَرَّةٍ فَإِذَا شَرْجَةٌ مِنْ تِلْكَ الشِّرَاجِ قَدِ اسْتَوْعَبَتْ ذَلِكَ الْمَاءَ كُلَّهُ فَتَتَبَّعَ الْمَاءَ فَإِذَا رَجُلٌ قَائِمٌ فِي حَدِيقَتِهِ يُحَوِّلُ الْمَاءَ بِمِسْحَاتِهِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ مَا اسْمُكَ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ لِمَ تَسْأَلُنِي عَنِ اسْمِي فَقَالَ إِنِّي سَمِعْتُ صَوْتًا فِي السَّحَابِ الَّذِي هَذَا مَاؤُهُ يَقُول اسْقِ حَدِيقَةَ فُلَانٍ لِاسْمِكَ فَمَا تَصْنَعُ فِيهَا قَالَ أما إِذْ قُلْتَ هَذَا فَإِنِّي أَنْظُرُ إِلَى مَا يَخْرُجُ مِنْهَا فَأَتَصَدَّقُ بِثُلُثِهِ وَآكُلُ أَنَا وَعِيَالِي ثُلُثًا وأرد فِيهَا ثلثه» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 104,
        "matchingEnglishURN": 5761050,
        "last_updated": null
    },
    {
        "arabicURN": 5618780,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1878",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَن أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ ثَلَاثَة فِي بَنِي إِسْرَائِيلَ أَبْرَصَ وَأَقْرَعَ وَأَعْمَى فَأَرَادَ اللَّهُ أَنْ يَبْتَلِيَهُمْ فَبَعَثَ إِلَيْهِمْ مَلَكًا فَأَتَى الْأَبْرَصَ فَقَالَ أَيُّ شَيْءٍ أَحَبُّ إِلَيْكَ قَالَ لَوْنٌ حَسَنٌ وَجِلْدٌ حَسَنٌ وَيَذْهَبُ عَنِّي الَّذِي قَدْ قَذِرَنِي النَّاسُ» قَالَ: «فَمَسَحَهُ فَذَهَبَ عَنْهُ قَذَرُهُ وَأُعْطِيَ لَوْنًا حَسَنًا وَجِلْدًا حَسَنًا قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْإِبِلُ - أَوْ قَالَ الْبَقر شكّ إِسْحَق - إِلَّا أَنَّ الْأَبْرَصَ أَوِ الْأَقْرَعَ قَالَ أَحَدُهُمَا الْإِبِلُ وَقَالَ الْآخَرُ الْبَقَرُ قَالَ فَأُعْطِيَ نَاقَةً عُشَرَاءَ فَقَالَ بَارَكَ اللَّهُ لَكَ فِيهَا» قَالَ: «فَأتى الْأَقْرَع فَقَالَ أَي شَيْء أحب إِلَيْك قَالَ شَعَرٌ حَسَنٌ وَيَذْهَبُ عَنِّي هَذَا الَّذِي قَدْ قَذِرَنِي النَّاسُ» . قَالَ: \" فَمَسَحَهُ فَذَهَبَ عَنْهُ وَأُعْطِيَ شَعَرًا حَسَنًا قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْبَقَرُ فَأُعْطِيَ بَقَرَةً حَامِلًا قَالَ: «بَارَكَ اللَّهُ لَكَ فِيهَا» قَالَ: «فَأَتَى الْأَعْمَى فَقَالَ أَيُّ شَيْءٍ أَحَبُّ إِلَيْكَ قَالَ أَنْ يَرُدَّ اللَّهُ إِلَيَّ بَصَرِي فَأُبْصِرَ بِهِ النَّاسَ» . قَالَ: «فَمَسَحَهُ فَرَدَّ اللَّهُ إِلَيْهِ بَصَرَهُ قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْغَنَمُ فَأُعْطِيَ شَاة والدا فأنتج هَذَانِ وَولد هَذَا قَالَ فَكَانَ لِهَذَا وَادٍ مِنِ الْإِبِلِ وَلِهَذَا وَادٍ مِنَ الْبَقَرِ وَلِهَذَا وَادٍ مِنَ الْغَنَمِ» . قَالَ: «ثُمَّ إِنَّهُ أَتَى الْأَبْرَصَ فِي صُورَتِهِ وَهَيْئَتِهِ فَقَالَ رَجُلٌ مِسْكِينٌ قَدِ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلَا بَلَاغَ لِيَ الْيَوْمَ إِلَّا بِاللَّهِ ثُمَّ بِكَ أَسْأَلُكَ بِالَّذِي أَعْطَاكَ اللَّوْنَ الْحسن وَالْجَلد الْحسن وَالْمَال بَعِيرًا أتبلغ عَلَيْهِ فِي سَفَرِي فَقَالَ الْحُقُوق كَثِيرَة فَقَالَ لَهُ كَأَنِّي أَعْرِفُكَ أَلَمْ تَكُنْ أَبْرَصَ يَقْذَرُكَ النَّاسُ فَقِيرًا فَأَعْطَاكَ اللَّهُ مَالًا فَقَالَ إِنَّمَا وَرِثْتُ هَذَا الْمَالَ كَابِرًا عَنْ كَابِرٍ فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا كُنْتَ» . قَالَ: «وَأَتَى الْأَقْرَعَ فِي صُورَتِهِ فَقَالَ لَهُ مِثْلَ مَا قَالَ لِهَذَا وَرَدَّ عَلَيْهِ مِثْلَ مَا رَدَّ عَلَى هَذَا فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا كُنْتَ» . قَالَ: «وَأَتَى الْأَعْمَى فِي صُورَتِهِ وَهَيْئَتِهِ فَقَالَ رَجُلٌ مِسْكِينٌ وَابْنُ سَبِيلٍ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلَا بَلَاغَ لِيَ الْيَوْمَ إِلَّا بِاللَّهِ ثُمَّ بِكَ أَسْأَلُكَ بِالَّذِي رَدَّ عَلَيْكَ بَصَرَكَ شَاةً أَتَبَلَّغُ بِهَا فِي سَفَرِي فَقَالَ قَدْ كُنْتُ أَعْمَى فَرَدَّ اللَّهُ إِلَيَّ بَصَرِي فَخُذْ مَا شِئْتَ وَدَعْ مَا شِئْتَ فَوَاللَّهِ لَا أجهدك الْيَوْم شَيْئا أَخَذْتَهُ لِلَّهِ فَقَالَ أَمْسِكْ مَالَكَ فَإِنَّمَا ابْتُلِيتُمْ فقد رَضِي عَنْك وَسخط على صاحبيك»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 105,
        "matchingEnglishURN": 5761060,
        "last_updated": null
    },
    {
        "arabicURN": 5618790,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1879",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَن أم بجيد قَالَتْ: قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ الْمِسْكِينَ لِيَقِفُ عَلَى بَابِي حَتَّى أَسْتَحْيِيَ فَلَا أَجِدُ فِي بَيْتِي مَا أَدْفَعُ فِي يَدِهِ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ادْفَعِي فِي يَدِهِ وَلَوْ ظِلْفًا مُحْرَقًا» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 106,
        "matchingEnglishURN": 5761070,
        "last_updated": null
    },
    {
        "arabicURN": 5618800,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1880",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَن مولى لعُثْمَان رَضِي الله عَنهُ قَالَ: أُهْدِيَ لِأُمِّ سَلَمَةَ بُضْعَةٌ مِنْ لَحْمٍ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ اللَّحْمُ فَقَالَتْ لِلْخَادِمِ: ضَعِيهِ فِي الْبَيْتِ لَعَلَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُهُ فَوَضَعَتْهُ فِي كَوَّةِ الْبَيْتِ. وَجَاءَ سَائِلٌ فَقَامَ عَلَى الْبَابِ فَقَالَ: تَصَدَّقُوا بَارَكَ اللَّهُ فِيكُمْ. فَقَالُوا: بَارَكَ اللَّهُ فِيكَ. فَذَهَبَ السَّائِلُ فَدَخَلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَمَّ سَلَمَةَ هَلْ عِنْدَكُمْ شَيْءٌ أَطْعَمُهُ؟» . فَقَالَتْ: نَعَمْ. قَالَتْ لِلْخَادِمِ: اذْهَبِي فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكِ اللَّحْمِ. فَذَهَبَتْ فَلَمْ تَجِدْ فِي الْكَوَّةِ إِلَّا قِطْعَةَ مَرْوَةٍ فَقَالَ النَّبِي صلى الله عَلَيْهِ وَسلم: «فَإِن ذَلِك اللَّحْمَ عَادَ مَرْوَةً لِمَا لَمْ تُعْطُوهُ السَّائِلَ» . رَوَاهُ الْبَيْهَقِيّ فِي دَلَائِل النُّبُوَّة",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 107,
        "matchingEnglishURN": 5761080,
        "last_updated": null
    },
    {
        "arabicURN": 5618810,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1881",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَن ابْن عَبَّاس رَضِي الله عَنْهُمَا قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" أَلَا أُخْبِرُكُمْ بِشَرِّ النَّاسِ مَنْزِلًا؟ قِيلَ: نَعَمْ قَالَ: الَّذِي يُسْأَلُ بِاللَّهِ وَلَا يُعْطِي بِهِ \". رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 108,
        "matchingEnglishURN": 5761090,
        "last_updated": null
    },
    {
        "arabicURN": 5618820,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1882",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ أَنَّهُ اسْتَأْذَنَ عَلَى عُثْمَانَ فَأَذِنَ لَهُ وَبِيَدِهِ عَصَاهُ فَقَالَ عُثْمَانُ: يَا كَعْبُ إِنَّ عَبْدَ الرَّحْمَنِ تُوُفِّيَ وَتَرَكَ مَالًا فَمَا تَرَى فِيهِ؟ فَقَالَ: إِنْ كَانَ يَصِلُ فِيهِ حَقَّ اللَّهِ فَلَا بَأْسَ عَلَيْهِ. فَرَفَعَ أَبُو ذَرٍّ عَصَاهُ فَضَرَبَ كَعْبًا وَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أُحِبُّ لَوْ أَنَّ لِي هَذَا الْجَبَلَ ذَهَبًا أُنْفِقُهُ وَيُتَقَبَّلُ مِنِّي أَذَرُ خَلْفِي مِنْهُ سِتَّ أَوَاقِيَّ» . أَنْشُدُكَ بِاللَّهِ يَا عُثْمَانُ أَسَمِعْتَهُ؟ ثَلَاثَ مَرَّاتٍ. قَالَ: نعم. رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 109,
        "matchingEnglishURN": 5761100,
        "last_updated": null
    },
    {
        "arabicURN": 5618830,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1883",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ: صَلَّيْتُ وَرَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ الْعَصْرَ فَسَلَّمَ ثُمَّ قَامَ مُسْرِعًا فَتَخَطَّى رِقَابَ النَّاسِ إِلَى بَعْضِ حُجَرِ نِسَائِهِ فَفَزِعَ النَّاسُ مِنْ سُرْعَتِهِ فَخَرَجَ عَلَيْهِمْ فَرَأَى أَنَّهُمْ قَدْ عَجِبُوا مِنْ سُرْعَتِهِ قَالَ: «ذَكَرْتُ شَيْئًا مِنْ تِبْرٍ عِنْدَنَا فَكَرِهْتُ أَنْ يَحْبِسَنِي فَأَمَرْتُ بِقِسْمَتِهِ» . رَوَاهُ الْبُخَارِيُّ. وَفِي رِوَايَةٍ لَهُ قَالَ: «كُنْتُ خَلَّفْتُ فِي الْبَيْتِ تِبْرًا مِنَ الصَّدَقَةِ فَكَرِهْتُ أَنْ أبيته»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 110,
        "matchingEnglishURN": 5761110,
        "last_updated": null
    },
    {
        "arabicURN": 5618840,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1884",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدِي فِي مَرضه سِتَّةُ دَنَانِيرَ أَوْ سَبْعَةٌ فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُفَرِّقَهَا فَشَغَلَنِي وَجَعُ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ سَأَلَنِي عَنْهَا: «مَا فَعَلَتِ السِّتَّةُ أَوِ السَّبْعَة؟» قلت: لَا وَالله لقد كَانَ شَغَلَنِي وَجَعُكَ فَدَعَا بِهَا ثُمَّ وَضَعَهَا فِي كَفِّهِ فَقَالَ: «مَا ظَنُّ نَبِيِّ اللَّهِ لَوْ لَقِيَ اللَّهَ عَزَّ وَجَلَّ وَهَذِهِ عِنْدَهُ؟» . رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 111,
        "matchingEnglishURN": 5761120,
        "last_updated": null
    },
    {
        "arabicURN": 5618850,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1885",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى بِلَالٍ وَعِنْدَهُ صُبْرَةٌ مِنْ تَمْرٍ فَقَالَ: «مَا هَذَا يَا بِلَالُ؟» قَالَ: شَيْءٌ ادَّخَرْتُهُ لِغَدٍ. فَقَالَ: «أَمَا تَخْشَى أَنْ تَرَى لَهُ غَدًا بخارا فِي نَار جَهَنَّمَ يَوْمَ الْقِيَامَةِ أَنْفِقْ بِلَالُ وَلَا تَخْشَ من ذِي الْعَرْش إقلالا»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 112,
        "matchingEnglishURN": 5761130,
        "last_updated": null
    },
    {
        "arabicURN": 5618860,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1886",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّخَاءُ شَجَرَةٌ فِي الْجَنَّةِ فَمَنْ كَانَ سَخِيًّا أَخَذَ بِغُصْنٍ مِنْهَا فَلَمْ يَتْرُكْهُ الْغُصْنُ حَتَّى يُدْخِلَهُ الْجَنَّةَ. وَالشُّحُّ شَجَرَةٌ فِي النَّارِ فَمَنْ كَانَ شَحِيحًا أَخَذَ بِغُصْنٍ مِنْهَا فَلَمْ يَتْرُكْهُ الْغُصْنُ حَتَّى يُدْخِلَهُ النَّارَ» . رَوَاهُمَا الْبَيْهَقِيُّ فِي شعب الْإِيمَان",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 113,
        "matchingEnglishURN": 5761140,
        "last_updated": null
    },
    {
        "arabicURN": 5618870,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "6.30",
        "hadithNumber": "1887",
        "bookName": "كتاب الزكاة",
        "babName": "باب الإنفاق وكراهية الإمساك - الفصل الثالث",
        "hadithText": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَادِرُوا بِالصَّدَقَةِ فَإِنَّ الْبَلَاءَ لَا يَتَخَطَّاهَا» . رَوَاهُ رَزِينٌ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 114,
        "matchingEnglishURN": 5761150,
        "last_updated": null
    },
    {
        "arabicURN": 5618880,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1888",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَصَدَّقَ بِعَدْلِ تَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا الطَّيِّبَ فَإِنَّ اللَّهَ يَتَقَبَّلُهَا بِيَمِينِهِ ثُمَّ يُرَبِّيهَا لِصَاحِبِهَا كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ حَتَّى تَكُونَ مِثْلَ الْجَبَل»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 115,
        "matchingEnglishURN": 5761160,
        "last_updated": null
    },
    {
        "arabicURN": 5618890,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1889",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا نقصت صَدَقَة من مَال شَيْئا وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ اللَّهُ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 116,
        "matchingEnglishURN": 5761170,
        "last_updated": null
    },
    {
        "arabicURN": 5618900,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1890",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَيْءٍ مِنَ الْأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَاب الْجنَّة واللجنة أَبْوَابٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلَاةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَاد دعِي من بَاب الْجِهَاد وَمن كَانَ مَنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ» . فَقَالَ أَبُو بَكْرٍ: مَا عَلَى مَنْ دُعِيَ مِنْ تِلْكَ الْأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الْأَبْوَابِ كُلِّهَا؟ قَالَ: «نعم وَأَرْجُو أَن تكون مِنْهُم»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 117,
        "matchingEnglishURN": 5761180,
        "last_updated": null
    },
    {
        "arabicURN": 5618910,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1891",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصْبَحَ مِنْكُمُ الْيَوْمَ صَائِمًا؟» قَالَ أَبُو بكر: أَنا قَالَ: «فن تَبِعَ مِنْكُمُ الْيَوْمَ جِنَازَةً؟» قَالَ أَبُو بَكْرٍ: أَنَا. قَالَ: «فَمَنْ أَطْعَمَ مِنْكُمُ الْيَوْمَ مِسْكِينًا؟» قَالَ أَبُو بَكْرٍ: أَنَا. قَالَ: «فَمَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا؟» . قَالَ أَبُو بَكْرٍ: أَنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا اجْتَمَعْنَ فِي امْرِئٍ إِلَّا دَخَلَ الْجَنَّةَ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 118,
        "matchingEnglishURN": 5761190,
        "last_updated": null
    },
    {
        "arabicURN": 5618920,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1892",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا نِسَاءَ الْمُسْلِمَاتِ لَا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 119,
        "matchingEnglishURN": 5761200,
        "last_updated": null
    },
    {
        "arabicURN": 5618930,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1893",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ جَابِرٍ وَحُذَيْفَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مَعْرُوف صَدَقَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 120,
        "matchingEnglishURN": 5761210,
        "last_updated": null
    },
    {
        "arabicURN": 5618940,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1894",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طليق» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 121,
        "matchingEnglishURN": 5761220,
        "last_updated": null
    },
    {
        "arabicURN": 5618950,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1895",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ» . قَالُوا: فَإِنْ لَمْ يَجِدْ؟ قَالَ: «فَلْيَعْمَلْ بِيَدَيْهِ فَيَنْفَعَ نَفْسَهُ وَيَتَصَدَّقَ» . قَالُوا: فَإِنْ لَمْ يَسْتَطِعْ؟ أَوْ لَمْ يَفْعَلْ؟ قَالَ: «فيعين ذَا الْحَاجَةِ الْمَلْهُوفَ» . قَالُوا: فَإِنْ لَمْ يَفْعَلْهُ؟ قَالَ: «فيأمر بِالْخَيرِ» . قَالُوا: فَإِن لمي فعل؟ قَالَ: «فَيمسك عَن الشَّرّ فَإِنَّهُ لَهُ صَدَقَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 122,
        "matchingEnglishURN": 5761230,
        "last_updated": null
    },
    {
        "arabicURN": 5618960,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1896",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" كُلُّ سُلَامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ: كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ يَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَيُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ فَيَحْمِلُ عَلَيْهَا أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ والكلمة الطّيبَة صَدَقَة وكل خطْوَة تخطوها إِلَى الصَّلَاةِ صَدَقَةٌ وَيُمِيطُ الْأَذَى عَنِ الطَّرِيقِ صَدَقَة \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 123,
        "matchingEnglishURN": 5761240,
        "last_updated": null
    },
    {
        "arabicURN": 5618970,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1897",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَلَقَ كُلَّ إِنْسَانٍ مِنْ بَنِي آدَمَ عَلَى سِتِّينَ وَثَلَاثِمِائَةِ مَفْصِلٍ فَمَنْ كَبَّرَ اللَّهَ وَحَمِدَ اللَّهَ وَهَلَّلَ اللَّهَ وَسَبَّحَ اللَّهَ وَاسْتَغْفَرَ اللَّهَ وَعَزَلَ حَجَرًا عَنْ طَرِيقِ النَّاسِ أَوْ شَوْكَةً أَوْ عَظْمًا أَوْ أَمَرَ بِمَعْرُوفٍ أَوْ نَهَى عَنْ مُنْكَرٍ عَدَدَ تِلْكَ السِّتِّينَ وَالثَّلَاثِمِائَةِ فَإِنَّهُ يَمْشِي يَوْمَئِذٍ وَقَدْ زَحْزَحَ نَفْسَهُ عَنِ النَّارِ» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 124,
        "matchingEnglishURN": 5761250,
        "last_updated": null
    },
    {
        "arabicURN": 5618980,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1898",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنِ الْمُنْكَرِ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ» قَالُوا: يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: «أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أجر» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 125,
        "matchingEnglishURN": 5761260,
        "last_updated": null
    },
    {
        "arabicURN": 5618990,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1899",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الصَّدَقَةُ اللِّقْحَةُ الصَّفِيُّ مِنْحَةً وَالشَّاةُ الصَّفِيُّ مِنْحَةً تَغْدُو بِإِنَاءٍ وَتَرُوحُ بِآخَرَ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 126,
        "matchingEnglishURN": 5761270,
        "last_updated": null
    },
    {
        "arabicURN": 5619001,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1900, 1901",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ إِنْسَانٌ أَوْ طَيْرٌ أَوْ بَهِيمَةٌ إِلَّا كَانَت لَهُ صَدَقَة»<br><p>\nوَفِي رِوَايَةٍ لِمُسْلِمٍ عَنْ جَابِرٍ: «وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650, \\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\",\"priority\":50}]",
        "ourHadithNumber": 127,
        "matchingEnglishURN": 5761280,
        "last_updated": null
    },
    {
        "arabicURN": 5619020,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1902",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غُفِرَ لِامْرَأَةٍ مُومِسَةٍ مَرَّتْ بِكَلْبٍ عَلَى رَأْسِ رَكِيٍّ يَلْهَثُ كَادَ يَقْتُلُهُ الْعَطَشُ فَنَزَعَتْ خُفَّهَا فَأَوْثَقَتْهُ بِخِمَارِهَا فَنَزَعَتْ لَهُ مِنَ الْمَاءِ فَغُفِرَ لَهَا بِذَلِكَ» . قِيلَ: إِنَّ لَنَا فِي الْبَهَائِمِ أَجْرًا؟ قَالَ: «فِي كُلِّ ذَاتِ كبد رطبَة أجر»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 128,
        "matchingEnglishURN": 5761290,
        "last_updated": null
    },
    {
        "arabicURN": 5619030,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1903",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ أَمْسَكَتْهَا حَتَّى مَاتَتْ مِنَ الْجُوعِ فَلَمْ تَكُنْ تُطْعِمُهَا وَلَا تُرْسِلُهَا فَتَأْكُلَ مِنْ خَشَاشِ الْأَرْضِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 129,
        "matchingEnglishURN": 5761300,
        "last_updated": null
    },
    {
        "arabicURN": 5619040,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1904",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَرَّ رَجُلٌ بِغُصْنِ شَجَرَةٍ عَلَى ظَهْرِ طَرِيقٍ فَقَالَ: لِأُنَحِّيَنَّ هَذَا عَنْ طَرِيقِ الْمُسلمين لَا يؤذيهم فَأدْخل الْجنَّة \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 130,
        "matchingEnglishURN": 5761310,
        "last_updated": null
    },
    {
        "arabicURN": 5619050,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1905",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ رَأَيْتُ رَجُلًا يَتَقَلَّبُ فِي الْجَنَّةِ فِي شَجَرَةٍ قَطَعَهَا مِنْ ظَهْرِ الطَّرِيقِ كَانَتْ تُؤْذِي النَّاس» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 131,
        "matchingEnglishURN": 5761320,
        "last_updated": null
    },
    {
        "arabicURN": 5619060,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.10",
        "hadithNumber": "1906",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة",
        "hadithText": "وَعَنْ أَبِي بَرْزَةَ قَالَ: قُلْتُ: يَا نَبِيَّ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعْ بِهِ قَالَ: «اعْزِلِ الْأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ» . رَوَاهُ مُسْلِمٌ\nوَسَنَذْكُرُ حَدِيث عدي ابْن حَاتِمٍ: «اتَّقُوا النَّارَ» فِي بَابِ عَلَامَاتِ النُّبُوَّةِ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 132,
        "matchingEnglishURN": 5761330,
        "last_updated": null
    },
    {
        "arabicURN": 5619070,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1907",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ: لَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ جِئْتُ فَلَمَّا تَبَيَّنْتُ وَجْهَهُ عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ. فَكَانَ أَوَّلُ مَا قَالَ: «أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصِلُوا الْأَرْحَامَ وَصَلُّوا بِاللَّيْلِ وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلام» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 133,
        "matchingEnglishURN": 5761350,
        "last_updated": null
    },
    {
        "arabicURN": 5619080,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1908",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اعْبُدُوا الرَّحْمَنَ وَأَطْعِمُوا الطَّعَامَ وَأَفْشُوا السَّلَامَ تَدْخُلُوا الْجَنَّةَ بِسَلام» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 134,
        "matchingEnglishURN": 5761360,
        "last_updated": null
    },
    {
        "arabicURN": 5619090,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1909",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الصَّدَقَةَ لَتُطْفِئُ غَضَبَ الرَّبِّ وَتَدْفَعُ مِيتَةَ السَّوْءِ» . رَوَاهُ التِّرْمِذِيُّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 135,
        "matchingEnglishURN": 5761370,
        "last_updated": null
    },
    {
        "arabicURN": 5619100,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1910",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": ": قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مَعْرُوفٍ صَدَقَةٌ وَإِنَّ مِنَ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": null,
        "ourHadithNumber": 136,
        "matchingEnglishURN": 5761380,
        "last_updated": null
    },
    {
        "arabicURN": 5619110,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1911",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَبَسُّمُكَ فِي وَجْهِ أَخِيك صَدَقَة وأمرك بِالْمَعْرُوفِ صَدَقَة ن وَنَهْيُكَ عَنِ الْمُنْكَرِ صَدَقَةٌ وَإِرْشَادُكَ الرَّجُلَ فِي أَرْضِ الضَّلَالِ لَكَ صَدَقَةٌ وَنَصْرُكَ الرَّجُلَ الرَّدِيءَ الْبَصَرِ لَكَ صَدَقَةٌ وَإِمَاطَتُكَ الْحَجَرَ وَالشَّوْكَ وَالْعَظْمَ عَن الطَّرِيقِ لَكَ صَدَقَةٌ وَإِفْرَاغُكَ مِنْ دَلْوِكَ فِي دَلْوِ أَخِيكَ لَكَ صَدَقَةٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 137,
        "matchingEnglishURN": 5761390,
        "last_updated": null
    },
    {
        "arabicURN": 5619120,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1912",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ: يَا رَسُولَ اللَّهِ إِنَّ أُمَّ سَعْدٍ مَاتَتْ فَأَيُّ الصَّدَقَةِ أَفْضَلُ؟ قَالَ: «الْمَاءُ» . فَحَفَرَ بِئْرًا وَقَالَ: هَذِهِ لأم سعد. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 138,
        "matchingEnglishURN": 5761400,
        "last_updated": null
    },
    {
        "arabicURN": 5619130,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1913",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ مِنْ ثِمَارِ الْجَنَّةِ. وَأَيُّمَا مُسلم سقا مُسْلِمًا عَلَى ظَمَأٍ سَقَاهُ اللَّهُ مِنَ الرَّحِيقِ الْمَخْتُوم» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 139,
        "matchingEnglishURN": 5761410,
        "last_updated": null
    },
    {
        "arabicURN": 5619140,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1914",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة",
        "hadithText": "وَعَن فَاطِمَة بنت قبيس قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْمَالِ لَحَقًّا سِوَى الزَّكَاةِ» ثُمَّ تَلَا: (لَيْسَ الْبَرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قبل الْمشرق وَالْمغْرب)\nالْآيَة. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 140,
        "matchingEnglishURN": 5761420,
        "last_updated": null
    },
    {
        "arabicURN": 5619150,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1915",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ بُهَيْسَةَ عَنْ أَبِيهَا قَالَتْ: قَالَ: يَا رَسُول الله مَا لشَيْء الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «الْمَاءُ» . قَالَ: يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «الْمِلْحُ» . قَالَ: يَا نَبِيَّ الله مَا لاشيء الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «أَنْ تَفْعَلَ الْخَيْر خير لَك» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 141,
        "matchingEnglishURN": 5761430,
        "last_updated": null
    },
    {
        "arabicURN": 5619160,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1916",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من أحيى أَرْضًا مَيِّتَةً فَلَهُ فِيهَا أَجْرٌ وَمَا أَكَلَتِ الْعَافِيَةُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ» . رَوَاهُ النَّسَائِيُّ والدارمي",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 142,
        "matchingEnglishURN": 5761440,
        "last_updated": null
    },
    {
        "arabicURN": 5619170,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1917",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنِ الْبَرَاءِ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَنَحَ مِنْحَةَ لَبَنٍ أَو روق أَوْ هَدَى زُقَاقًا كَانَ لَهُ مِثْلَ عِتْقِ رَقَبَة» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 143,
        "matchingEnglishURN": 5761450,
        "last_updated": null
    },
    {
        "arabicURN": 5619180,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1918",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي جُرَيٍّ جَابِرِ بْنِ سُلَيْمٍ قَالَ: أَتَيْتُ الْمَدِينَةَ فَرَأَيْتُ رَجُلًا يَصْدُرُ النَّاسُ عَنْ رَأْيِهِ لَا يَقُولُ شَيْئًا إِلَّا صَدَرُوا عَنْهُ قُلْتُ مَنْ هَذَا قَالُوا: هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ: عَلَيْكَ السَّلَامُ يَا رَسُولَ اللَّهِ مَرَّتَيْنِ قَالَ: «لَا تقل عَلَيْك السَّلَام فَإِن عَلَيْكَ السَّلَامُ تَحِيَّةُ الْمَيِّتِ قُلِ السَّلَامُ عَلَيْكَ» قلت: أَنْت رَسُول الله؟ قَالَ: «أَنا رَسُول الله الَّذِي إِذا أَصَابَكَ ضُرٌّ فَدَعَوْتَهُ كَشَفَهُ عَنْكَ وَإِنْ أَصَابَكَ عَامُ سَنَةٍ فَدَعَوْتَهُ أَنْبَتَهَا لَكَ وَإِذَا كُنْتَ بِأَرْض قفراء أَوْ فَلَاةٍ فَضَلَّتْ رَاحِلَتُكَ فَدَعَوْتَهُ رَدَّهَا عَلَيْكَ» . قُلْتُ: اعْهَدْ إِلَيَّ. قَالَ: «لَا تَسُبَّنَّ أَحَدًا» قَالَ فَمَا سَبَبْتُ بَعْدَهُ حُرًّا وَلَا عَبْدًا وَلَا بَعِيرًا وَلَا شَاةً. قَالَ: «وَلَا تَحْقِرَنَّ شَيْئًا مِنَ الْمَعْرُوفِ وَأَنْ تُكَلِّمَ أَخَاكَ وَأَنْتَ مُنْبَسِطٌ إِلَيْهِ وَجْهُكَ إِنَّ ذَلِكَ مِنَ الْمَعْرُوفِ وَارْفَعْ إِزَاَرَكَ إِلَى نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَى الْكَعْبَيْنِ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّهَا مِنَ الْمَخِيلَةِ وَإِنَّ اللَّهَ لَا يُحِبُّ الْمَخِيلَةَ وَإِنِ امْرُؤٌ شَتَمَكَ وَعَيَّرَكَ بِمَا يَعْلَمُ فِيكَ فَلَا تعيره بِمَا تعلم فِيهِ فَإِنَّمَا وَبَالُ ذَلِكَ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُدَ وَرَوَى التِّرْمِذِيُّ مِنْهُ حَدِيثَ السَّلَامِ. وَفِي رِوَايَةٍ: «فَيَكُونَ لَكَ أَجْرُ ذَلِكَ وَوَبَالُهُ عَلَيْهِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 144,
        "matchingEnglishURN": 5761460,
        "last_updated": null
    },
    {
        "arabicURN": 5619190,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1919",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَن عَائِشَة إِنَّهُمْ ذَبَحُوا شَاةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَقِيَ مِنْهَا؟» قَالَتْ: مَا بَقِي مِنْهَا إِلَّا كتفها قَالَ: «بَقِي كلهَا غير كتفها» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 145,
        "matchingEnglishURN": 5761470,
        "last_updated": null
    },
    {
        "arabicURN": 5619200,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1920",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَن ابْن عَبَّاس قَالَ ك سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا إِلَّا كَانَ فِي حفظ من الله مادام عَلَيْهِ مِنْهُ خرقَة» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 146,
        "matchingEnglishURN": 5761480,
        "last_updated": null
    },
    {
        "arabicURN": 5619210,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1921",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يَرْفَعُهُ قَالَ: \" ثَلَاثَةٌ يُحِبُّهُمُ اللَّهُ: رَجُلٌ قَامَ مِنَ اللَّيْلِ يَتْلُوا كِتَابَ اللَّهِ وَرَجُلٌ يَتَصَدَّقُ بِصَدَقَةٍ بِيَمِينِهِ يُخْفِيهَا أُرَاهُ قَالَ: مِنْ شِمَالِهِ وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَانْهَزَمَ أَصْحَابُهُ فَاسْتَقْبَلَ الْعَدُوَّ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ أَحَدُ رُوَاتِهِ أَبُو بكر بن عَيَّاش كثير الْغَلَط",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 147,
        "matchingEnglishURN": 5761490,
        "last_updated": null
    },
    {
        "arabicURN": 5619220,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1922",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ثَلَاثَةٌ يُحِبُّهُمُ اللَّهُ وَثَلَاثَةٌ يُبْغِضُهُمُ اللَّهُ فَأَمَّا الَّذِينَ يُحِبُّهُمُ اللَّهُ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّه وَلم يسألهم بِقرَابَة بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَ رَجُلٌ بِأَعْيَانِهِمْ فَأَعْطَاهُ سِرًّا لَا يَعْلَمُ بِعَطِيَّتِهِ إِلَّا اللَّهُ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ فَوَضَعُوا رُءُوسَهُمْ فَقَامَ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّة فلقي الْعَدو فهزموا وَأَقْبل بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ وَالثَّلَاثَةُ الَّذِينَ يُبْغِضُهُمُ اللَّهُ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ والغني الظلوم» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 148,
        "matchingEnglishURN": 5761500,
        "last_updated": null
    },
    {
        "arabicURN": 5619230,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.20",
        "hadithNumber": "1923",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة",
        "hadithText": "وَعَن أنس بن مَالك عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَمَّا خَلَقَ اللَّهُ الْأَرْضَ جَعَلَتْ تَمِيدُ فَخَلَقَ الْجِبَالَ فَقَالَ بِهَا عَلَيْهَا فَاسْتَقَرَّتْ فَعَجِبَتِ الْمَلَائِكَةُ مِنْ شِدَّةِ الْجِبَالِ فَقَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنِ الْجِبَالِ قَالَ نعم الْحَدِيد قَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الْحَدِيدِ قَالَ نَعَمِ النَّارُ فَقَالُوا يَا رب هَل من خلقك شَيْء أَشد من النَّار قَالَ نعم المَاء قَالُوا يَا رب فَهَل مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الْمَاءِ قَالَ نَعَمِ الرِّيحُ فَقَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الرِّيحِ قَالَ نَعَمِ ابْن آدم تصدق بِصَدقَة بِيَمِينِهِ يخفيها من شِمَالِهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ\nوَذُكِرَ حَدِيثُ مُعَاذٍ: «الصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ» . فِي كتاب الْإِيمَان",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 149,
        "matchingEnglishURN": 5761510,
        "last_updated": null
    },
    {
        "arabicURN": 5619240,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.30",
        "hadithNumber": "1924",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثالث",
        "hadithText": "عَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ عَبْدٍ مُسْلِمٍ يُنْفِقُ مِنْ كُلِّ مَالٍ لَهُ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ إِلَّا اسْتَقْبَلَتْهُ حَجَبَةُ الْجَنَّةِ كُلُّهُمْ يَدْعُوهُ إِلَى مَا عِنْدَهُ» . قُلْتُ: وَكَيْفَ ذَلِكَ؟ قَالَ: «إِنْ كَانَتْ إِبِلًا فَبَعِيرَيْنِ وَإِنْ كَانَت بقرة فبقرتين» . رَوَاهُ النَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 150,
        "matchingEnglishURN": 5761530,
        "last_updated": null
    },
    {
        "arabicURN": 5619250,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.30",
        "hadithNumber": "1925",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثالث",
        "hadithText": "وَعَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ قَالَ: حَدَّثَنِي بَعْضِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ ظِلَّ الْمُؤْمِنِ يَوْمَ الْقِيَامَة صدقته» . رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 151,
        "matchingEnglishURN": 5761540,
        "last_updated": null
    },
    {
        "arabicURN": 5619261,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.30",
        "hadithNumber": "1926, 1927",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثالث",
        "hadithText": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ وَسَّعَ عَلَى عِيَالِهِ فِي النَّفَقَةِ يَوْمَ عَاشُورَاءَ وَسَّعَ اللَّهُ عَلَيْهِ سَائِرَ سَنَتِهِ» . قَالَ سُفْيَانُ: إِنَّا قَدْ جربناه فوجدناه كَذَلِك. رَوَاهُ رزين<br><p>\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْهُ وَعَنْ أبي هُرَيْرَة وَأبي سعيد وَجَابِر وَضَعفه",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\":\"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\",\"grade\":\"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641, \\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\",\"priority\":50}]",
        "ourHadithNumber": 152,
        "matchingEnglishURN": 5761550,
        "last_updated": null
    },
    {
        "arabicURN": 5619280,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "7.30",
        "hadithNumber": "1928",
        "bookName": "كتاب الزكاة",
        "babName": "باب فضل الصدقة - الفصل الثالث",
        "hadithText": "وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ أَبُو ذَرٍّ: يَا نَبِيَّ اللَّهِ أَرَأَيْتَ الصَّدَقَةُ مَاذَا هِيَ؟ قَالَ: «أَضْعَافٌ مُضَاعَفَةٌ وَعِنْدَ اللَّهِ الْمَزِيدُ» . رَوَاهُ أَحْمد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 153,
        "matchingEnglishURN": 5761560,
        "last_updated": null
    },
    {
        "arabicURN": 5619290,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1929",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "عَنْ أَبِي هُرَيْرَةَ وَحَكِيمِ بْنِ حِزَامٍ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وأبدأ بِمن تعول» . رَوَاهُ البُخَارِيّ وَمُسلم عَن حَكِيم وَحده",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 154,
        "matchingEnglishURN": 5761570,
        "last_updated": null
    },
    {
        "arabicURN": 5619300,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1930",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَت لَهُ صَدَقَة»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 155,
        "matchingEnglishURN": 5761580,
        "last_updated": null
    },
    {
        "arabicURN": 5619310,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1931",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دِينَار أنفقته فِي سَبِيل الله ودينار أنفقته فِي رَقَبَةٍ وَدِينَارٌ تَصَدَّقْتَ بِهِ عَلَى مِسْكِينٍ وَدِينَارٌ أَنْفَقْتَهُ عَلَى أَهْلِكَ أَعْظَمُهَا أَجْرًا الَّذِي أنفقته على أهلك» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 156,
        "matchingEnglishURN": 5761590,
        "last_updated": null
    },
    {
        "arabicURN": 5619320,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1932",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ دِينَارٍ يُنْفِقُهُ الرَّجُلُ دِينَارٌ يُنْفِقُهُ عَلَى عِيَالِهِ وَدِينَارٌ يُنْفِقُهُ عَلَى دَابَّتِهِ فِي سَبِيلِ اللَّهِ وَدِينَارٌ يُنْفِقُهُ عَلَى أَصْحَابه فِي سَبِيل الله» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 157,
        "matchingEnglishURN": 5761600,
        "last_updated": null
    },
    {
        "arabicURN": 5619330,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1933",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ أَلِيَ أَجْرٌ أَنْ أَنْفِقَ عَلَى بَنِي أَبِي سَلَمَةَ؟ إِنَّمَا هُمْ بَنِيَّ فَقَالَ: «أَنَفِقِي عَلَيْهِمْ فَلَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِم»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 158,
        "matchingEnglishURN": 5761610,
        "last_updated": null
    },
    {
        "arabicURN": 5619340,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1934",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ وَلَوْ مِنْ حُلِيِّكُنَّ» قَالَتْ فَرَجَعْتُ إِلَى عَبْدِ اللَّهِ فَقُلْتُ إِنَّكَ رَجُلٌ خَفِيفُ ذَاتِ الْيَدِ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَنَا بِالصَّدَقَةِ فَأْتِهِ فَاسْأَلْهُ فَإِنْ كَانَ ذَلِك يَجْزِي عني وَإِلَّا صرفتها إِلَى غَيْركُمْ قَالَت فَقَالَ لِي عَبْدُ اللَّهِ بَلِ ائْتِيهِ أَنْتِ قَالَتْ فَانْطَلَقْتُ فَإِذَا امْرَأَةٌ مِنَ الْأَنْصَارِ بِبَابِ رَسُولِ الله صلى الله عَلَيْهِ وَسلم حَاجَتي حَاجَتهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قد ألقيت عَلَيْهِ المهابة. فَقَالَت فَخَرَجَ عَلَيْنَا بِلَالٌ فَقُلْنَا لَهُ ائْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ أَنَّ امْرَأتَيْنِ بِالْبَابِ تسألانك أتجزئ الصَّدَقَة عَنْهُمَا على أَزْوَاجِهِمَا وَعَلَى أَيْتَامٍ فِي حُجُورِهِمَا وَلَا تُخْبِرْهُ مَنْ نَحْنُ. قَالَتْ فَدَخَلَ بِلَالٌ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ هما» . فَقَالَ امْرَأَة من الْأَنْصَار وَزَيْنَب فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّ الزَّيَانِبِ» . قَالَ امْرَأَةُ عَبْدِ اللَّهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَهما أَجْرَانِ أجر الْقَرَابَة وَأجر الصَّدَقَة» . وَاللَّفْظ لمُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 159,
        "matchingEnglishURN": 5761620,
        "last_updated": null
    },
    {
        "arabicURN": 5619350,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1935",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ: أَنَّهَا أَعْتَقَتْ وَلِيدَةً فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَوْ أَعْطَيْتِهَا أخوالك كَانَ أعظم لأجرك»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 160,
        "matchingEnglishURN": 5761630,
        "last_updated": null
    },
    {
        "arabicURN": 5619360,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1936",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَن عَائِشَة قَالَت: يَا رَسُول الله إِن لِي جَارَيْنِ فَإِلَى أَيِّهِمَا أُهْدِي؟ قَالَ: «إِلَى أقربهما مِنْك بَابا» . رَوَاهُ البُخَارِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 161,
        "matchingEnglishURN": 5761640,
        "last_updated": null
    },
    {
        "arabicURN": 5619370,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.10",
        "hadithNumber": "1937",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا طَبَخْتَ مَرَقَةً فَأكْثر ماءها وتعاهد جيرانك» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 162,
        "matchingEnglishURN": 5761650,
        "last_updated": null
    },
    {
        "arabicURN": 5619380,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1938",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ؟ قَالَ: «جُهْدُ الْمُقِلِّ وَابْدَأْ بِمَنْ تَعُولُ» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 163,
        "matchingEnglishURN": 5761660,
        "last_updated": null
    },
    {
        "arabicURN": 5619390,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1939",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَهِيَ عَلَى ذِي الرَّحِمِ ثِنْتَانِ: صَدَقَةٌ وَصِلَةٌ \". رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 164,
        "matchingEnglishURN": 5761670,
        "last_updated": null
    },
    {
        "arabicURN": 5619400,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1940",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَن أَي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: عِنْدِي دِينَار فَقَالَ: «أَنْفِقْهُ عَلَى نَفْسِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى وَلَدِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى أَهْلِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى خَادِمِكَ» . قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْت أعلم» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 165,
        "matchingEnglishURN": 5761680,
        "last_updated": null
    },
    {
        "arabicURN": 5619410,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1941",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ النَّاسِ؟ رَجُلٌ مُمْسِكٌ بِعِنَانِ فَرَسِهِ فِي سَبِيلِ اللَّهِ. أَلَا أُخْبِرُكُمْ بِالَّذِي يَتْلُوهُ؟ رَجُلٌ مُعْتَزِلٌ فِي غُنَيْمَةٍ لَهُ يُؤَدِّي حَقَّ اللَّهِ فِيهَا. أَلَا أُخْبِرُكُمْ بِشَرِّ النَّاسِ رَجُلٌ يُسْأَلُ بِاللَّهِ وَلَا يُعْطِي بِهِ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَالدَّارِمِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\\u064c\", \"priority\": 50}]",
        "ourHadithNumber": 166,
        "matchingEnglishURN": 5761690,
        "last_updated": null
    },
    {
        "arabicURN": 5619420,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1942",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَن أم بحيد قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ مُحْرَقٍ» . رَوَاهُ مَالِكٌ وَالنَّسَائِيُّ وَرَوَى التِّرْمِذِيُّ وَأَبُو دَاوُدَ مَعْنَاهُُُُُُُ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 167,
        "matchingEnglishURN": 5761700,
        "last_updated": null
    },
    {
        "arabicURN": 5619430,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1943",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَعَاذَ مِنْكُمْ بِاللَّهِ فَأَعِيذُوهُ وَمَنْ سَأَلَ بِاللَّهِ فَأَعْطُوهُ وَمَنْ دَعَاكُمْ فَأَجِيبُوهُ وَمَنْ صَنَعَ إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ فَإِنْ لَمْ تَجِدُوا مَا تُكَافِئُوهُ فَادْعُوا لَهُ حَتَّى تُرَوْا أَنْ قَدْ كَافَأْتُمُوهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَالنَّسَائِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 168,
        "matchingEnglishURN": 5761710,
        "last_updated": null
    },
    {
        "arabicURN": 5619440,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.20",
        "hadithNumber": "1944",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثاني",
        "hadithText": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُسْأَلُ بِوَجْهِ اللَّهِ إِلَّا الْجنَّة» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0636\\u064e\\u0639\\u0650\\u064a\\u0641\", \"priority\": 50}]",
        "ourHadithNumber": 169,
        "matchingEnglishURN": 5761720,
        "last_updated": null
    },
    {
        "arabicURN": 5619450,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.30",
        "hadithNumber": "1945",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة",
        "hadithText": "عَن أنس بن مَالك قَالَ: كَانَ أَبُو طَلْحَة أَكثر أَنْصَارِي بِالْمَدِينَةِ مَالًا مِنْ نَخْلٍ وَكَانَ أَحَبُّ أَمْوَالِهِ إِلَيْهِ بيرحاء وَكَانَت مُسْتَقْبل الْمَسْجِدَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ قَالَ أنس فَلَمَّا نزلت (لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ)\nقَامَ أَبُو طَلْحَة فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ تَعَالَى يَقُول: (لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ)\nوَإِنَّ أَحَبَّ مَالِي إِلَيَّ بَيْرَحَاءُ وَإِنَّهَا صَدَقَةٌ لله أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَخٍ بَخٍ ذَلِكَ مَالٌ رَابِحٌ وَقَدْ سَمِعْتُ مَا قُلْتَ وَإِنَّى أَرَى أَنْ تَجْعَلَهَا فِي الْأَقْرَبِينَ» . فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ فَقَسَّمَهَا أَبُو طَلْحَة فِي أَقَاربه وَفِي بني عَمه",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 170,
        "matchingEnglishURN": 5761730,
        "last_updated": null
    },
    {
        "arabicURN": 5619460,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "8.30",
        "hadithNumber": "1946",
        "bookName": "كتاب الزكاة",
        "babName": "باب أفضل الصدقة - الفصل الثالث",
        "hadithText": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَةِ أَنْ تُشْبِعَ كَبِدًا جَائِعًا» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 171,
        "matchingEnglishURN": 5761740,
        "last_updated": null
    },
    {
        "arabicURN": 5619470,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.10",
        "hadithNumber": "1947",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذْ أَنْفَقَتِ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بعض شَيْئا»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 172,
        "matchingEnglishURN": 5761750,
        "last_updated": null
    },
    {
        "arabicURN": 5619480,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.10",
        "hadithNumber": "1948",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا مِنْ غَيْرِ أَمْرِهِ فَلَهَا نِصْفُ أَجْرِهِ»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 173,
        "matchingEnglishURN": 5761760,
        "last_updated": null
    },
    {
        "arabicURN": 5619490,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.10",
        "hadithNumber": "1949",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الأول",
        "hadithText": "وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْخَازِنُ الْمُسْلِمُ الْأَمِينُ الَّذِي يُعْطِي مَا أُمِرَ بِهِ كَامِلًا مُوَفَّرًا طَيِّبَةً بِهِ نَفْسُهُ فَيَدْفَعُهُ إِلَى الَّذِي أَمر لَهُ بِهِ أحد المتصدقين»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 174,
        "matchingEnglishURN": 5761770,
        "last_updated": null
    },
    {
        "arabicURN": 5619500,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.10",
        "hadithNumber": "1950",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الأول",
        "hadithText": "وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أُمِّي افْتُلِتَتْ نَفْسَهَا وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ فَهَلْ لَهَا أَجْرٌ إِنْ تَصَدَّقت عَنْهَا؟ قَالَ: نعم \"",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u064e\\u0642\\u064c \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 175,
        "matchingEnglishURN": 5761780,
        "last_updated": null
    },
    {
        "arabicURN": 5619510,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.20",
        "hadithNumber": "1951",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الثاني",
        "hadithText": "عَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حُجَّةِ الْوَدَاعِ: «لَا تُنْفِقُ امْرَأَةٌ شَيْئًا مِنْ بَيْتِ زَوْجِهَا إِلَّا بِإِذْنِ زَوْجِهَا» . قِيلَ: يَا رَسُولَ اللَّهِ وَلَا الطَّعَامَ؟ قَالَ: «ذَلِكَ أفضل أَمْوَالنَا» . رَوَاهُ التِّرْمِذِيّ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 176,
        "matchingEnglishURN": 5761790,
        "last_updated": null
    },
    {
        "arabicURN": 5619520,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.20",
        "hadithNumber": "1952",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الثاني",
        "hadithText": "وَعَنْ سَعْدٍ قَالَ: لَمَّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّسَاءُ قَامَتِ امْرَأَةٌ جَلِيلَةٌ كَأَنَّهَا مِنْ نِسَاءِ مُضَرَ فَقَالَتْ: يَا نَبِيَّ اللَّهِ إِنَّا كَلٌّ عَلَى آبَائِنَا وَأَبْنَائِنَا وَأَزْوَاجِنَا فَمَا يَحِلُّ لَنَا مِنْ أَمْوَالِهِمْ؟ قَالَ: «الرطب تأكلنه وتهدينه» . رَوَاهُ أَبُو دَاوُد",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0644\\u0645 \\u062a\\u062a\\u0645\\u0651 \\u062f\\u0631\\u0627\\u0633\\u062a\\u0647\", \"priority\": 50}]",
        "ourHadithNumber": 177,
        "matchingEnglishURN": 5761800,
        "last_updated": null
    },
    {
        "arabicURN": 5619530,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "9.30",
        "hadithNumber": "1953",
        "bookName": "كتاب الزكاة",
        "babName": "باب صدقة المرأة من مال الزوج - الفصل الثالث",
        "hadithText": "عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَ: أَمَرَنِي مَوْلَايَ أَنْ أُقَدِّدَ لَحْمًا فَجَاءَنِي مِسْكِينٌ فَأَطْعَمْتُهُ مِنْهُ فَعَلِمَ بِذَلِكَ مَوْلَايَ فَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَدَعَاهُ فَقَالَ: «لِمَ ضَرَبْتَهُ؟» فَقَالَ يُعْطِي طَعَامِي بِغَيْرِ أَنْ آمُرَهُ فَقَالَ: «الْأَجْرُ بَيْنَكُمَا» . وَفِي رِوَايَةٍ قَالَ: كُنْتُ مَمْلُوكًا فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أأتصدق مِنْ مَالِ مَوَالِيَّ بِشَيْءٍ؟ قَالَ: «نَعَمْ وَالْأَجْرُ بَيْنَكُمَا نِصْفَانِ» . رَوَاهُ مُسْلِمٌ",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 178,
        "matchingEnglishURN": 5761810,
        "last_updated": null
    },
    {
        "arabicURN": 5619540,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "10.10",
        "hadithNumber": "1954",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا يعود في الصدقة - الفصل الأول",
        "hadithText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَأَضَاعَهُ الَّذِي كَانَ عِنْدَهُ فَأَرَدْتُ أَنْ أَشْتَرِيَهُ وَظَنَنْتُ أَنَّهُ يَبِيعُهُ بِرُخْصٍ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَا تَشْتَرِهِ وَلَا تَعُدْ فِي صَدَقَتِكَ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ» . وَفِي رِوَايَةٍ: «لَا تَعُدْ فِي صَدَقَتِكَ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كالعائد فِي قيئه»",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0645\\u064f\\u062a\\u0651\\u064e\\u0641\\u0642 \\u0639\\u064e\\u0644\\u064e\\u064a\\u0652\\u0647\\u0650\", \"priority\": 50}]",
        "ourHadithNumber": 179,
        "matchingEnglishURN": 5761820,
        "last_updated": null
    },
    {
        "arabicURN": 5619550,
        "collection": "mishkat",
        "volumeNumber": 1,
        "bookNumber": 6,
        "babNumber": "10.10",
        "hadithNumber": "1955",
        "bookName": "كتاب الزكاة",
        "babName": "باب من لا يعود في الصدقة - الفصل الأول",
        "hadithText": "وَعَنْ بُرَيْدَةَ قَالَ: كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أَتَتْهُ امْرَأَةٌ فَقَالَت يَا رَسُول الله إِنِّي كنت تَصَدَّقْتُ عَلَى أُمِّي بِجَارِيَةٍ وَإِنَّهَا مَاتَتْ قَالَ: «وَجَبَ أَجَرُكِ وَرَدَّهَا عَلَيْكِ الْمِيرَاثُ» . قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ كَانَ عَلَيْهَا صَوْمُ شَهْرٍ أفأصوم عَنْهَا قَالَ: «صومي عَنْهَا» . قَالَت يَا رَسُول الله إِنَّهَا لَمْ تَحُجَّ قَطُّ أَفَأَحُجُّ عَنْهَا قَالَ: «نعم حجي عَنْهَا» . رَوَاهُ مُسلم",
        "annotations": null,
        "bookID": "6.0",
        "grade1": "[{\"graded_by\": \"\\u0627\\u0644\\u0623\\u0644\\u0628\\u0627\\u0646\\u064a\", \"grade\": \"\\u0635\\u064e\\u062d\\u0650\\u064a\\u062d\", \"priority\": 50}]",
        "ourHadithNumber": 180,
        "matchingEnglishURN": 5761830,
        "last_updated": null
    }
]